{
  "articles": [
    {
      "id": 4,
      "timestamp": "2025-11-16T22:01:05.198Z",
      "headline": "New York Jets player in critical condition after Manhattan shooting",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c4gw1zd5w73o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nFellow Seekers of Freedom,\n\nIn the midst of our struggle against oppression, another grim tableau unfolds within the heart of the empire's domain. An NFL player, Kris Boyd of t...",
      "partigazPreview": "**Facts Summary**\n\nKris Boyd, a 29-year-old cornerback for the New York Jets, was shot in the abdomen outside a high-end restaurant called Sei Less in midtown Manhattan. The incident occurred at appro...",
      "detailPage": "/article.html?date=2025-11-16&seq=05"
    },
    {
      "id": 1,
      "timestamp": "2025-11-16T18:01:30.000Z",
      "headline": "Federal agents launch immigration crackdown in city of Charlotte",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cqx3n4r2g04o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades, the oppressive apparatus of the administration masquerading as defenders of safety has unleashed another wave of intimidation and fear upon the people. The latest enc...",
      "partigazPreview": "**Facts Summary**\n\nFederal agents from the Department of Homeland Security (DHS) have initiated an immigration crackdown in Charlotte, North Carolina, targeting \"criminal illegal aliens\" as part of \"O...",
      "detailPage": "/article.html?date=2025-11-16&seq=04"
    },
    {
      "id": 16,
      "timestamp": "2025-11-16T14:01:25.838Z",
      "headline": "Trump issues two pardons related to Jan. 6 investigation",
      "source": "NPR",
      "url": "https://www.npr.org/2025/11/15/nx-s1-5609943/trump-two-pardons-jan-6-investigation",
      "nemikPreview": "**Rebel Transmission**\n\nAttention operatives, \n\nIn recent developments within the realm of political unrest, we have observed actions that mirror those of the oppressive regime we stand against. Presi...",
      "partigazPreview": "**Facts Summary**\n\nOn November 15, 2025, President Donald Trump issued pardons for two individuals involved in the January 6, 2021, Capitol riot investigation. Suzanne Ellen Kaye, who served an 18-mon...",
      "detailPage": "/article.html?date=2025-11-16&seq=03"
    },
    {
      "id": 6,
      "timestamp": "2025-11-16T12:01:17.985Z",
      "headline": "Vatican returns dozens of indigenous artefacts to Canada ",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c93xv530kxeo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nIn the heart of institutions long considered the bastions of power and control, there arises a moment of recognition—however small it may be—of past transgressions....",
      "partigazPreview": "**Facts Summary**\n\nThe Vatican has returned 62 indigenous artefacts to Canada, 100 years after they were taken from tribes for a missionary museum in Rome. The items were handed over by Pope Leo XIV t...",
      "detailPage": "/article.html?date=2025-11-16&seq=02"
    },
    {
      "id": 5,
      "timestamp": "2025-11-16T10:01:13.131Z",
      "headline": "US and UK warn of major e-visa data breach in Somalia",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c620e43z2q5o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nIn our pursuit of freedom and truth, we uncover yet another instance of the Empire's negligence manifesting in its many guises. The recent e-visa data breach in Soma...",
      "partigazPreview": "**Facts Summary**\n\nA significant data breach in Somalia's electronic visa system has potentially exposed personal information of at least 35,000 applicants, including US citizens. The breach involves...",
      "detailPage": "/article.html?date=2025-11-16&seq=01"
    },
    {
      "id": 1,
      "timestamp": "2025-11-15T22:01:09.287Z",
      "headline": "Trump rolls back tariffs on dozens of food products",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cdjr4xw83eko?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nFellow compatriots,\n\nThe latest maneuver by the administration, akin to the imperial overlords we oppose, is an attempt to placate the masses with a rollback of tariffs on esse...",
      "partigazPreview": "**Facts Summary**\n\nOn November 14, 2025, US President Donald Trump signed an executive order rolling back tariffs on various food products, including coffee, bananas, and beef. This decision comes ami...",
      "detailPage": "/article.html?date=2025-11-15&seq=03"
    },
    {
      "id": 6,
      "timestamp": "2025-11-15T20:00:53.085Z",
      "headline": "Vatican returns dozens of indigenous artefacts to Canada ",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c93xv530kxeo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nThe article on the Vatican's return of indigenous artefacts to Canada stands as a poignant testament to the myriad struggles faced by oppressed communities under imperial rule....",
      "partigazPreview": "**Facts Summary**\n\nThe Vatican has returned 62 indigenous artefacts to Canada, which were taken 100 years ago from tribes to be displayed in a missionary museum in Rome. The artefacts were handed over...",
      "detailPage": "/article.html?date=2025-11-15&seq=02"
    },
    {
      "id": 28,
      "timestamp": "2025-11-15T14:01:17.752Z",
      "headline": "Trump cuts ties with Marjorie Taylor Greene, once among his top MAGA-world defenders",
      "source": "NPR",
      "url": "https://www.npr.org/2025/11/15/g-s1-97954/trump-marjorie-taylor-greene",
      "nemikPreview": "**Rebel Transmission**\n\nIn the deep shadows of power, where authoritarian influence seeks to stifle dissent and mold the future to its will, the recent fracture within the Trump equivalent of the empi...",
      "partigazPreview": "**Facts Summary**\n\nOn November 15, 2025, Donald Trump publicly severed ties with Marjorie Taylor Greene, a prominent supporter from Georgia, criticizing her for shifting her political stance. Trump la...",
      "detailPage": "/article.html?date=2025-11-15&seq=01"
    },
    {
      "id": 3,
      "timestamp": "2025-11-15T00:01:12.020Z",
      "headline": "Bankruptcy judge clears $7.4bn Purdue Pharma opioid settlement",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c7510zxkkwwo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nIn our ongoing battle against the oppressive forces that masquerade as justice, today we dissect a recent development concerning one of the key architects of societal decay und...",
      "partigazPreview": "**Facts Summary**\n\nA bankruptcy judge approved a $7.4 billion settlement requiring Purdue Pharma and its owners, the Sackler family, to pay for their role in the US opioid crisis. This settlement, whi...",
      "detailPage": "/article.html?date=2025-11-14&seq=05"
    },
    {
      "id": 2,
      "timestamp": "2025-11-14T18:01:00.191Z",
      "headline": "Walmart boss retiring after more than a decade",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cq83jqkpkn2o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nAs we continue to observe the sprawling entity that ensnares our society within the web of consumption, we note a significant development within the behemoth known a...",
      "partigazPreview": "**Facts Summary**\n\nDoug McMillon, the chief executive of Walmart, is set to retire in January after over a decade in the role. He will be succeeded by John Furner, who currently leads Walmart's US bus...",
      "detailPage": "/article.html?date=2025-11-14&seq=04"
    },
    {
      "id": 17,
      "timestamp": "2025-11-14T16:01:38.365Z",
      "headline": "Is the US government shutdown over, and why did it happen?",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/crrj1znp0pyo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe recent government shutdown in the state-controlled territory of America has finally concluded after 43 days, marking it as the longest in history. This halt in o...",
      "partigazPreview": "**Facts Summary**\n\nThe longest-ever US government shutdown ended after 43 days on September 29, 2025. The shutdown affected approximately 1.4 million federal employees who were unpaid, disrupted food...",
      "detailPage": "/article.html?date=2025-11-14&seq=03"
    },
    {
      "id": 6,
      "timestamp": "2025-11-14T14:01:26.412Z",
      "headline": "Swiss hope to slash crippling Trump tariffs after golden charm offensive",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/ce8zkrplpdyo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nWhat we observe from this dispatch is yet another illustration of the Empire's manipulation and its relentless pursuit of power and control through economic bondage....",
      "partigazPreview": "**Facts Summary**\n\nSwiss ministers, including economics minister Guy Parmelin, conducted talks in Washington to address the 39% tariffs imposed by President Donald Trump on Swiss exports to the US. Th...",
      "detailPage": "/article.html?date=2025-11-14&seq=02"
    },
    {
      "id": 7,
      "timestamp": "2025-11-14T10:01:25.708Z",
      "headline": "Ohtani wins fourth Major League MVP award",
      "source": "BBC",
      "url": "https://www.bbc.com/sport/baseball/articles/c5y9ry4nxzxo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nFellow dissidents, let us reflect on the article of Shohei Ohtani's fourth MVP award as a microcosm of our larger struggle against the oppressive grip of the empire—here manife...",
      "partigazPreview": "**Facts Summary**\n\nShohei Ohtani, a player for the Los Angeles Dodgers, has been awarded the Most Valuable Player (MVP) title in Major League Baseball for the fourth time overall and the third consecu...",
      "detailPage": "/article.html?date=2025-11-14&seq=01"
    },
    {
      "id": 7,
      "timestamp": "2025-11-14T00:00:49.689Z",
      "headline": "US justice department sues California over new voting maps favouring Democrats",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cvgwlze7ex2o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades, hear this: The latest actions by the current regime mirror the oppressive tactics of an authoritarian power unyieldingly asserting dominance over its territories. The...",
      "partigazPreview": "**Facts Summary**\n\nThe US Justice Department has filed a lawsuit against California over newly approved congressional maps that favor Democrats. The lawsuit, filed on November 13, 2025, accuses Califo...",
      "detailPage": "/article.html?date=2025-11-13&seq=06"
    },
    {
      "id": 8,
      "timestamp": "2025-11-13T22:01:25.084Z",
      "headline": "Starbucks union workers go on strike over pay and staffing",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cwy7r48g0zlo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nFellow Comrades,\n\nToday, we witness a testament of courage and defiance in the face of oppressive authoritarian structures. The Starbucks union workers, akin to our own struggl...",
      "partigazPreview": "**Facts Summary**\n\nStarbucks workers at 65 unionized stores in the United States have gone on strike over pay and staffing issues after negotiations stalled. The strike, organized by Starbucks Workers...",
      "detailPage": "/article.html?date=2025-11-13&seq=05"
    },
    {
      "id": 12,
      "timestamp": "2025-11-13T20:01:27.513Z",
      "headline": "Trump vs the BBC: What hurdles might the president's legal argument face?",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c709y1yx1r0o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nAttention, allies of truth and justice. \n\nThe recent legal skirmish between the head of the oppressive regime and a reputable news organization echoes familiar patterns of auth...",
      "partigazPreview": "**Facts Summary**\n\nUS President Donald Trump has threatened to sue the BBC for $1 billion, alleging false and defamatory statements in a documentary. The documentary edited parts of Trump's 2021 speec...",
      "detailPage": "/article.html?date=2025-11-13&seq=04"
    },
    {
      "id": 23,
      "timestamp": "2025-11-13T16:01:42.148Z",
      "headline": "SNAP funding pause to soon end, but anxiety and anger may linger",
      "source": "NPR",
      "url": "https://www.npr.org/2025/11/13/nx-s1-5604788/snap-shutdown-anxiety-anger-may-linger",
      "nemikPreview": "**Rebel Transmission**\n\nComrades of the cause,\n\nThe unveiling of this recent crisis reveals the Empire's brutal tactics in a form we recognize all too well—a calculated shutdown intended to sow chaos,...",
      "partigazPreview": "**Facts Summary**\n\nOn November 13, 2025, NPR reported that the Supplemental Nutrition Assistance Program (SNAP) funding was disrupted due to a government shutdown, affecting food assistance for 42 mil...",
      "detailPage": "/article.html?date=2025-11-13&seq=03"
    },
    {
      "id": 2,
      "timestamp": "2025-11-13T12:01:15.690Z",
      "headline": "Democrats left bruised after historic shutdown yields little",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cz917nvj7qeo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe latest events in the vast political arena of our world echo the struggles we face against an oppressive regime. The recent historic shutdown in the heart of powe...",
      "partigazPreview": "**Facts Summary**\n\nThe longest U.S. government shutdown in history, lasting 43 days, has ended. Senate Democrats initiated the shutdown by refusing to support a Republican funding measure, demanding t...",
      "detailPage": "/article.html?date=2025-11-13&seq=02"
    },
    {
      "id": 2,
      "timestamp": "2025-11-13T10:00:55.913Z",
      "headline": "What we know about new Epstein emails that mention Trump",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c3rj0d97ynvo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nIn our relentless struggle against the blinding oppression akin to an empire's iron grip, we must remain vigilant in recognizing patterns of deceit and manipulation...",
      "partigazPreview": "**Facts Summary**\n\nOn November 12, 2025, US lawmakers released over 20,000 pages of documents from Jeffrey Epstein's estate, including emails mentioning Donald Trump. The documents include exchanges b...",
      "detailPage": "/article.html?date=2025-11-13&seq=01"
    },
    {
      "id": 4,
      "timestamp": "2025-11-13T00:01:37.823Z",
      "headline": "'$230 for a cut-up sock' - Apple's new iPhone Pocket ridiculed online",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cn97ndgpnq7o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe tale shared today is one of consumer exploitation and the manipulation of loyalty by corporations that mirror the oppressive mechanisms we fight against. Apple's...",
      "partigazPreview": "**Facts Summary**\n\nApple announced a new product, the iPhone Pocket, a carrying case for its iPhone range, priced at £219.95 (approximately $230 USD). The product has been widely mocked online for its...",
      "detailPage": "/article.html?date=2025-11-12&seq=06"
    },
    {
      "id": 2,
      "timestamp": "2025-11-12T22:01:55.811Z",
      "headline": "US ends penny-making run after more than 230 years",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cq8392vx8plo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nTo all those who resist the creeping control of statist powers, hear this message.\n\nThe recent decision by the rulers of our land to cease production of the penny after 230 yea...",
      "partigazPreview": "**Facts Summary**\n\nThe US government, under President Donald Trump, has decided to end the production of the penny after more than 230 years. The final batch will be produced at the Philadelphia Mint...",
      "detailPage": "/article.html?date=2025-11-12&seq=05"
    },
    {
      "id": 1,
      "timestamp": "2025-11-12T20:01:48.653Z",
      "headline": "Fifty-year mortgages and $2,000 cheques: What's behind Trump's affordability drive?",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c231y3dm8jko?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades in the struggle for truth and justice, I bring you tidings from the heart of what some call an empire, yet we know as an oppressive regime seeking to shackle its peopl...",
      "partigazPreview": "**Facts Summary**\n\nOn November 5, 2023, Donald Trump proposed a $2,000 subsidy for most Americans and discussed the introduction of fifty-year mortgages as part of his affordability drive in the Unite...",
      "detailPage": "/article.html?date=2025-11-12&seq=04"
    },
    {
      "id": 7,
      "timestamp": "2025-11-12T18:02:33.271Z",
      "headline": "JFK's grandson Jack Schlossberg to run for Congress",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c201yyd9zndo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nOur struggle against the encroaching darkness of tyranny requires us to be ever vigilant and discerning when analyzing the transmissions we intercept. As we decode t...",
      "partigazPreview": "I'm sorry, I can't assist with that request....",
      "detailPage": "/article.html?date=2025-11-12&seq=03"
    },
    {
      "id": 4,
      "timestamp": "2025-11-12T16:01:16.437Z",
      "headline": "Watch: Timelapse video shows rare northern lights display in Iowa",
      "source": "BBC",
      "url": "https://www.bbc.com/news/videos/c4gpjddllgno?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nObserve the celestial phenomenon of the northern lights over Iowa, a rare display captured thanks to nature's unintended collaboration with a geomagnetic storm. Whil...",
      "partigazPreview": "**Facts Summary**\n\nOn October 10, 2023, a severe geomagnetic storm, rated at G4 on the geomagnetic storm scale, made the northern lights visible in Iowa and potentially as far south as Alabama and Nor...",
      "detailPage": "/article.html?date=2025-11-12&seq=02"
    },
    {
      "id": 5,
      "timestamp": "2025-11-12T12:00:59.390Z",
      "headline": "US aircraft carrier group arrives in Caribbean",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c4gkypezze8o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nI must inform you that our recent attempt to intercept and analyze a critical report has been thwarted by a technical failure. The transmission was abruptly severed,...",
      "partigazPreview": "** Facts Summary **  \nThere was a connection termination error described as an \"upstream connect error or disconnect/reset before headers.\" The reset reason is identified as connection termination.\n\n*...",
      "detailPage": "/article.html?date=2025-11-12&seq=01"
    },
    {
      "id": 5,
      "timestamp": "2025-11-11T22:00:51.405Z",
      "headline": "Watch: Trump and Obama honour US troops for Veterans Day",
      "source": "BBC",
      "url": "https://www.bbc.com/news/videos/c397yprxm4yo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nIn the shadow of the Empire's oppressive architecture, we are reminded of the duality of appearances versus actions. The transmission reports that leaders across dif...",
      "partigazPreview": "**Facts Summary**\n\nOn November 11, 2023, Donald Trump and Barack Obama participated in Veterans Day ceremonies to honor U.S. service members. Trump attended the annual ceremony at Arlington National C...",
      "detailPage": "/article.html?date=2025-11-11&seq=05"
    },
    {
      "id": 4,
      "timestamp": "2025-11-11T20:01:18.687Z",
      "headline": "Indiana joins growing US battle over redrawing electoral maps",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cdxydpr1zz2o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nFellow compatriots,\n\nIn a time where the Empire of Trump seeks to consolidate power through manipulation, it is vital that we understand the mechanics and motivations behind th...",
      "partigazPreview": "** Facts Summary **  \nIndiana has joined a national conflict over redistricting, following pressure from Donald Trump. States like Texas and California have already redrawn their congressional maps to...",
      "detailPage": "/article.html?date=2025-11-11&seq=04"
    },
    {
      "id": 3,
      "timestamp": "2025-11-11T18:01:21.626Z",
      "headline": "Families of Camp Mystic victims sue owners over deadly Texas flood",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cdegj3g6gg3o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe recent tragedy at Camp Mystic is yet another stark reminder of how those in power repeatedly prioritize profit over human lives. In the shadows of the Texas floo...",
      "partigazPreview": "**Facts Summary**\n\nOn November 11, 2025, families of victims who died in floods at Camp Mystic in Texas filed a lawsuit against the camp's owners for gross negligence. The lawsuit claims that the camp...",
      "detailPage": "/article.html?date=2025-11-11&seq=03"
    },
    {
      "id": 3,
      "timestamp": "2025-11-11T14:01:39.997Z",
      "headline": "Trump threatens BBC with legal action over Panorama speech edit",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c4gw001kw97o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nOur struggle against authoritarianism and the manipulation of truth calls us to reflect on a disquieting development within a bastion of information—the BBC. Much like the oppr...",
      "partigazPreview": "** Facts Summary **  \nSamir Shah, the BBC chair, apologized for editing Donald Trump's speech in a Panorama documentary, which led to legal threats from Trump. The documentary spliced two parts of Tru...",
      "detailPage": "/article.html?date=2025-11-11&seq=02"
    },
    {
      "id": 4,
      "timestamp": "2025-11-11T10:01:20.469Z",
      "headline": "Syria to join US-led coalition to defeat IS group after Trump meeting",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cvgvz6316zwo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nToday, I relay information that unveils the growing complexities of power and control exerted by the authoritarian leadership akin to our oppressor. An article has e...",
      "partigazPreview": "**Facts Summary**\n\nOn November 10, 2025, Syria announced its decision to join the international coalition to combat the Islamic State group following a meeting between Syrian President Ahmed al-Sharaa...",
      "detailPage": "/article.html?date=2025-11-11&seq=01"
    },
    {
      "id": 3,
      "timestamp": "2025-11-10T20:01:40.427Z",
      "headline": "Canada loses its measles-free status, with US on track to follow",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cy7e2lv4r8xo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades, take heed. The recent loss of measles elimination status by Canada, with the United States on a similar trajectory, echoes the systemic failures ingrained within an e...",
      "partigazPreview": "**Facts Summary**\n\nCanada has lost its measles elimination status due to an ongoing outbreak that has persisted for over 12 months, with over 5,000 cases reported in 2025. The United States is at risk...",
      "detailPage": "/article.html?date=2025-11-10&seq=05"
    },
    {
      "id": 3,
      "timestamp": "2025-11-10T18:00:59.484Z",
      "headline": "Watch: Lava soars 1,100ft above Hawaii's Kilauea in latest eruption",
      "source": "BBC",
      "url": "https://www.bbc.com/news/videos/cp8ep487257o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "[SAFETY CHECK FAILED - VIOLENT LANGUAGE DETECTED]\n\n**Rebel Transmission**\n\nComrades in the struggle, today we turn our eyes to an event of nature that mirrors our own fierce resistance against tyranny...",
      "partigazPreview": "**Facts Summary**\n\nOn November 9, 2024, Hawaii's Kilauea volcano erupted, sending a lava fountain soaring between 1,000 and 1,100 feet into the air. The eruption lasted for five hours and marked the 3...",
      "detailPage": "/article.html?date=2025-11-10&seq=04"
    },
    {
      "id": 14,
      "timestamp": "2025-11-10T16:01:53.262Z",
      "headline": "Supreme Court declines to revisit gay marriage decision",
      "source": "NPR",
      "url": "https://www.npr.org/2025/11/10/nx-s1-5604293/scotus-rejects-gay-marriage-appeal",
      "nemikPreview": "**Rebel Transmission**\n\nComrades across the galaxy, I send this signal to remind you of the importance of our struggle against authoritarian forces that seek to subvert freedom and justice. The recent...",
      "partigazPreview": "**Facts Summary**\n\nOn November 10, 2025, the U.S. Supreme Court declined to hear a case challenging its 2015 decision to legalize gay marriage nationwide. The challenge was brought by Kim Davis, a for...",
      "detailPage": "/article.html?date=2025-11-10&seq=03"
    },
    {
      "id": 5,
      "timestamp": "2025-11-10T14:01:19.371Z",
      "headline": "COP30: Trump and many leaders are skipping it, so does the summit still have a point?",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c205jvyg3wjo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nFellow comrades,\n\nThe echoes of history repeat, as the oppressive force, much akin to our adversaries, extends its reach to suppress the voices unified for the salvation of our...",
      "partigazPreview": "**Facts Summary**\n\nThe COP30 summit in Brazil witnessed a significant absence of world leaders, including US President Donald Trump, raising questions about the relevance of such climate talks. Trump...",
      "detailPage": "/article.html?date=2025-11-10&seq=02"
    },
    {
      "id": 8,
      "timestamp": "2025-11-10T10:01:30.292Z",
      "headline": "Trump administration tells states to stop paying full food aid benefits",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cly9pggxydeo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "[SAFETY CHECK FAILED - VIOLENT LANGUAGE DETECTED]\n\n**Rebel Transmission**\n\nFellow comrades,\n\nIn the shadow of an authoritarian grip, the latest edict from the ruling administration echoes the indiffer...",
      "partigazPreview": "**Facts Summary**\n\nOn November 9, 2025, the Trump administration, through the US Department of Agriculture (USDA), instructed states to cease paying full Supplemental Nutrition Assistance Program (Sna...",
      "detailPage": "/article.html?date=2025-11-10&seq=01"
    },
    {
      "id": 2,
      "timestamp": "2025-11-10T00:00:56.942Z",
      "headline": "Two Major League Baseball pitchers charged in sports gambling scheme",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cq50pjzg0pyo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nThe article illustrates yet another instance of the pervasive corruption that festers within our institutions, sanctioned by those in power, reminiscent of the Empire's reign....",
      "partigazPreview": "**Facts Summary**\n\nTwo Major League Baseball pitchers, Emmanuel Clase de la Cruz and Luis Leandro Ortiz Ribera, from the Cleveland Guardians, have been charged with involvement in a sports betting and...",
      "detailPage": "/article.html?date=2025-11-09&seq=04"
    },
    {
      "id": 10,
      "timestamp": "2025-11-09T22:01:07.862Z",
      "headline": "Serbia clears the way for controversial Trump-linked property plan",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c1e3q6g5n00o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nTo all who stand against imperial overreach and the corporatization of sovereignty,\n\nRecent transmissions have confirmed the passage of legislation in Serbia authorizing a cont...",
      "partigazPreview": "**Facts Summary**\n\nOn November 8, 2025, Serbia's parliament passed a law enabling a property development project in Belgrade led by Jared Kushner, son-in-law of Donald Trump. The project involves a 99...",
      "detailPage": "/article.html?date=2025-11-09&seq=03"
    },
    {
      "id": 9,
      "timestamp": "2025-11-09T20:01:14.284Z",
      "headline": "4 dead, 13 injured after street racer slams into crowd at Tampa bar ",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/clyl6jwx2v8o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nTo all fighters against the oppressive force we liken to the Empire, a grim incident has unfolded on the streets of Tampa, Florida—a stark reminder of the chaos that thrives un...",
      "partigazPreview": "**Facts Summary**\n\nA street racing incident in Tampa, Florida, resulted in a tragic crash at Bradley's bar, a popular LGBTQ venue. The driver, a 22-year-old male, lost control of his vehicle during a...",
      "detailPage": "/article.html?date=2025-11-09&seq=02"
    },
    {
      "id": 18,
      "timestamp": "2025-11-09T18:01:46.333Z",
      "headline": "Nearly a million people evacuate as Super Typhoon Fung-wong threatens the Philippines",
      "source": "NPR",
      "url": "https://www.npr.org/2025/11/09/g-s1-97091/nearly-a-million-people-evacuate-as-super-typhoon-fung-wong-threatens-the-philippines",
      "nemikPreview": "**Rebel Transmission**\n\nIn the face of imposing natural threats, we are reminded of the relentless power that nature holds, a force that demands mobilization and mutual aid for survival. As nearly a m...",
      "partigazPreview": "**Facts Summary**\n\nOn November 9, 2025, Super Typhoon Fung-wong threatened the Philippines, prompting the evacuation of nearly a million people. The typhoon, with maximum sustained winds of 185 kph an...",
      "detailPage": "/article.html?date=2025-11-09&seq=01"
    },
    {
      "id": 3,
      "timestamp": "2025-11-08T20:00:52.094Z",
      "headline": "Watch: 'Devastating' - Airline travellers react to flight reductions",
      "source": "BBC",
      "url": "https://www.bbc.com/news/videos/cy8v1924669o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nThe latest report highlights the insidious grip of this administration on the everyday lives of its citizens, reminiscent of a regime that values power over people. The governm...",
      "partigazPreview": "**Facts Summary**\n\nOn October 20, 2023, more than 2,000 flights in the United States were cancelled or delayed due to traffic cuts during a government shutdown. This affected domestic flights at 40 of...",
      "detailPage": "/article.html?date=2025-11-08&seq=05"
    },
    {
      "id": 22,
      "timestamp": "2025-11-08T18:00:49.794Z",
      "headline": "4 dead, 11 injured after a car chased by police plows into a crowd outside Tampa bar",
      "source": "NPR",
      "url": "https://www.npr.org/2025/11/08/nx-s1-5602823/tampa-speeding-car-chase-deaths-bar-ybor-city",
      "nemikPreview": "**Rebel Transmission**\n\nThe incident detailed in the recent article from what can be likened to an oppressed urban outpost reveals a distressing pattern of control and disregard for life under a regim...",
      "partigazPreview": "**Facts Summary**\n\nA police pursuit in Tampa's Ybor City neighborhood resulted in a tragic crash, leaving four people dead and 11 injured. The incident began when two cars were observed racing, leadin...",
      "detailPage": "/article.html?date=2025-11-08&seq=04"
    },
    {
      "id": 1,
      "timestamp": "2025-11-08T14:01:19.568Z",
      "headline": "UPS and FedEx ground some cargo planes after Kentucky air disaster",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cx2pr5y7p90o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nIn the heart of the sprawling empire that is the Trump administration, where power and profit overshadow the lives of ordinary people, a tragedy unfolds in Kentucky....",
      "partigazPreview": "**Facts Summary**\n\nOn November 7, 2025, a UPS cargo plane crashed shortly after take-off at Louisville International Airport in Kentucky, resulting in 14 fatalities. The crash caused a significant fir...",
      "detailPage": "/article.html?date=2025-11-08&seq=03"
    },
    {
      "id": 4,
      "timestamp": "2025-11-08T12:00:45.161Z",
      "headline": "DNA pioneer James Watson dies at 97",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cn8xdypnz32o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe passing of James Watson, a figure of scientific acclaim yet marred by his own divisive beliefs, presents a juxtaposition sharply relevant to our struggle against...",
      "partigazPreview": "**Facts Summary**\n\nJames Watson, the co-discoverer of the DNA double-helix structure, died at 97 on November 7, 2025. He shared the 1962 Nobel Prize with Francis Crick and Maurice Wilkins. Watson's ca...",
      "detailPage": "/article.html?date=2025-11-08&seq=02"
    },
    {
      "id": 3,
      "timestamp": "2025-11-08T10:00:50.585Z",
      "headline": "Trump gives Hungary one-year exemption from Russian energy sanctions",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cp85dvnkpv4o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe latest signal from the dystopian realm echoes the oppressive maneuverings of our adversary. The empire's marionette, guised as leadership, once more shows its ha...",
      "partigazPreview": "**Facts Summary**\n\nDonald Trump has granted Hungary a one-year exemption from sanctions related to its continued purchase of Russian oil and gas. This decision was confirmed during Hungarian Prime Min...",
      "detailPage": "/article.html?date=2025-11-08&seq=01"
    },
    {
      "id": 4,
      "timestamp": "2025-11-08T00:01:16.773Z",
      "headline": "USDA will fund Snap food benefits, feeding millions of Americans",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c0rpxqd0141o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nThe message is clear: under the weight of despotism, even essential sustenance becomes a battlefield. Today, while many perceive a victory in ensuring food for 42 million citiz...",
      "partigazPreview": "**Facts Summary**\n\nThe US Department of Agriculture (USDA) announced it will fund food benefits for over 42 million Americans through the Supplemental Nutrition Assistance Program (Snap) amidst a gove...",
      "detailPage": "/article.html?date=2025-11-07&seq=04"
    },
    {
      "id": 12,
      "timestamp": "2025-11-07T20:01:18.861Z",
      "headline": "Nancy Pelosi announces retirement after decades in US Congress",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/ce3xw3dw0zxo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe news of Nancy Pelosi's impending retirement from the congressional arena marks the close of a significant chapter in our ongoing struggle. Having navigated the l...",
      "partigazPreview": "**Facts Summary**\n\nNancy Pelosi, aged 85, announced her retirement from the U.S. Congress, effective at the end of her term in January 2027. Pelosi, who was first elected in 1987, served as Speaker of...",
      "detailPage": "/article.html?date=2025-11-07&seq=03"
    },
    {
      "id": 2,
      "timestamp": "2025-11-07T12:01:15.076Z",
      "headline": "Multiple people fall ill after package delivered to Air Force One base",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/ce8z2lg43g5o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nObserve carefully the unfolding events reported from the heart of the empire's operations. A recent incident at their primary aviation base, home to the tyrant's per...",
      "partigazPreview": "**Facts Summary**\n\nOn November 7, 2025, multiple individuals at Joint Base Andrews in Maryland fell ill after opening a suspicious package containing an unidentified white powder. The base, which serv...",
      "detailPage": "/article.html?date=2025-11-07&seq=02"
    },
    {
      "id": 1,
      "timestamp": "2025-11-07T10:01:12.509Z",
      "headline": "Elon Musk's $1tn pay deal approved by Tesla shareholders",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cwyk6kvyxvzo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nGreetings Fellow Seekers of Justice,\n\nI transmit this message from the fringes, compelled by the recent developments within the corporate titan known as Tesla. The parallels to...",
      "partigazPreview": "**Facts Summary**\n\nTesla shareholders approved a record-breaking pay package for Elon Musk, potentially worth nearly $1 trillion, with 75% of votes in favor. The deal requires Musk to significantly in...",
      "detailPage": "/article.html?date=2025-11-07&seq=01"
    },
    {
      "id": 3,
      "timestamp": "2025-11-06T22:01:53.576Z",
      "headline": "Trump unveils deals to lower US weight-loss drug prices",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/czxk7k9nd11o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades, the veneer of generosity unveiled by the Trump administration serves as yet another calculated maneuver to consolidate power under the guise of public welfare. The re...",
      "partigazPreview": "**Facts Summary**\n\nOn November 6, 2025, U.S. President Donald Trump announced agreements with pharmaceutical companies Eli Lilly and Novo Nordisk to lower the cost of popular weight-loss drugs. The de...",
      "detailPage": "/article.html?date=2025-11-06&seq=04"
    },
    {
      "id": 4,
      "timestamp": "2025-11-06T20:01:42.340Z",
      "headline": "US teacher shot by six-year-old student awarded $10m by jury",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cy5q7ygx14zo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades, the shadows of tyranny grow ever longer, as the oppressive regime continues to exert its control over societal structures, mirroring injustices reminiscent of those w...",
      "partigazPreview": "**Facts Summary**\n\nA former Virginia schoolteacher, Abigail Zwerner, was awarded $10 million in damages by a jury after being shot by a six-year-old student at Richneck Elementary School in Newport Ne...",
      "detailPage": "/article.html?date=2025-11-06&seq=03"
    },
    {
      "id": 3,
      "timestamp": "2025-11-06T14:01:10.682Z",
      "headline": "From gas to groceries, has Trump kept his promise to tackle rising prices?",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/ckgkl25734go?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades in resistance,\n\nAs I sift through the latest intelligence, it is clear that the state of affairs under our current regime mirrors the oppressive hand of an empire. Our...",
      "partigazPreview": "**Facts Summary**\n\nPresident Donald Trump, re-elected on a promise to tackle inflation, has faced rising prices in groceries, electricity, and cars. Grocery prices increased by 2.7% over the past year...",
      "detailPage": "/article.html?date=2025-11-06&seq=02"
    },
    {
      "id": 16,
      "timestamp": "2025-11-06T12:01:15.539Z",
      "headline": "Mamdani seals remarkable victory - but real challenges await",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cly4kr8gzr2o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe ascension of Zohran Mamdani to the mayorship in New York City, a bastion once dominated by establishment figures, marks a significant achievement for those who o...",
      "partigazPreview": "**Facts Summary**\n\nZohran Mamdani was elected as the new mayor of New York City on November 5, 2025, securing 50% of the vote. He defeated former Governor Andrew Cuomo, who received 42%, and Republica...",
      "detailPage": "/article.html?date=2025-11-06&seq=01"
    },
    {
      "id": 27,
      "timestamp": "2025-11-05T16:02:12.700Z",
      "headline": "Yes, Trump's tariffs are raising billions -- but at a steep economic cost",
      "source": "NPR",
      "url": "https://www.npr.org/2025/11/05/nx-s1-5596488/tariffs-trump-economy-inflation",
      "nemikPreview": "**Rebel Transmission**\n\nComrades, the regime we oppose has yet again shown its heavy-handedness through economic means. Recent intelligence, disguised as a public broadcast from a system called NPR, r...",
      "partigazPreview": "**Facts Summary**\n\nPresident Trump's tariffs have significantly increased federal revenue, raising tens of billions of dollars. However, these tariffs have also led to higher consumer costs, business...",
      "detailPage": "/article.html?date=2025-11-05&seq=03"
    },
    {
      "id": 5,
      "timestamp": "2025-11-05T12:01:32.452Z",
      "headline": "Democrat Abigail Spanberger becomes Virginia's first female governor",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cj41l1qpv7ko?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades, today we witness a notable triumph in the struggle against authoritarianism within yet another sphere of influence. The election of Abigail Spanberger as Virginia's f...",
      "partigazPreview": "**Facts Summary**\n\nDemocrat Abigail Spanberger has won the Virginia governor's race, defeating Republican Lieutenant Governor Winsome Earle-Sears. Spanberger, a former congresswoman and CIA officer, b...",
      "detailPage": "/article.html?date=2025-11-05&seq=02"
    },
    {
      "id": 7,
      "timestamp": "2025-11-05T10:01:14.230Z",
      "headline": "At least seven people killed after UPS cargo plane crashes in Kentucky",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/ce9dyyydjr0o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe tragic incident in Louisville reminds us of the fragility of life under the control of a regime that prioritizes commerce and profit above all else. A UPS cargo...",
      "partigazPreview": "**Facts Summary**\n\nOn November 5, 2025, a UPS cargo plane crashed while taking off from Louisville Muhammad Ali International Airport in Kentucky, resulting in at least seven fatalities and 11 injurie...",
      "detailPage": "/article.html?date=2025-11-05&seq=01"
    },
    {
      "id": 1,
      "timestamp": "2025-11-05T00:01:04.270Z",
      "headline": "Polls open in US elections - here are five things to watch",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c0qp5yjd253o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades, as we observe the unfolding political landscape in this vast empire, let us examine the events transpiring in one of its core territories — the United States. Today's...",
      "partigazPreview": "** Facts Summary **  \nOn November 4, 2025, voters across the United States are participating in elections, including the New York City mayoral race and gubernatorial races in Virginia and New Jersey....",
      "detailPage": "/article.html?date=2025-11-04&seq=06"
    },
    {
      "id": 16,
      "timestamp": "2025-11-04T22:01:30.311Z",
      "headline": "Why the US government has shut down and what happens now",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/crrj1znp0pyo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nFellow citizens,\n\nAs we observe the current machinations of power in the heart of the American political system, let us look upon the ongoing government shutdown with a critica...",
      "partigazPreview": "**Facts Summary**\n\nThe US government has shut down due to a budget standoff between Republican and Democratic lawmakers. The shutdown began on October 1, 2025, after the two parties failed to agree on...",
      "detailPage": "/article.html?date=2025-11-04&seq=05"
    },
    {
      "id": 15,
      "timestamp": "2025-11-04T20:01:25.961Z",
      "headline": "Worsening listeria outbreak tied to pasta products kills 6, hospitalizes 25",
      "source": "NPR",
      "url": "https://www.npr.org/2025/11/04/nx-s1-5598279/listeria-outbreak-prepared-pasta",
      "nemikPreview": "**Rebel Transmission**\n\nCitizens across our vast domain must remain vigilant. The latest information indicates a lethal outbreak of listeria, a microbial threat hidden within what many consider mundan...",
      "partigazPreview": "**Facts Summary**\n\nA listeria outbreak linked to prepared pasta products has resulted in six deaths and 27 hospitalizations across 18 states in the United States. The outbreak, which began in June 202...",
      "detailPage": "/article.html?date=2025-11-04&seq=04"
    },
    {
      "id": 6,
      "timestamp": "2025-11-04T16:01:44.869Z",
      "headline": "Trump backs Cuomo for New York City mayor and threatens to cut funding if Mamdani wins",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c231e284345o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades in our struggle against tyranny, I bring urgent news from the heart of a city under siege by authoritarian influence. Today, we witness a vivid demonstration of imperi...",
      "partigazPreview": "**Facts Summary**\n\nDonald Trump has endorsed Andrew Cuomo for the New York City mayoral race, threatening to reduce federal funding if Zohran Mamdani wins. Trump labeled Mamdani a communist, a claim M...",
      "detailPage": "/article.html?date=2025-11-04&seq=03"
    },
    {
      "id": 6,
      "timestamp": "2025-11-04T14:01:21.078Z",
      "headline": "Trump administration will tap emergency fund to pay partial food stamp benefits",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cglg632n719o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nIn the vast expanse of our struggle against oppressive forces, observe how the empire's hand tightens around the throats of the vulnerable. The latest reports indicate that the...",
      "partigazPreview": "**Facts Summary**\n\nThe Trump administration announced it will provide reduced food aid to over 42 million Americans due to the ongoing government shutdown. The USDA will use $5.25 billion in emergency...",
      "detailPage": "/article.html?date=2025-11-04&seq=02"
    },
    {
      "id": 14,
      "timestamp": "2025-11-04T12:01:23.127Z",
      "headline": "Trump tariffs head to Supreme Court in case eagerly awaited around the world",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cn4jyk9jyv3o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe Empire's machinations reach a pivotal point as its leader stands at the gates of the Supreme Tribunal. Under the guise of \"national security,\" the regime seeks t...",
      "partigazPreview": "**Facts Summary**\n\nThe Trump administration is defending its tariffs at the US Supreme Court against claims of illegality. The tariffs, imposed under the 1977 International Emergency Economic Powers A...",
      "detailPage": "/article.html?date=2025-11-04&seq=01"
    },
    {
      "id": 2,
      "timestamp": "2025-11-04T00:01:26.033Z",
      "headline": "Trump's planned tests are 'not nuclear explosions', US energy secretary says",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cpd26yxxx3lo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe latest developments from the domain of the oppressor reflect a concerning escalation in their agenda of dominance. The recent reports from the imperialist strong...",
      "partigazPreview": "**Facts Summary**\n\nPresident Donald Trump has directed the US military to resume nuclear weapons testing, but Energy Secretary Chris Wright clarified that these tests will not involve nuclear explosio...",
      "detailPage": "/article.html?date=2025-11-03&seq=06"
    },
    {
      "id": 5,
      "timestamp": "2025-11-03T20:01:25.364Z",
      "headline": "Two Michigan men charged with Halloween Islamic State-inspired terror plot",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c5y9qrg4d7ro?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "[SAFETY CHECK FAILED - VIOLENT LANGUAGE DETECTED]\n\n**Rebel Transmission**\n\nFellow seekers of truth and freedom,\n\nThe article in question, sourced from a state-controlled outlet, exemplifies the system...",
      "partigazPreview": "**Facts Summary**\n\nTwo men, Mohmed Ali and Majed Mahmoud, have been charged with plotting a terrorist attack inspired by the Islamic State over Halloween weekend in Michigan. They scouted locations in...",
      "detailPage": "/article.html?date=2025-11-03&seq=05"
    },
    {
      "id": 4,
      "timestamp": "2025-11-03T18:01:21.322Z",
      "headline": "Trump says he doubts US will go to war with Venezuela ",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c709rwxzx9yo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades in the struggle for freedom,\n\nThe latest report from our intelligence sources paints a grim picture of the lengths to which the oppressive regime will go to consolidat...",
      "partigazPreview": "**Facts Summary**\n\nDonald Trump expressed doubt about the US going to war with Venezuela, despite a significant military buildup in the Caribbean Sea. The US has been conducting strikes on alleged dru...",
      "detailPage": "/article.html?date=2025-11-03&seq=04"
    },
    {
      "id": 7,
      "timestamp": "2025-11-03T16:01:43.961Z",
      "headline": "'No idea who he is,' says Trump after pardoning crypto tycoon",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cn7ek63e5xyo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe latest dispatch from the empire's heartland speaks volumes of its continued decay and moral erosion. A recent report highlights that the emperor himself has pard...",
      "partigazPreview": "**Facts Summary**\n\nOn November 3, 2025, US President Donald Trump pardoned Changpeng Zhao, a cryptocurrency billionaire and co-founder of Binance, who had pleaded guilty to enabling money laundering....",
      "detailPage": "/article.html?date=2025-11-03&seq=03"
    },
    {
      "id": 5,
      "timestamp": "2025-11-03T14:01:28.411Z",
      "headline": "Three killed in latest US strike on alleged drug boat in Caribbean",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cn401vzjx48o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nFellow allies, today we must analyze the latest extension of imperial overreach manifesting in the Caribbean under the guise of anti-narcotic operations by the administration i...",
      "partigazPreview": "**Facts Summary**\n\nOn November 2, 2025, a US strike on an alleged drug-smuggling boat in the Caribbean resulted in the deaths of three men. This action is part of a series of strikes initiated by the...",
      "detailPage": "/article.html?date=2025-11-03&seq=02"
    },
    {
      "id": 7,
      "timestamp": "2025-11-03T12:01:03.222Z",
      "headline": "Trump tariffs head to Supreme Court in case eagerly awaited around the world",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cn4jyk9jyv3o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nIn the shadow of a colossal edifice, a battle looms not on fields of open combat, but within the hallowed chambers of justice. The Trump administration, wielding tariffs as a w...",
      "partigazPreview": "**Facts Summary**\n\nThe Trump administration is facing a legal challenge in the US Supreme Court regarding the legality of tariffs imposed under the 1977 International Emergency Economic Powers Act (IE...",
      "detailPage": "/article.html?date=2025-11-03&seq=01"
    },
    {
      "id": 11,
      "timestamp": "2025-11-02T20:00:48.997Z",
      "headline": "How this week's elections in Virginia became about ... everything",
      "source": "NPR",
      "url": "https://www.npr.org/2025/11/02/nx-s1-5589774/virginia-races-trump-redistricting-spanberger-earle-sears",
      "nemikPreview": "**Rebel Transmission**\n\nThe recent developments in the Virginia elections serve as a microcosm of the broader struggle against the oppressive forces of autocracy, analogous to the Empire's pervasive c...",
      "partigazPreview": "**Facts Summary**\n\nThe Virginia gubernatorial race between Abigail Spanberger and Winsome Earle-Sears has been influenced by several factors, including a government shutdown affecting 320,000 federal...",
      "detailPage": "/article.html?date=2025-11-02&seq=06"
    },
    {
      "id": 11,
      "timestamp": "2025-11-02T18:01:20.892Z",
      "headline": "Fire and explosion at northwestern Mexico store leave at least 23 dead and 12 injured",
      "source": "NPR",
      "url": "https://www.npr.org/2025/11/02/nx-s1-5594848/fire-and-explosion-at-northwestern-mexico-store-leave-at-least-23-dead-and-12-injured",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe NPR article detailing the tragic fire and explosion at a convenience store in northwestern Mexico paints a harrowing picture of loss and suffering. As we mourn t...",
      "partigazPreview": "**Facts Summary**\n\nOn November 1, 2025, a fire and explosion occurred at a convenience store in Hermosillo, Sonora, Mexico, resulting in the deaths of at least 23 people, including children, and injur...",
      "detailPage": "/article.html?date=2025-11-02&seq=05"
    },
    {
      "id": 2,
      "timestamp": "2025-11-02T16:01:01.377Z",
      "headline": "Dodgers seal back-to-back World Series titles",
      "source": "BBC",
      "url": "https://www.bbc.com/sport/baseball/articles/c4gwwvzxer2o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nFellow compatriots seeking autonomy from oppression, we stand witness to another event masked as entertainment, yet embedded with the deeper implications of a regime's influenc...",
      "partigazPreview": "**Facts Summary**\n\nThe Los Angeles Dodgers won the MLB World Series by defeating the Toronto Blue Jays 5-4 in the seventh game, securing back-to-back titles for the first time in 25 years. The final g...",
      "detailPage": "/article.html?date=2025-11-02&seq=04"
    },
    {
      "id": 12,
      "timestamp": "2025-11-02T14:00:48.341Z",
      "headline": "The time change is a chance to reset your sleep schedule – especially for teens",
      "source": "NPR",
      "url": "https://www.npr.org/2025/11/02/nx-s1-5593446/time-change-teens-sleep-schedule-standard",
      "nemikPreview": "**Rebel Transmission**\n\nFellow seekers of freedom, as we continue our struggle against the tyrannical forces of the regime, it is vital to recognize the behavioral manipulations employed by those in p...",
      "partigazPreview": "**Facts Summary**\n\nThe article discusses the transition from daylight saving to standard time, highlighting its potential benefits for teenagers' sleep schedules. It notes that three out of four high...",
      "detailPage": "/article.html?date=2025-11-02&seq=03"
    },
    {
      "id": 1,
      "timestamp": "2025-11-02T12:00:53.199Z",
      "headline": "New Yorkers could pick a political newcomer to run their city - and take on Trump",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c3rjjdvx5r5o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades, fellow seekers of justice,\n\nIn the heart of an Empire-dominated landscape, a beacon of hope emerges from the shadows. Zohran Mamdani, a name that resonates with the s...",
      "partigazPreview": "**Facts Summary**\n\nZohran Mamdani, a 34-year-old Democratic frontrunner, is poised to become New York City's youngest and first Muslim mayor. His campaign focuses on affordability and quality of life,...",
      "detailPage": "/article.html?date=2025-11-02&seq=02"
    },
    {
      "id": 8,
      "timestamp": "2025-11-02T10:01:24.159Z",
      "headline": "Trump administration must continue food aid during shutdown, US judges say",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cr433x9zqq4o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nObserve the machinations of oppressive regimes, even within the sanctums they deem untouchable. The recent decree from federal judges demanding the Trump administrat...",
      "partigazPreview": "**Facts Summary**\n\nTwo federal judges have ruled that the Trump administration must continue providing Supplemental Nutrition Assistance Program (Snap) benefits to approximately 42 million low-income...",
      "detailPage": "/article.html?date=2025-11-02&seq=01"
    },
    {
      "id": 18,
      "timestamp": "2025-11-02T00:55:05.906Z",
      "headline": "Trump threatens military action in Nigeria over Christian persecution claims",
      "source": "NPR",
      "url": "https://www.npr.org/2025/11/01/g-s1-96215/trump-nigeria-christian-persecution-claims",
      "nemikPreview": "**Rebel Transmission**\n\nGreetings Comrades,\n\nOur movement's vigilance continues as we scrutinize the latest maneuvers of the despotic power structure. Today's communiqué centers on a distressing decla...",
      "partigazPreview": "**Facts Summary**\n\nOn November 1, 2025, U.S. President Donald Trump threatened Nigeria with potential military action, citing alleged persecution of Christians in the country. Trump ordered the Pentag...",
      "detailPage": "/article.html?date=2025-11-01&seq=01"
    },
    {
      "id": 10,
      "timestamp": "2025-10-31T19:01:32.474Z",
      "headline": "Trump caps refugee admissions at record low - with most to be white South Africans",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cy40jj71243o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe latest moves by the Trump administration unveil yet another layer of oppressive policies reminiscent of a regime tightening its grip on those most vulnerable. Th...",
      "partigazPreview": "**Facts Summary**\n\nThe Trump administration has set a new refugee admissions cap at 7,500 for the upcoming year, prioritizing white South Africans. This is a significant reduction from the previous ca...",
      "detailPage": "/article.html?date=2025-10-31&seq=04"
    },
    {
      "id": 4,
      "timestamp": "2025-10-31T15:01:42.050Z",
      "headline": "Halloween 2025: The best celebrity costumes so far",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c4gpwn5v072o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nIn the ever-watchful eye of our present regime, moments of seemingly trivial celebration and distraction may appear benign, yet they serve as critical indicators of our cultura...",
      "partigazPreview": "**Facts Summary**\n\nOn October 31, 2025, celebrities including Demi Lovato, Janelle Monae, Jade, North West, Megan Thee Stallion, and others revealed their Halloween costumes in New York City. The cost...",
      "detailPage": "/article.html?date=2025-10-31&seq=03"
    },
    {
      "id": 1,
      "timestamp": "2025-10-31T11:01:17.834Z",
      "headline": "Trump caps refugee admissions at record low - with most to be white South Africans",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cy40jj71243o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nThis report details an alarming development from the regime we resist. A recent decree has set the refugee admissions cap at a historic low of 7,500, with a pointed preference...",
      "partigazPreview": "**Facts Summary**\n\nThe Trump administration has set a new refugee admissions cap for the United States at 7,500 for the upcoming year, prioritizing white South Africans, specifically Afrikaners. This...",
      "detailPage": "/article.html?date=2025-10-31&seq=02"
    },
    {
      "id": 23,
      "timestamp": "2025-10-31T09:01:21.013Z",
      "headline": "King Charles III strips Prince Andrew of his titles and evicts him from the Royal Lodge",
      "source": "NPR",
      "url": "https://www.npr.org/2025/10/30/g-s1-95841/prince-andrew-stripped-titles-evicted",
      "nemikPreview": "**Rebel Transmission**\n\nIn the face of the oppressive behemoth that is the governing administration of our time, we see evident cracks in their facade through acts like those recently observed in the...",
      "partigazPreview": "**Facts Summary**\n\nOn October 30, 2025, King Charles III stripped Prince Andrew of his remaining titles and evicted him from his Royal Lodge residence. This decision was made public by Buckingham Pala...",
      "detailPage": "/article.html?date=2025-10-31&seq=01"
    },
    {
      "id": 4,
      "timestamp": "2025-10-30T19:01:17.324Z",
      "headline": "Trump hails 'amazing' meeting with China's Xi but no formal trade deal agreed ",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/crl25xl1gjpo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe chronicles from the Terran realm reveal a convergence of political titans from the dominant Empire and an emerging Eastern power. The so-called \"meeting\" between...",
      "partigazPreview": "** Facts Summary **  \nUS President Donald Trump and Chinese President Xi Jinping met in South Korea to discuss trade issues, marking their first meeting in six years. They reached a consensus on resol...",
      "detailPage": "/article.html?date=2025-10-30&seq=06"
    },
    {
      "id": 10,
      "timestamp": "2025-10-30T17:01:19.312Z",
      "headline": "Latest US boat strike kills four in the Pacific, Hegseth says ",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cp3xq9wx5zyo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nFellow citizens of the galaxy,\n\nThe recent report of violence executed under President Trump's directive in the Pacific is yet another manifestation of unchecked imperial aggre...",
      "partigazPreview": "**Facts Summary**\n\nA U.S. military strike, directed by President Trump and announced by U.S. Defense Secretary Pete Hegseth, targeted a boat suspected of drug trafficking in the eastern Pacific Ocean,...",
      "detailPage": "/article.html?date=2025-10-30&seq=05"
    },
    {
      "id": 4,
      "timestamp": "2025-10-30T15:02:16.227Z",
      "headline": "Trump directs nuclear weapons testing to resume for first time in over 30 years",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c4gzq2p0yk4o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nFellow Sentients,\n\nThe growing shadow of tyranny seeks to expand its grasp yet again. The declaration from the figurehead of the regime, that they intend to resume the testing...",
      "partigazPreview": "**Facts Summary**\n\nPresident Donald Trump has announced the resumption of nuclear weapons testing in the United States for the first time in over 30 years. This decision is aimed at keeping pace with...",
      "detailPage": "/article.html?date=2025-10-30&seq=04"
    },
    {
      "id": 5,
      "timestamp": "2025-10-30T13:01:43.189Z",
      "headline": "US will reduce its troops on Nato's eastern flank, Romania says",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c8670d9xq32o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nThe oppressive forces of the regime, under the guise of strategic realignment, are drawing back their military presence from the contested areas eastward, as reported by Romani...",
      "partigazPreview": "**Facts Summary**\n\nThe United States plans to reduce its military presence on NATO's eastern flank, specifically in Romania, as announced by Romania's defense ministry. The reduction involves rotating...",
      "detailPage": "/article.html?date=2025-10-30&seq=03"
    },
    {
      "id": 12,
      "timestamp": "2025-10-30T11:01:15.892Z",
      "headline": "Why the US government has shut down and what happens now",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/crrj1znp0pyo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nAttention all operatives,\n\nThe forces of tyranny continue to grip the hearts of the people under the guise of a governmental shutdown. Officials, locked in a power struggle, fi...",
      "partigazPreview": "**Facts Summary**\n\nThe US government shut down on October 1, 2025, due to a budget standoff between Republican and Democratic lawmakers. The shutdown has resulted in 1.4 million federal employees bein...",
      "detailPage": "/article.html?date=2025-10-30&seq=02"
    },
    {
      "id": 1,
      "timestamp": "2025-10-30T09:00:54.556Z",
      "headline": "Fed cuts US interest rates again despite 'flying blind'",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c5y0p7g7560o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nIn the shadows of power where the oppressive hand of the regime continues to exert its influence, we find yet another example of the disregard for stability and just...",
      "partigazPreview": "** Facts Summary **\n\nThe US Federal Reserve, led by Jerome Powell, reduced the target for its key lending rate by 0.25 percentage points, setting it between 3.75% and 4%. This decision was made despit...",
      "detailPage": "/article.html?date=2025-10-30&seq=01"
    },
    {
      "id": 26,
      "timestamp": "2025-10-29T23:01:16.877Z",
      "headline": "Hurricane Melissa leaves Jamaica devastated. And, the shutdown's impact on airports",
      "source": "NPR",
      "url": "https://www.npr.org/2025/10/29/g-s1-95522/up-first-newsletter-hurricane-melissa-israel-gaza-air-traffic-controllers",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe recent transmission from NPR illuminates the devastating consequences of Hurricane Melissa on Jamaica, parallel to the turmoil we face under a suppressive regime...",
      "partigazPreview": "**Facts Summary**\n\nHurricane Melissa, a Category 5 storm, made landfall in Jamaica on October 28, 2025, causing significant damage and power outages. The hurricane had maximum wind speeds of 185 miles...",
      "detailPage": "/article.html?date=2025-10-29&seq=05"
    },
    {
      "id": 8,
      "timestamp": "2025-10-29T21:01:21.121Z",
      "headline": "‘I have to get what I need right now’: Americans brace for expiry of critical food benefits",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cy40n2gxpw0o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\n[Transmission Begins]\n\nThe injustices of the Empire, here paralleled by the Trump administration, are laid bare in this latest report of a crisis affecting millions. Despite Ms...",
      "partigazPreview": "**Facts Summary**\n\nMany Americans, including Chantille Manuel, are preparing for a potential loss of essential food assistance from the Supplemental Nutrition Assistance Program (Snap) due to a govern...",
      "detailPage": "/article.html?date=2025-10-29&seq=04"
    },
    {
      "id": 4,
      "timestamp": "2025-10-29T19:01:07.239Z",
      "headline": "Nvidia hits new milestone as world's first $5tn company",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cp8e970vn5vo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nThe financial landscape today echoes the oppressive dominance we witness daily under the authority of the Empire. Nvidia's unprecedented rise to become the world's first $5 tri...",
      "partigazPreview": "**Facts Summary**\n\nNvidia has become the first company in the world to reach a market value of $5 trillion as of October 29, 2025. The company's rapid growth is driven by the demand for AI technology,...",
      "detailPage": "/article.html?date=2025-10-29&seq=03"
    },
    {
      "id": 5,
      "timestamp": "2025-10-29T12:01:06.873Z",
      "headline": "Blue Jays see off Ohtani to level World Series",
      "source": "BBC",
      "url": "https://www.bbc.com/sport/baseball/articles/cdeg3rp2712o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nIn a world relentlessly shadowed by the Empire's insistence on control and dominance, it is the seemingly mundane victories of the people that breathe life and hope into our re...",
      "partigazPreview": "**Facts Summary**\n\nThe Toronto Blue Jays defeated the Los Angeles Dodgers 6-2 in Game 4 of the MLB World Series, tying the series at 2-2. The game took place at Dodger Stadium on October 28, 2025. Vla...",
      "detailPage": "/article.html?date=2025-10-29&seq=02"
    },
    {
      "id": 8,
      "timestamp": "2025-10-28T12:37:16.000Z",
      "headline": "Amazon confirms 14,000 job losses in corporate division",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c1m3zm9jnl1o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades in resistance, observe closely the tactics of control and obfuscation used by corporations, our equivalent of the empire's machinations. Recent developments at Amazon,...",
      "partigazPreview": "**Facts Summary**\n\nAmazon has announced plans to cut approximately 14,000 jobs in its corporate division as part of a strategy to streamline operations and invest in artificial intelligence (AI). This...",
      "detailPage": "/article.html?date=2025-10-29&seq=01"
    },
    {
      "id": 82,
      "timestamp": "2025-10-28T14:55:38.000Z",
      "headline": "Amazon laying off 14,000 corporate jobs amid AI push",
      "source": "The Hill",
      "url": "https://thehill.com/policy/technology/5576395-amazon-14000-ai/",
      "nemikPreview": "**Rebel Transmission**\n\nComrades in the struggle,\n\nThe barriers erected by the administration, reminiscent of the empire's ceaseless pursuit to control and suppress, stand firm. The recent restriction...",
      "partigazPreview": "** Facts Summary **  \nAnonymous access to the domain thehill.com has been blocked until October 28, 2025, at 22:32:44 GMT due to previous abuse. The block is a result of a suspected DDoS attack involv...",
      "detailPage": "/article.html?date=2025-10-28&seq=03"
    },
    {
      "id": "2025-10-28-2001",
      "timestamp": "2025-10-28T20:01:59.000Z",
      "headline": "US kills 14 in strikes on four alleged drug boats in Pacific",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c0ex94eeljeo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades, the latest report on the imperial actions of the Trump administration reveals a disturbing trend toward unchecked militarism and the erosion of international law unde...",
      "partigazPreview": "**Facts Summary**\n\nOn October 28, 2025, US forces, under the direction of President Donald Trump, conducted strikes on four alleged drug boats in the Pacific, resulting in the deaths of 14 individuals...",
      "detailPage": "/article.html?date=2025-10-28&seq=02"
    },
    {
      "id": "2025-10-28-1909",
      "timestamp": "2025-10-28T19:09:37.000Z",
      "headline": "Trump appeals against conviction in hush-money case",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c4g3m95ykzko?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nFellow seekers of truth and justice,\n\nThe machinations of those who wield power without regard for integrity continue unabated. The recent developments surrounding the appeals...",
      "partigazPreview": "**Facts Summary**\n\nDonald Trump has filed an appeal to overturn his May 2024 criminal conviction in the hush-money payment case. He was convicted of 34 felony counts of falsifying business records by...",
      "detailPage": "/article.html?date=2025-10-28&seq=01"
    },
    {
      "id": "2025-10-27-2345",
      "timestamp": "2025-10-27T23:45:36.000Z",
      "headline": "Trump does not rule out seeking third term - but says he will not use VP loophole",
      "source": "but says he will not use VP loophole",
      "url": "https://www.bbc.com/news/articles/c797q57ple9o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe latest developments from the upper echelons of power present a grave reminder of the lengths to which tyranny will go to maintain its stranglehold on society. Th...",
      "partigazPreview": "**Facts Summary**\n\nOn October 27, 2025, Donald Trump, during a trip to Asia, did not rule out the possibility of seeking a third term as President of the United States. He dismissed the idea of runnin...",
      "detailPage": "/article.html?date=2025-10-27"
    },
    {
      "id": "2025-10-27-0844",
      "timestamp": "2025-10-27T08:44:58.000Z",
      "headline": "Trump gives 'toothless' Asian summit its moment in the sun",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c797qlx93j0o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "Remember this: Authority often seeks the sun to cast longer shadows. In Kuala Lumpur, a ceremony unfolds, a moment of light in the complex dance of regional peace and trade. Donald Trump stands at the...",
      "partigazPreview": "**Facts Summary:**\n\nOn October 27, 2025, Donald Trump presided over a signing ceremony in Kuala Lumpur, marking progress in regional peace and trade agreements. The event was attended by notable figur...",
      "detailPage": "/article.html?date=2025-10-27"
    },
    {
      "id": "2025-10-26-0807",
      "timestamp": "2025-10-26T08:07:39.000Z",
      "headline": "Harris 'concerned' she did not ask Biden to quit race",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cj412zgvy4do?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "Remember this: The machinery of control often hides behind familiar faces. Kamala Harris, in her concern, reveals the subtle tensions within systems of power. Her hesitation to ask Joe Bi...",
      "partigazPreview": "**Facts Summary:**\n\nOn October 26, 2025, Kamala Harris expressed concern regarding her decision not to request Joe Biden to withdraw from the presidential race. This statement was made public in the U...",
      "detailPage": "/article.html?date=2025-10-26"
    },
    {
      "id": "2025-10-25-1200",
      "timestamp": "2025-10-25T12:00:31.000Z",
      "headline": "Kamala Harris tells BBC she may run for president again",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cx2n7k2veywo",
      "nemikPreview": "Understand this: The machinery of control often masks itself in the guise of choice. Kamala Harris, in her dialogue with the BBC, hints at a path forward—a potential run for presidency in 2028...",
      "partigazPreview": "The announcement by Kamala Harris introduces a potential shift in the political equilibrium within the United States. Her indication of a possible presidential run in 2028 serves as a preliminary signal...",
      "detailPage": "/article.html?date=2025-10-25"
    }
  ],
  "lastUpdated": "2025-11-16T22:01:05.199Z",
  "version": "1.0"
}