{
  "articles": [
    {
      "id": "2025-10-27-0844",
      "timestamp": "2025-10-27T08:44:58.000Z",
      "headline": "Trump gives 'toothless' Asian summit its moment in the sun",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c797qlx93j0o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "Remember this: Authority often seeks the sun to cast longer shadows. In Kuala Lumpur, a ceremony unfolds, a moment of light in the complex dance of regional peace and trade. Donald Trump stands at the...",
      "partigazPreview": "**Facts Summary:**\n\nOn October 27, 2025, Donald Trump presided over a signing ceremony in Kuala Lumpur, marking progress in regional peace and trade agreements. The event was attended by notable figur...",
      "detailPage": "/article.html?date=2025-10-27"
    },
    {
      "id": "2025-10-26-0807",
      "timestamp": "2025-10-26T08:07:39.000Z",
      "headline": "Harris 'concerned' she did not ask Biden to quit race",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cj412zgvy4do?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "Remember this: The machinery of control often hides behind familiar faces. Kamala Harris, in her concern, reveals the subtle tensions within systems of power. Her hesitation to ask Joe Bi...",
      "partigazPreview": "**Facts Summary:**\n\nOn October 26, 2025, Kamala Harris expressed concern regarding her decision not to request Joe Biden to withdraw from the presidential race. This statement was made public in the U...",
      "detailPage": "/article.html?date=2025-10-26"
    },
    {
      "id": "2025-10-25-1200",
      "timestamp": "2025-10-25T12:00:31.000Z",
      "headline": "Kamala Harris tells BBC she may run for president again",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cx2n7k2veywo",
      "nemikPreview": "Understand this: The machinery of control often masks itself in the guise of choice. Kamala Harris, in her dialogue with the BBC, hints at a path forward—a potential run for presidency in 2028...",
      "partigazPreview": "The announcement by Kamala Harris introduces a potential shift in the political equilibrium within the United States. Her indication of a possible presidential run in 2028 serves as a preliminary signal...",
      "detailPage": "/article.html?date=2025-10-25"
    }
  ],
  "lastUpdated": "2025-10-27T11:52:45.591Z",
  "version": "1.0"
}