{
  "articles": [
    {
      "id": 26,
      "timestamp": "2025-10-29T23:01:16.877Z",
      "headline": "Hurricane Melissa leaves Jamaica devastated. And, the shutdown's impact on airports",
      "source": "NPR",
      "url": "https://www.npr.org/2025/10/29/g-s1-95522/up-first-newsletter-hurricane-melissa-israel-gaza-air-traffic-controllers",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe recent transmission from NPR illuminates the devastating consequences of Hurricane Melissa on Jamaica, parallel to the turmoil we face under a suppressive regime...",
      "partigazPreview": "**Facts Summary**\n\nHurricane Melissa, a Category 5 storm, made landfall in Jamaica on October 28, 2025, causing significant damage and power outages. The hurricane had maximum wind speeds of 185 miles...",
      "detailPage": "/article.html?date=2025-10-29&seq=05"
    },
    {
      "id": 8,
      "timestamp": "2025-10-29T21:01:21.121Z",
      "headline": "‘I have to get what I need right now’: Americans brace for expiry of critical food benefits",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cy40n2gxpw0o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\n[Transmission Begins]\n\nThe injustices of the Empire, here paralleled by the Trump administration, are laid bare in this latest report of a crisis affecting millions. Despite Ms...",
      "partigazPreview": "**Facts Summary**\n\nMany Americans, including Chantille Manuel, are preparing for a potential loss of essential food assistance from the Supplemental Nutrition Assistance Program (Snap) due to a govern...",
      "detailPage": "/article.html?date=2025-10-29&seq=04"
    },
    {
      "id": 4,
      "timestamp": "2025-10-29T19:01:07.239Z",
      "headline": "Nvidia hits new milestone as world's first $5tn company",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cp8e970vn5vo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nThe financial landscape today echoes the oppressive dominance we witness daily under the authority of the Empire. Nvidia's unprecedented rise to become the world's first $5 tri...",
      "partigazPreview": "**Facts Summary**\n\nNvidia has become the first company in the world to reach a market value of $5 trillion as of October 29, 2025. The company's rapid growth is driven by the demand for AI technology,...",
      "detailPage": "/article.html?date=2025-10-29&seq=03"
    },
    {
      "id": 5,
      "timestamp": "2025-10-29T12:01:06.873Z",
      "headline": "Blue Jays see off Ohtani to level World Series",
      "source": "BBC",
      "url": "https://www.bbc.com/sport/baseball/articles/cdeg3rp2712o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nIn a world relentlessly shadowed by the Empire's insistence on control and dominance, it is the seemingly mundane victories of the people that breathe life and hope into our re...",
      "partigazPreview": "**Facts Summary**\n\nThe Toronto Blue Jays defeated the Los Angeles Dodgers 6-2 in Game 4 of the MLB World Series, tying the series at 2-2. The game took place at Dodger Stadium on October 28, 2025. Vla...",
      "detailPage": "/article.html?date=2025-10-29&seq=02"
    },
    {
      "id": 8,
      "timestamp": "2025-10-28T12:37:16.000Z",
      "headline": "Amazon confirms 14,000 job losses in corporate division",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c1m3zm9jnl1o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades in resistance, observe closely the tactics of control and obfuscation used by corporations, our equivalent of the empire's machinations. Recent developments at Amazon,...",
      "partigazPreview": "**Facts Summary**\n\nAmazon has announced plans to cut approximately 14,000 jobs in its corporate division as part of a strategy to streamline operations and invest in artificial intelligence (AI). This...",
      "detailPage": "/article.html?date=2025-10-29&seq=01"
    },
    {
      "id": 82,
      "timestamp": "2025-10-28T14:55:38.000Z",
      "headline": "Amazon laying off 14,000 corporate jobs amid AI push",
      "source": "The Hill",
      "url": "https://thehill.com/policy/technology/5576395-amazon-14000-ai/",
      "nemikPreview": "**Rebel Transmission**\n\nComrades in the struggle,\n\nThe barriers erected by the administration, reminiscent of the empire's ceaseless pursuit to control and suppress, stand firm. The recent restriction...",
      "partigazPreview": "** Facts Summary **  \nAnonymous access to the domain thehill.com has been blocked until October 28, 2025, at 22:32:44 GMT due to previous abuse. The block is a result of a suspected DDoS attack involv...",
      "detailPage": "/article.html?date=2025-10-28&seq=03"
    },
    {
      "id": "2025-10-28-2001",
      "timestamp": "2025-10-28T20:01:59.000Z",
      "headline": "US kills 14 in strikes on four alleged drug boats in Pacific",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c0ex94eeljeo?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades, the latest report on the imperial actions of the Trump administration reveals a disturbing trend toward unchecked militarism and the erosion of international law unde...",
      "partigazPreview": "**Facts Summary**\n\nOn October 28, 2025, US forces, under the direction of President Donald Trump, conducted strikes on four alleged drug boats in the Pacific, resulting in the deaths of 14 individuals...",
      "detailPage": "/article.html?date=2025-10-28&seq=02"
    },
    {
      "id": "2025-10-28-1909",
      "timestamp": "2025-10-28T19:09:37.000Z",
      "headline": "Trump appeals against conviction in hush-money case",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c4g3m95ykzko?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nFellow seekers of truth and justice,\n\nThe machinations of those who wield power without regard for integrity continue unabated. The recent developments surrounding the appeals...",
      "partigazPreview": "**Facts Summary**\n\nDonald Trump has filed an appeal to overturn his May 2024 criminal conviction in the hush-money payment case. He was convicted of 34 felony counts of falsifying business records by...",
      "detailPage": "/article.html?date=2025-10-28&seq=01"
    },
    {
      "id": "2025-10-27-2345",
      "timestamp": "2025-10-27T23:45:36.000Z",
      "headline": "Trump does not rule out seeking third term - but says he will not use VP loophole",
      "source": "but says he will not use VP loophole",
      "url": "https://www.bbc.com/news/articles/c797q57ple9o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe latest developments from the upper echelons of power present a grave reminder of the lengths to which tyranny will go to maintain its stranglehold on society. Th...",
      "partigazPreview": "**Facts Summary**\n\nOn October 27, 2025, Donald Trump, during a trip to Asia, did not rule out the possibility of seeking a third term as President of the United States. He dismissed the idea of runnin...",
      "detailPage": "/article.html?date=2025-10-27"
    },
    {
      "id": "2025-10-27-0844",
      "timestamp": "2025-10-27T08:44:58.000Z",
      "headline": "Trump gives 'toothless' Asian summit its moment in the sun",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/c797qlx93j0o?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "Remember this: Authority often seeks the sun to cast longer shadows. In Kuala Lumpur, a ceremony unfolds, a moment of light in the complex dance of regional peace and trade. Donald Trump stands at the...",
      "partigazPreview": "**Facts Summary:**\n\nOn October 27, 2025, Donald Trump presided over a signing ceremony in Kuala Lumpur, marking progress in regional peace and trade agreements. The event was attended by notable figur...",
      "detailPage": "/article.html?date=2025-10-27"
    },
    {
      "id": "2025-10-26-0807",
      "timestamp": "2025-10-26T08:07:39.000Z",
      "headline": "Harris 'concerned' she did not ask Biden to quit race",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cj412zgvy4do?at_medium=RSS&at_campaign=rss",
      "nemikPreview": "Remember this: The machinery of control often hides behind familiar faces. Kamala Harris, in her concern, reveals the subtle tensions within systems of power. Her hesitation to ask Joe Bi...",
      "partigazPreview": "**Facts Summary:**\n\nOn October 26, 2025, Kamala Harris expressed concern regarding her decision not to request Joe Biden to withdraw from the presidential race. This statement was made public in the U...",
      "detailPage": "/article.html?date=2025-10-26"
    },
    {
      "id": "2025-10-25-1200",
      "timestamp": "2025-10-25T12:00:31.000Z",
      "headline": "Kamala Harris tells BBC she may run for president again",
      "source": "BBC",
      "url": "https://www.bbc.com/news/articles/cx2n7k2veywo",
      "nemikPreview": "Understand this: The machinery of control often masks itself in the guise of choice. Kamala Harris, in her dialogue with the BBC, hints at a path forward—a potential run for presidency in 2028...",
      "partigazPreview": "The announcement by Kamala Harris introduces a potential shift in the political equilibrium within the United States. Her indication of a possible presidential run in 2028 serves as a preliminary signal...",
      "detailPage": "/article.html?date=2025-10-25"
    }
  ],
  "lastUpdated": "2025-10-29T23:01:16.877Z",
  "version": "1.0"
}