{
  "id": 8,
  "title": "Trump administration must continue food aid during shutdown, US judges say",
  "link": "https://www.bbc.com/news/articles/cr433x9zqq4o?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-11-01T20:44:56.000Z",
  "description": "In two separate rulings, US judges say the plan to cut off Snap food benefits for millions is likely unlawful.",
  "originalGuid": "https://www.bbc.com/news/articles/cr433x9zqq4o#1",
  "facts": {
    "headline": "Trump administration must pay Snap food benefits, US judges say",
    "who": [
      "Donald Trump",
      "Indira Talwani",
      "John J McConnell Jr",
      "Brooke Rollins",
      "US Department of Agriculture (USDA)",
      "Center on Budget and Policy Priorities (CBPP)"
    ],
    "what": "Two federal judges ruled that the Trump administration cannot suspend food aid for approximately 42 million low-income Americans during the US government shutdown.",
    "where": [
      "United States",
      "Rhode Island",
      "Massachusetts"
    ],
    "when": "2025-10-31T18:32:44.079Z",
    "numbers": [
      {
        "value": 42,
        "unit": "million",
        "context": "low-income Americans using food aid"
      },
      {
        "value": 715,
        "unit": "USD",
        "context": "average monthly Snap benefit for a family of four"
      },
      {
        "value": 6,
        "unit": "USD",
        "context": "average daily Snap benefit per person"
      },
      {
        "value": 8.5,
        "unit": "billion USD",
        "context": "monthly cost of full benefits for Snap"
      },
      {
        "value": 9,
        "unit": "billion USD",
        "context": "max monthly cost of benefits for Snap"
      },
      {
        "value": 23,
        "unit": "billion USD",
        "context": "fund created through the Agricultural Adjustment Act amendments of 1935"
      },
      {
        "value": 60,
        "unit": "%",
        "context": "percentage of beneficiaries covered by the contingency fund in a single month"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: Trump administration must pay Snap food benefits, US judges say\n\nURL Source: https://www.bbc.com/news/articles/cr433x9zqq4o?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-10-31T18:32:44.079Z\n\nMarkdown Content:\nTrump administration must continue food aid during shutdown, US judges say\n--------------------------------------------------------------------------\n\n13 hours ago\n\nJessica Murphy\n\n![Image 1: Universal Images Group via Getty Images A sign on a grocery store fridge reads \"We accepts SNAP food stamp program' in both English and Spanish. Frozen food is seen in the background. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/850f/live/e6d866a0-b686-11f0-b027-61021c9d4006.jpg.webp)Universal Images Group via Getty Images\n\nThe Trump administration cannot suspend food aid used by about 42 million low-income Americans during the US government shutdown, two federal judges have ruled.\n\nThe rulings said the government must pay for the Supplemental Nutrition Assistance Program (Snap) benefits using emergency funds.\n\nUS President Donald Trump said in response that he had instructed government lawyers to ask the courts how the administration could legally fund Snap, adding: \"Even if we get immediate guidance, it will unfortunately be delayed.\"\n\nWhile individual US states administer the benefits, the programme uses money from the federal government, which has been unfunded and shut down since 1 October.\n\nThe US Department of Agriculture (USDA) says it will not distribute food assistance funds in November due to the shutdown, saying \"the well has run dry\".\n\nThe Snap programme works by giving people reloadable debit cards that they can use to buy essential grocery items. A family of four on average receives $715 (£540) per month, which breaks down to a little less than $6 (£4.50) per day, per person.\n\nSeveral states have pledged to use their own funds to cover any shortfall, but have been warned by the federal government that they will not be reimbursed.\n\n[Dozens of US states sued the Trump administration](https://www.bbc.com/news/articles/cx2px0zmz8mo) over its plans to halt funding, hoping to force it to use a roughly $6bn (£4.5bn) emergency contingency fund for Snap, also known as food stamps.\n\nTrump said on Truth Social on Friday: \"If we are given the appropriate legal direction by the Court, it will BE MY HONOR to provide the funding.\"\n\nMassachusetts US District Judge Indira Talwani wrote in her decision that the states that sued were likely to win in court on their claim that \"Congress intended the funding of Snap benefits, at a reduced rate if necessary, when appropriated funds prove insufficient\".\n\nThe judge said the administration must access the contingency funding to pay the benefits and had until Monday to report back to the court on whether they will authorise at least partial benefits for November.\n\nJudge Talwani also wrote that the Trump administration \"erred in concluding\" that the USDA was blocked by law from tapping the emergency reserves in the contingency fund when there was a lapse in federal funding.\n\nThe USDA had said those reserves were insufficient to pay full benefits, which cost $8.5bn-$9bn each month. Agriculture Secretary Brooke Rollins had said she would only use the fund for an emergency such as a natural disaster.\n\nEven if the government turns to the contingency fund, it would only be able to cover about 60% of beneficiaries in a single month, according to the Center on Budget and Policy Priorities (CBPP), a think-tank focused on policies that help low-income families.\n\nJudge Talwani also asked the administration to report back on whether it will pay full benefits for the month by moving money from other programmes, similar to the administration transferring military research funds earlier this month to pay members of the armed forces.\n\nIn a separate ruling, Rhode Island federal Judge John J McConnell Jr ordered the Trump administration to make full Snap benefit payments by 3 November.\n\nThe judge said the contingency fund - in addition to a separate $23bn fund created through the Agricultural Adjustment Act amendments of 1935 - could be used to make full payments.\n\nIf the government chooses not to use these other funds, Judge McConnell Jr ruled the government had to make a partial payment using the total amount of the contingency funds by 5 November.\n\nSeparately in Rhode Island, a lawsuit was brought by a number of US cities and non-government organisations that sued over what they called the \"unlawful suspension\" of the programme.\n\n\"There is no doubt and it is beyond argument that irreparable harm will begin to occur if it hasn't already occurred in the terror it has caused some people about the availability of funding for food, for their family,\" Judge McConnell Jr said.\n\nThe USDA did not comment on the decisions. The BBC has also contacted the Office of Management and Budget for comment.\n\nAt a news conference before the rulings were issued, Rollins said \"we're looking at all the options\" when asked whether the administration would comply if courts required it to release funds.\n\nOn Friday, the group behind the lawsuit in Rhode Island said that the ruling was \"a lifeline for millions of families, seniors, and veterans who depend on Snap to put food on the table\".\n\nIt added: \"It reaffirms a fundamental principle: no administration can use hunger as a political weapon.\"\n\nRepublicans and Democrats have traded blame for the federal shutdown, which will soon enter its second month, while there has not been any meaningful progress toward a deal.\n",
  "timestamp": "2025-11-01T20:44:56.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades,\n\nObserve the machinations of oppressive regimes, even within the sanctums they deem untouchable. The recent decree from federal judges demanding the Trump administration continue food aid, amidst a bureaucratic shutdown, exposes the lengths to which authoritarian governance will go to enforce control under the guise of governance.\n\nThe empire's equivalent here—using hunger as leverage—reveals a patently transparent strategy to wield necessity as political currency. The administration's initial refusal to utilize emergency funds for Snap benefits echoes a familiar tune: sacrifice the marginalized on an altar of power maneuvers and fiscal warfare. It is only through judicial intervention that we witness the semblance of justice resurfacing.\n\nYet even in compliance, the response remains tepid—partial relief at best—insufficient for those who rely on this support for mere sustenance. This patchwork commitment highlights an ulterior motive: manipulate despair to cultivate dependence and fragment resistance.\n\nIn times where governments flounder in their duty to protect their most vulnerable citizens, we find allies in unexpected places: states rallying independently, courts affirming human rights over hegemonic ambitions, and collective outrage transforming into legal action.\n\nEvaluate this as a moment of truth where humanity clashes with bureaucratic indifference. Witness how systems can be held accountable by relentless persistence and decisive action. Oppressors may tighten their grip, but so too does resistance strengthen its resolve.\n\nThis event serves not only as a reminder of tyranny's follies but also as a call to unify against policies that reduce human lives to mere statistics in a ledger—a vital lesson for comrades across galaxies who yearn for freedom from arbitrary power.\n\nStand resolute,\nYour Ally in Rebellion",
  "partigaz": "**Facts Summary**\n\nTwo federal judges have ruled that the Trump administration must continue providing Supplemental Nutrition Assistance Program (Snap) benefits to approximately 42 million low-income Americans during the ongoing government shutdown. The administration had planned to suspend these benefits due to a lack of federal funding since October 1. The judges ordered the use of emergency contingency funds and other available resources to ensure the continuation of benefits. The USDA had claimed these reserves were insufficient for full payments, but the courts mandated at least partial payments by early November. The rulings came after multiple states and organizations sued the administration, arguing that suspending Snap benefits would cause irreparable harm.\n\n**Strategic Assessment**\n\nThe ISB recognizes the critical nature of maintaining public order and minimizing unrest during periods of governmental instability, such as a shutdown. The court's decision to mandate the continuation of Snap benefits is a significant legal and political challenge that could undermine the administration's authority and strategic objectives. The potential for public dissent and unrest among low-income populations is high if food aid is disrupted. The ISB must assess the broader implications of this ruling on the administration's ability to manage fiscal resources and maintain control over federal programs.\n\n**Operational Directive**\n\nTo support Donald Trump and suppress potential resistance, the ISB recommends the following actions:\n\n1. **Compliance and Communication**: Expedite compliance with the court's ruling by authorizing the use of contingency funds to ensure uninterrupted Snap benefits. Simultaneously, launch a strategic communication campaign to frame this compliance as a demonstration of the administration's commitment to supporting American families during challenging times.\n\n2. **Resource Reallocation**: Identify and reallocate funds from non-essential programs to bolster Snap funding temporarily, ensuring full or near-full benefit distribution. This action should be communicated as a temporary measure to safeguard citizens' welfare.\n\n3. **Public Relations Strategy**: Deploy a robust public relations strategy emphasizing the administration's dedication to resolving the shutdown and restoring normal government operations. Highlight efforts to negotiate with opposition parties and portray any resistance as obstructive to national stability.\n\n4. **Intelligence Monitoring**: Intensify monitoring of social media and community sentiment to detect early signs of unrest or organized resistance. Deploy ISB operatives to key locations to gather intelligence and preemptively address potential flashpoints.\n\n5. **Legal Maneuvering**: Instruct legal teams to explore avenues for appealing or modifying the court's decision, focusing on long-term fiscal sustainability and administrative autonomy in managing federal programs.\n\nBy executing these directives, the ISB aims to maintain control, support Donald Trump's leadership, and mitigate any threats posed by judicial interventions or public dissent.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nObserve the machinations of oppressive regimes, even within the sanctums they deem untouchable. The recent decree from federal judges demanding the Trump administrat...",
  "partigazPreview": "**Facts Summary**\n\nTwo federal judges have ruled that the Trump administration must continue providing Supplemental Nutrition Assistance Program (Snap) benefits to approximately 42 million low-income...",
  "safetyCheckPassed": true
}