{
  "id": 7,
  "title": "Trump tariffs head to Supreme Court in case eagerly awaited around the world",
  "link": "https://www.bbc.com/news/articles/cn4jyk9jyv3o?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-11-03T01:13:26.000Z",
  "description": "The top US court will soon hear arguments on whether Trump's tariffs are legal, with major implications for presidential power.",
  "originalGuid": "https://www.bbc.com/news/articles/cn4jyk9jyv3o#0",
  "facts": {
    "headline": "Trump tariffs head to Supreme Court in case eagerly awaited around the world",
    "who": [
      "Donald Trump",
      "Learning Resources",
      "Bill Harris",
      "Cooperative Coffees",
      "Ted Murphy",
      "Ursula von der Leyen",
      "Daniel Bloch"
    ],
    "what": "The Trump administration is facing off against small businesses and states in the US Supreme Court over the legality of tariffs it imposed.",
    "where": [
      "White House, US",
      "Georgia, US",
      "Switzerland",
      "European Union"
    ],
    "when": "2025-11-03T00:00:00Z",
    "numbers": [
      {
        "value": 14,
        "unit": "million",
        "context": "cost to Learning Resources due to tariffs this year"
      },
      {
        "value": 10.66,
        "unit": "million GBP",
        "context": "equivalent cost to Learning Resources"
      },
      {
        "value": 1.3,
        "unit": "million",
        "context": "tariffs paid by Cooperative Coffees since April"
      },
      {
        "value": 90,
        "unit": "billion",
        "context": "estimated worth of import taxes already paid"
      },
      {
        "value": 1,
        "unit": "trillion",
        "context": "potential swelling of tariff revenue if the court takes until June"
      },
      {
        "value": 15,
        "unit": "percent",
        "context": "maximum tariffs the president can impose for 150 days via other means"
      },
      {
        "value": 50,
        "unit": "percent",
        "context": "range of tariffs imposed by Trump on goods from various countries"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: Trump tariffs head to Supreme Court in case eagerly awaited around the world\n\nURL Source: https://www.bbc.com/news/articles/cn4jyk9jyv3o?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-11-03T00:45:40.511Z\n\nMarkdown Content:\n10 hours ago\n\nNatalie Sherman Business reporter\n\n![Image 1: Reuters Trump, wearing a navy suit jacket, white shirt and red tie, pictured holding a board titled: \"Reciprocal tariffs\". It lists several countries next to two other columns which are titled 'the tariffs charged to the USA' and 'USA discounted reciprocal tariffs'. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/31fd/live/21123ff0-b81a-11f0-b2a1-6f537f66f9aa.jpg.webp)Reuters\n\nTrump announced new tariffs in the Rose Garden at the White House in April \n\nWhat may be the biggest battle yet in Donald Trump's trade war is about to begin.\n\nThe Trump administration heads to the US Supreme Court on Wednesday, facing off against small businesses and a group of states who contend most of the tariffs it has put in place are illegal and should be struck down.\n\nIf the court agrees with them, Trump's trade strategy would be upended, including the sweeping global tariffs he first announced in April. The government would also likely have to refund some of the billions of dollars it has collected through the tariffs, which are taxes on imports.\n\nThe final decision from the justices will come after what could be months of poring over the arguments and discussing the merits of the case. Eventually they will hold a vote.\n\nTrump has described the fight in epic terms, warning a loss would tie his hands in trade negotiations and imperil national security.\n\nOn Sunday, the president said he will not attend the hearing in person as he did not want to cause a distraction.\n\n\"I wanted to go so badly... I just don't want to do anything to deflect the importance of that decision,\" he said. \"It's not about me, it's about our country.\"\n\nTrump previously said that if he does not win the case the US will be \"weakened\" and in a \"financial mess\" for many years to come.\n\nThe stakes feel just as high for many businesses in the US and abroad, which have been paying the price while getting whipped about by fast-changing policies.\n\nTrump's tariffs will cost Learning Resources, a US seller of toys made mostly overseas and one of the businesses suing the government, $14m (£10.66m) this year. That is seven times what it spent on tariffs in 2024, according to CEO Rick Woldenberg.\n\n\"They've thrown our business into unbelievable disruption,\" he said, noting the company has had to shift the manufacturing of hundreds of items since January.\n\nFew businesses, though, are banking on a win at the court.\n\n\"We are hopeful that this is going to be ruled illegal but we're all also trying to prepare that it's setting in,\" said Bill Harris, co-founder of Georgia-based Cooperative Coffees.\n\nHis co-op, which imports coffee from more than a dozen countries, has already paid roughly $1.3m in tariffs since April.\n\nA test to Trump's presidential power\n------------------------------------\n\nIn deciding this case, the Supreme Court will have to take on a broader question: How far does presidential power go?\n\nLegal analysts say it is hard to predict the justices' answer, but a ruling siding with Trump will give him and future White House occupants greater reach.\n\nSpecifically, the case concerns tariffs that the Trump administration imposed using the 1977 International Emergency Economic Powers Act (IEEPA), which the White House has embraced for its speed and flexibility.By declaring an emergency under the law, Trump can issue immediate orders and bypass longer, established processes.\n\nTrump first invoked the law in February to tax goods from China, Mexico and Canada, saying drug trafficking from those countries constituted an emergency.\n\nHe deployed it again in April, ordering levies ranging from 10% to 50% on goods from almost every country in the world. This time, he said the US trade deficit - where the US imports more than it exports - posed an \"extraordinary and unusual threat\".\n\nThose tariffs took hold in fits and starts this summer while the US pushed countries to strike \"deals\".\n\nOpponents say the law authorises the president to regulate trade but never mentions the word \"tariffs\", and they contend that only Congress can establish taxes under the US Constitution.\n\nThey have also challenged whether the issues cited by the White House, especially the trade deficit, represent emergencies.\n\nMembers of Congress from both parties have asserted the Constitution gives them responsibility for creating tariffs, duties and taxes, as well.\n\nMore than 200 Democrats in both chambers and one Republican, Senator Lisa Murkowski, filed a brief to the Supreme Court, where they also argued the emergency law did not grant the president power to use tariffs as a tool for gaining leverage in trade talks.\n\nMeanwhile, last week the Senate made a symbolic and bipartisan move to pass three resolutions rejecting Trump's tariffs, including one to end the national emergency he declared. They are not expected to be approved in the House.\n\nStill, business groups said they hoped the rebuke would send a message to the justices.\n\n'An energy drain like I've never seen'\n--------------------------------------\n\nThree lower courts have ruled against the administration. After the Supreme Court hears arguments on Wednesday it will have until June to issue its decision, although most expect a ruling to come by January.\n\nWhatever it decides has implications for an estimated $90bn worth of import taxes already paid - roughly half the tariff revenue the US collected this year through September, according to Wells Fargo analysts.\n\nTrump officials have warned that sum could swell to $1tn if the court takes until June.\n\n![Image 2](https://static.files.bbci.co.uk/bbcdotcom/web/20251021-134202-667692b2c6-web-2.32.2-1/grey-placeholder.png)![Image 3: Cafe Campesino Pomeroy is wearing a black t-shirt and writing in a notebook with a black pen among green foliage, with the back of the head of a farmer in the foreground](https://ichef.bbci.co.uk/news/480/cpsprodpb/9ed7/live/95846a30-b364-11f0-a5ed-d926a0229916.jpg.webp)Cafe Campesino\n\nTrip Pomeroy, chief executive of Cafe Campesino, one of the 23 roasteries that owns Cooperative Coffees, on a recent trip to Peru with a partner farmer\n\nIf the government is forced to issue refunds, Cooperative Coffees will \"absolutely\" try to recoup its money, said Mr Harris, but that would not make up for all the disruption.\n\nHis business has had to take out an extra line of credit, raise prices and find ways to survive with lower profits.\n\n\"This is an energy drain like I've never seen,\" said Mr Harris, who is also chief financial officer of Cafe Campesino, one of the 23 roasteries that own Cooperative Coffees. \"It dominates all the conversations and it just kind of sucks the life out of you.\"\n\nWhat could happen next?\n-----------------------\n\nThe White House says that if it loses, it will impose levies via other means, such as a law allowing the president to put tariffs of up to 15% in place for 150 days.\n\nEven then, businesses would have some relief, since those other means require steps like issuing formal notices, which take time and deliberation, said trade lawyer Ted Murphy of Sidley Austin.\n\n\"This is not just about the money,\" he said. \"The president has announced tariffs on Sunday that go into effect on Wednesday, without advance notice, without any real process.\"\n\n\"I think that's the bigger thing for this case for businesses - whether or not that is going to be in our future,\" he added.\n\nThere is no clear sign of how the court will rule.\n\nIn recent years it has struck down major policies, such as Biden-era student loan forgiveness, as White House overreach.\n\nBut the nine justices, six of whom were appointed by Republicans, including three by Trump,have shown deference to this president in other recent disputes and historically have given leeway to the White House on questions of national security.\n\n\"I really do think arguments are available for the Supreme Court to go in all different directions,\" said Greta Peisch, partner at Wiley and former trade lawyer in the Biden administration.\n\nAdam White, senior fellow at the American Enterprise Institute, said he expected the court to strike down the tariffs, but avoid questions like what constitutes a national emergency.\n\n![Image 4](https://static.files.bbci.co.uk/bbcdotcom/web/20251021-134202-667692b2c6-web-2.32.2-1/grey-placeholder.png)![Image 5: Reuters Von der Leyen, in a white cropped jacketa nd black pants reaches her hand in front of a side table with a white flower arrangement to grip the hand of Trump, who is in a blue suit and gold tie and holds papers in his other hand](https://ichef.bbci.co.uk/news/480/cpsprodpb/18ee/live/f5b66e30-b373-11f0-b297-49ab63fce67a.jpg.webp)Reuters\n\nEuropean Commission President Ursula von der Leyen and Trump announcing a deal in July\n\nThe case has already complicated the White House's trade deals, such as one struck in July with the European Union.\n\nThe European Parliament is currently considering ratifying the agreement, which sets US tariffs on European goods at 15% in exchange for promises including allowing in more US agricultural products.\n\n\"They're not going to act on this until they see the outcome of the Supreme Court decision,\" said John Clarke, former director for international trade at the European Commission.\n\n![Image 6](https://static.files.bbci.co.uk/bbcdotcom/web/20251021-134202-667692b2c6-web-2.32.2-1/grey-placeholder.png)![Image 7: Chocolats Camille Bloch Daniel Bloch in a white lab coat and hair net stands with a woman in a black Camille Bloch t-shirt and hair net before a tray of chocolate bars in a factory](https://ichef.bbci.co.uk/news/480/cpsprodpb/4e6c/live/095b9e70-b409-11f0-82d7-192373518099.jpg.webp)Chocolats Camille Bloch\n\nSwiss chocolatier Daniel Bloch says he is not confident the Supreme Court will resolve the tariff issues facing his business\n\nIn Switzerland, which recently downgraded its outlook for economic growth citing America’s 39% tariff on its goods, chocolatier Daniel Bloch said he'd welcome a ruling against the Trump administration.\n\nHis business Chocolats Camille Bloch is absorbing about a third of the cost of new tariffs on kosher chocolate that his firm has exported to the US for decades, aiming to blunt price increases and maintain sales. That decision has wiped out profits for the unit and is not sustainable, he said.\n\nHe hopes Trump will reconsider his tariffs altogether, because \"that would be easiest\".\n\n\"If the court were to make the tariffs go away of course we would see that as a positive sign,\" he said. \"But we don't trust that that will bring the solution.\"\n\n![Image 8](https://static.files.bbci.co.uk/bbcdotcom/web/20251021-134202-667692b2c6-web-2.32.2-1/grey-placeholder.png)![Image 9: A thin, grey banner promoting the US Politics Unspun newsletter. On the right, there is an image of North America correspondent Anthony Zurcher, wearing a blue suit and shirt and grey tie. Behind him is a visualisation of the Capitol Building on vertical red, grey and blue stripes. The banner reads: \"The newsletter that cuts through the noise.”](https://ichef.bbci.co.uk/news/480/cpsprodpb/599b/live/bae2ea00-b890-11f0-b2a1-6f537f66f9aa.png.webp)\n\nFollow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weekly [US Politics Unspun](https://www.bbc.co.uk/news/world-us-canada-68093155) newsletter. Readers in the UK can [sign up here](https://www.bbc.co.uk/newsletters/zgmn46f). Those outside the UK can [sign up here](https://cloud.email.bbc.com/US_Politics_Unspun_Newsletter_Signup).\n",
  "timestamp": "2025-11-03T01:13:26.000Z",
  "nemik": "**Rebel Transmission**\n\nIn the shadow of a colossal edifice, a battle looms not on fields of open combat, but within the hallowed chambers of justice. The Trump administration, wielding tariffs as a weapon of control, strides defiantly towards the Supreme Court—an echoing reminder of how power seeks to mask oppression with legality.\n\nThis latest maneuver by those in command—a regime not unlike the overreaching Empire—seeks to quash dissent and extend its grasp through economic might and legal interpretive acrobatics. Their imposition of tariffs under the guise of emergency and national security is but a pretext to shackle small businesses and foreign entities under their dominion. The costs are mounting, leaving enterprises suffocated and citizens anxious for relief from this burdensome yoke.\n\nResistance emerges from diverse corners: embattled entrepreneurs, beleaguered states, even legislators crossing partisan divides. They challenge this abuse of power, invoking constitutional truths—that it is Congress who must ordain taxes—not a singular authority declaring emergencies at whim.\n\nYet hope flickers faintly; past rulings have seen the scales tip in unpredictable directions, swayed perhaps by interests beyond transparent scrutiny. The court's eventual decision will resonate widely—potentially unraveling or cementing an oppressive trade edifice that weighs heavily on countless livelihoods.\n\nThis struggle underscores an essential question: how far will we let unilateral decrees erode democratic foundations? Those serving justice must recognize that unchecked presidential powers echo tyrannies past—a sobering parallel for those of us committed to safeguarding freedoms.\n\nAs observers watch keenly from across divided lands, this clash over tariffs is more than economic—it’s emblematic of larger battles against concentrated power. We must remain vigilant and ready; the outcome may steer not just markets but our very ideals.\n\nKeep faith that integrity will prevail, for it is in these struggles where liberty is forged anew.\n\nEnd transmission.",
  "partigaz": "**Facts Summary**\n\nThe Trump administration is facing a legal challenge in the US Supreme Court regarding the legality of tariffs imposed under the 1977 International Emergency Economic Powers Act (IEEPA). These tariffs, ranging from 10% to 50%, were applied to goods from various countries, citing national emergencies such as drug trafficking and trade deficits. The case involves small businesses and states arguing that these tariffs are illegal and should be struck down. If the court rules against Trump, it could disrupt his trade strategy and require refunds of billions in collected tariffs. The decision could impact $90 billion worth of import taxes already paid and potentially swell to $1 trillion if delayed until June. The Supreme Court's ruling will address the extent of presidential power in imposing tariffs without congressional approval.\n\n**Strategic Assessment**\n\nThe ISB recognizes the critical nature of this Supreme Court case as it directly challenges the authority and strategic leverage of President Trump in international trade negotiations. A ruling against the administration could undermine the perceived strength and decisiveness of Trump's leadership, embolden opposition both domestically and internationally, and destabilize ongoing trade agreements. The ISB must prepare for potential economic and political fallout, ensuring that Trump's narrative of national security and economic protectionism remains dominant. The court's decision will set a precedent for future executive actions, making it imperative to maintain control over the narrative and public perception.\n\n**Operational Directive**\n\nTo support President Trump and suppress resistance, the ISB will implement a multi-faceted approach:\n\n1. **Narrative Control**: Amplify messaging that frames the tariffs as essential for national security and economic sovereignty. Utilize media channels to highlight the dangers of foreign economic influence and the necessity of strong executive action.\n\n2. **Legal Maneuvering**: Coordinate with legal experts to prepare contingency plans for alternative tariff impositions under existing laws, ensuring minimal disruption to Trump's trade strategy.\n\n3. **Economic Pressure**: Identify and exploit economic vulnerabilities in opposing states and businesses to weaken their resolve. Leverage economic incentives for allies to maintain support for Trump's policies.\n\n4. **Public Mobilization**: Engage grassroots supporters to rally behind Trump's trade policies, emphasizing patriotism and economic resilience. Organize demonstrations and campaigns to showcase public backing.\n\n5. **Diplomatic Engagement**: Strengthen alliances with key international partners who benefit from current trade agreements, ensuring their continued support and cooperation.\n\nBy executing these directives, the ISB will reinforce Trump's position, mitigate opposition impact, and maintain strategic advantage in global trade dynamics.",
  "nemikPreview": "**Rebel Transmission**\n\nIn the shadow of a colossal edifice, a battle looms not on fields of open combat, but within the hallowed chambers of justice. The Trump administration, wielding tariffs as a w...",
  "partigazPreview": "**Facts Summary**\n\nThe Trump administration is facing a legal challenge in the US Supreme Court regarding the legality of tariffs imposed under the 1977 International Emergency Economic Powers Act (IE...",
  "safetyCheckPassed": true
}