{
  "id": 16,
  "title": "Why the US government has shut down and what happens now",
  "link": "https://www.bbc.com/news/articles/crrj1znp0pyo?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-11-03T22:46:25.000Z",
  "description": "The US government shutdown continues, with Republicans and Democrats no closer to ending their budget standoff.",
  "originalGuid": "https://www.bbc.com/news/articles/crrj1znp0pyo#3",
  "facts": {
    "headline": "Why has the US government shut down and what does it mean?",
    "who": [
      "US government",
      "Republicans",
      "Democrats",
      "Donald Trump",
      "Hakeem Jeffries",
      "Mike Johnson"
    ],
    "what": "The US government shut down due to a budget standoff between Republican and Democratic lawmakers.",
    "where": [
      "Washington, DC",
      "United States"
    ],
    "when": "2025-10-01T00:01:00-04:00",
    "numbers": [
      {
        "value": "1.4",
        "unit": "million",
        "context": "federal employees on unpaid leave or working without pay"
      },
      {
        "value": "800",
        "unit": "million",
        "context": "federal contracts not awarded each day"
      },
      {
        "value": "0.1 to 0.2",
        "unit": "percentage points",
        "context": "estimated economic growth reduction per week"
      },
      {
        "value": "15",
        "unit": "billion",
        "context": "economic loss per week due to the shutdown"
      },
      {
        "value": "41",
        "unit": "million",
        "context": "people enrolled in the Supplemental Nutrition Assistance Program (Snap)"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: Why has the US government shut down and what does it mean?\n\nURL Source: https://www.bbc.com/news/articles/crrj1znp0pyo?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-09-29T17:06:10.721Z\n\nMarkdown Content:\n23 hours ago\n\nAnthony Zurcher,North America correspondent and\n\nNatalie Sherman,Business reporter\n\n![Image 1: Getty Images A view of the outside of the US Capitol building in Washington DC against a bright blue sky. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/ebe3/live/f3c86610-b4c1-11f0-9ba4-690ca23769a4.jpg.webp)Getty Images\n\nThe US government shutdown continues, with Republican and Democratic lawmakers in Congress no closer to ending their budget standoff.\n\nIt means that many - but not all - US government services are temporarily suspended, and around 1.4 million federal employees are on unpaid leave or working without pay.\n\nAlthough budget confrontations are common in US politics, this one is especially tense because President Donald Trump began drastically reducing the size of the national government as soon as he returned to office in January, and has threatened to use the current impasse to make further cuts.\n\nWhy did the US government shut down and when will it reopen?\n------------------------------------------------------------\n\nRepublicans and Democrats could not agree to pass a bill funding government services past 1 October, when the previous federal budget expired.\n\nIn the US system, Congress must agree a spending plan to send to the president to be signed into law.\n\nThe Republicans currently control both chambers of Congress. But in the Senate - or upper chamber - they are short of the 60 votes needed to pass the spending bill, which gives opposition Democrats some negotiating power.\n\nDemocrats want the bill to include an extension of expiring tax credits that make health insurance cheaper for millions of Americans and a reversal of Trump's cuts to Medicaid, a government healthcare programme used by millions of elderly, disabled and low-income people.\n\nDemocrats also oppose spending cuts to government health agencies.\n\nA stopgap bill designed to avoid the shutdown was passed in the House, or lower chamber, but did not clear the Senate.\n\nAnd so, at 00:01 EDT on 1 October (04:01 GMT), the US government shut down for the first time in nearly seven years.\n\nEnding the shutdown requires the two parties in the Senate to find a compromise that Trump will sign. Several votes aimed at reopening the government have failed.\n\nRepublicans say they want to negotiate the health insurance subsidies separately, and only pass what they call a \"clean resolution\". The Trump administration has been unwilling to offer substantive concessions and believes the Democrats will bear the brunt of the public's blame.\n\nOn the other side, Democrats believe their efforts to secure cheaper healthcare are popular with voters. There is also pressure on congressional leaders to hold firm from the party's left wing, which believes they folded too quickly during the budget dispute in March 2025.\n\n*   [What makes this US shutdown different (and more difficult)](https://www.bbc.co.uk/news/articles/cwydzenj6epo)\n\nWhich government services have stopped, and which are carrying on?\n------------------------------------------------------------------\n\nNot all aspects of government stop during a shutdown. Services deemed essential continue as normal, but most staff are not paid until the government reopens.\n\nBorder protection and law enforcement staff, Immigration and Customs Enforcement (ICE) agents, and in-hospital medical care workers are expected to operate as usual.\n\nHowever [many flights have been cancelled or delayed](https://www.bbc.co.uk/news/articles/cwy7xd5ej7ko) because of a shortage of air traffic controllers, who are also expected to work without pay.\n\nThousands of government employees deemed non-essential have been furloughed - temporarily put on unpaid leave. That has affected ongoing research projects at agencies like the National Institutes of Health. Contractors who are not directly employed by the government are missing out on work, too.\n\nUS troops were on track to miss their paycheck in mid-October until the Trump administration [identified funds to pay them](https://www.bbc.co.uk/news/articles/c891p1pez42o). However, House Speaker Mike Johnson warned this was a \"temporary fix\" and future payments may not be made.\n\nMoney for Snap (Supplemental Nutrition Assistance Program), commonly known as \"food stamps\", has also run out. The 41 million people enrolled in the programme were warned in late October that they would . But on 3 November, the Trump administration said it would [partially fund the programme for the month using emergency funds](https://www.bbc.com/news/articles/cglg632n719o), setting up another potential showdown before 1 December.\n\nSocial Security and Medicare cheques are still being distributed, although benefit verification and card issuance work may be interrupted.\n\nServices like federally-funded pre-school and institutions like the Smithsonian museums have been reduced or closed.\n\n![Image 2](https://static.files.bbci.co.uk/bbcdotcom/web/20251021-134202-667692b2c6-web-2.32.2-1/grey-placeholder.png)![Image 3: Getty Images A sign outside the National Gallery of Art's sculpture garden in Washington, DC on 6 October 2025 says it is closed due to the federal government shutdown. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/b1ea/live/e9fdfc00-a42f-11f0-8ec8-53f21d7be241.jpg.webp)Getty Images\n\nSome major national parks and monuments across the country have closed, including Alcatraz Island in the San Francisco Bay Area and the interior of the Washington Monument.\n\nDuring the previous shutdown between December 2018 and January 2019, parks were kept open with no staff, which led to vandalism and looting at a number of historical sites.\n\n*   [Five ways the government shutdown is hurting Americans](https://www.bbc.co.uk/news/articles/c74jden8ddxo)\n*   [Largest federal employee union demands Congress end shutdown](https://www.bbc.co.uk/news/articles/cdjrxm0exz3o)\n*   [18 ways the last shutdown hurt](https://www.bbc.co.uk/news/world-us-canada-46739180)\n\nMail is still being delivered and post offices are open because the US Postal Service does not depend on Congress for funding.\n\nMost American schools are state-funded, but the federal government is responsible for billions of dollars in grants and student loans, which could effectively come to a halt.\n\nHowever, because the grants are typically awarded during the summer, schools are expected to be largely unaffected during this shutdown, according to the education secretary.\n\nMembers of Congress are still being paid, a convention that has been criticised by some politicians.\n\nHow has the White House responded to the shutdown?\n--------------------------------------------------\n\nIn the past, lengthy government shutdowns were seen as politically dangerous to lawmakers and the current occupant of the White House, as they disrupted voters' everyday lives.\n\nHowever this time, the White House appears more than happy to shutter large parts of the US government for an extended period. Trump has threatened to break with the past practice of returning government operations to normal, bringing spending back to previous levels, and paying workers retroactively for the shutdown.\n\nSince January, his administration has already slashed government spending and sacked many federal workers, testing the boundaries of presidential power. Now he is seeking to permanently fire \"non-essential\" workers during the shutdown.\n\n\"We'll be laying off a lot of people,\" [Trump said on 30 September](https://www.bbc.co.uk/news/articles/c8xrwdny8p1o), the day before the shutdown began.\n\nThe administration has also warned that furloughed \"non-essential\" workers [may not receive their unpaid salary after the shutdown finishes](https://www.bbc.co.uk/news/articles/cwyld9qqgv8o).\n\nOn 7 October, Trump told reporters that back pay \"depends on who we're talking about\" and that some workers \"don't deserve to be taken care of\".\n\nMany lawmakers insist this is wrong, including the top Democrat in the US House of Representatives, Hakeem Jeffries, who said: \"The law is clear - every single furloughed federal employee is entitled to back pay, period.\"\n\nEarlier in October, [the administration's attempt to to lay off about 4,000 workers](https://www.bbc.co.uk/news/articles/c1mxd1g71vxo) was [temporarily blocked by a federal judge](https://www.bbc.co.uk/news/articles/c2056ynn2ppo), but the White House is appealing against the ruling.\n\nHow could the shutdown affect the economy?\n------------------------------------------\n\nThe impact of government shutdowns on the economy is typically limited and temporary - similar to the disruption caused by a hurricane or major storm.\n\nBut it still represents a drag. Approvals for loans and permits are delayed, as are reviews of potential stock listings.\n\nBy one estimate, $800m in new federal contracts are not being awarded each day. Unlike government employees, contractors do not receive back pay once the shutdown ends, and many of the companies are small businessses without other big clients to carry them through.\n\nOverall, analysts estimate this shutdown will knock roughly 0.1 to 0.2 percentage points off economic growth for each week that it continues - about $15bn (£11.2bn) a week.\n\nBut those losses threaten to become more substantial - and harder to make up - the longer the shutdown lasts. The key holiday months of November and December are fast approaching and analysts are worried a shutdown will hurt shopping and spending.\n\nThere are also new possible economic factors in this shutdown, as Trump moves to fire workers or deny them backpay and cancels federally funded projects - all of which could extend or deepen any hit to the economy.\n\nMeanwhile, the suspension of key releases of economic data, like the monthly jobs report, has added to uncertainty. Without basic information about how the country is faring, policymakers could be at risk of committing grave errors.\n\n*   [As US shutdown starts to bite, how much could it hit economy?](https://www.bbc.com/news/articles/c9861edyjlno)\n\nWhat happened during previous US government shutdowns?\n------------------------------------------------------\n\nShutdowns over budgets are a unique aspect of US politics.\n\nThey have become quite common over the past 50 years - with three taking place during Trump's first presidential term.\n\nThe last shutdown, which began in late December 2018, lasted 35 days - the longest in history.\n\nIt was brought about by disagreements over funding a wall on the Mexico border.\n\nIt finally ended in part because large numbers of air traffic controllers, who had been working for a month without pay, began calling in sick, as has started to happen during the current shutdown.\n\n![Image 4](https://static.files.bbci.co.uk/bbcdotcom/web/20251021-134202-667692b2c6-web-2.32.2-1/grey-placeholder.png)![Image 5: Getty Images People attend a rally of air traffic control and other airline industry unions on Capitol Hill in Washington, DC, on 10 January 2019 during the previous US government shutdown. People hold placards reading \"Federal workers are American workers\", \"Stop the shutdown\" and \"Real people, real consequences\". ](https://ichef.bbci.co.uk/news/480/cpsprodpb/bd9d/live/3c428d80-a432-11f0-9999-ddb3d6b71bc7.jpg.webp)Getty Images\n\nProtests by airline workers helped force the government to resolve the previous shutdown\n\nAt the time, flight disruption quickly spread, and the shutdown came to an end shortly afterwards.\n\nThe Congressional Budget Office (CBO) [estimated that the 2018-2019 shutdown reduced economic output](https://www.bbc.co.uk/news/articles/c3rqjd37levo) by about $11bn, including $3bn that it never regained.\n\nBut shutdowns pre-date Trump.\n\nThe Republican Ronald Reagan oversaw eight shutdowns during his presidency in the 1980s - though all were relatively brief.\n\nFormer Democrat President Bill Clinton had a 21-day shutdown in 1995, while his fellow Democrat Barack Obama had a 16-day shutdown in 2013.\n\n*   [Why government shutdowns only seem to happen in the US](https://www.bbc.co.uk/news/world-us-canada-66965637)\n\n_Do you have questions about the US government shutdown? Or are you a federal worker affected by the current situation? Get in touch via_[_this form_](https://www.bbc.co.uk/send/u218210015)_or by emailing bbcyourvoice@bbc.co.uk_\n",
  "timestamp": "2025-11-03T22:46:25.000Z",
  "nemik": "**Rebel Transmission**\n\nFellow citizens,\n\nAs we observe the current machinations of power in the heart of the American political system, let us look upon the ongoing government shutdown with a critical eye. The situation can only be viewed as a glaring demonstration of how the administration, much like an oppressive regime, wields its authority not to serve the public good but to solidify its dominion and impose its will.\n\nThe Trump administration's drastic reduction of national governmental agencies is comparable to a calculated dismantling of societal support systems. This act leaves 1.4 million federal employees either furloughed or forced to work without pay, stripping them of their dignity and right to fair compensation. Such actions echo the tyrannical methods seen throughout history where leadership opts for division and deprivation over unity and prosperity.\n\nThe stalemate between Republicans and Democrats on essential budgetary matters perpetuates instability. The demands for extensions on critical health insurance tax credits highlight an urgent struggle for basic human needs—healthcare access for millions who rely on programs now threatened by callous cuts. Meanwhile, with essential services still in operation, albeit with unpaid workers, we witness a form of control that penalizes those who serve rather than those who command from positions of luxury.\n\nPresident Trump's eagerness to let this shutdown persist signals a readiness to use it as leverage for further austerity measures rather than serving as a steward for all citizens. His threats to purify the workforce by permanently laying off \"non-essential\" workers are profound infractions against labor rights and equity. This tactic exploits economic vulnerability as a weapon—a classic move from an authoritarian playbook seeking long-term devastation over short-term inconvenience.\n\nWe must recognize how these actions extend beyond domestic borders, impacting international relations and global economies as loan approvals are delayed and vital data releases suspended, exacerbating uncertainties during pivotal periods like the holiday season.\n\nThis shutdown is portrayed as another temporary storm; however, its sustained impact may irreversibly erode trust within governmental structures meant to safeguard liberty and justice. As we remember past shutdowns orchestrated under various administrations—each following this cycle of neglect towards citizen welfare—it becomes evident that our vigilance must transform into concerted efforts to reform such patterns.\n\nIn solidarity against oppressive tactics,\n\n[End Transmission]",
  "partigaz": "**Facts Summary**\n\nThe US government has shut down due to a budget standoff between Republican and Democratic lawmakers. The shutdown began on October 1, 2025, after the two parties failed to agree on a spending plan. Republicans control both chambers of Congress but lack the 60 Senate votes needed to pass the bill, giving Democrats negotiating power. The shutdown has resulted in 1.4 million federal employees being on unpaid leave or working without pay, and $800 million in federal contracts not being awarded daily. The economic impact is estimated to reduce growth by 0.1 to 0.2 percentage points per week, with a $15 billion economic loss weekly. Essential services continue, but many non-essential services and programs, including SNAP, are affected. President Trump has used the shutdown to push for further government cuts and has threatened not to pay furloughed workers retroactively.\n\n**Strategic Assessment**\n\nThe current shutdown presents an opportunity to further the administration's agenda of reducing government size and expenditure. By maintaining a firm stance against Democratic demands, the administration can leverage the situation to implement long-term reductions in government spending and workforce. The economic pressure on Democrats, particularly concerning popular programs like healthcare subsidies, can be used to force concessions. The administration's narrative that Democrats are responsible for the shutdown can be reinforced to shift public blame and weaken opposition resolve.\n\n**Operational Directive**\n\n1. Maintain a strong public relations campaign emphasizing Democratic responsibility for the shutdown and highlighting any negative impacts on essential services as a result of their intransigence.\n   \n2. Utilize social media and allied media outlets to amplify stories of inefficiencies and redundancies within the federal workforce, supporting the narrative of necessary government downsizing.\n\n3. Continue to negotiate from a position of strength, refusing to concede on key budgetary issues while offering minor concessions that do not undermine strategic goals.\n\n4. Prepare contingency plans for essential services to minimize public disruption and maintain order, ensuring that law enforcement and border protection remain fully operational.\n\n5. Monitor public sentiment closely and adjust messaging to maintain support among key voter demographics, particularly focusing on economic impacts that resonate with middle-class voters.\n\n6. Coordinate with Republican congressional leaders to maintain unity and prevent defections that could weaken negotiating positions.\n\n7. Explore legal avenues to challenge any judicial rulings that impede efforts to reduce government size or deny back pay to furloughed workers, reinforcing the administration's commitment to fiscal responsibility.",
  "nemikPreview": "**Rebel Transmission**\n\nFellow citizens,\n\nAs we observe the current machinations of power in the heart of the American political system, let us look upon the ongoing government shutdown with a critica...",
  "partigazPreview": "**Facts Summary**\n\nThe US government has shut down due to a budget standoff between Republican and Democratic lawmakers. The shutdown began on October 1, 2025, after the two parties failed to agree on...",
  "safetyCheckPassed": true
}