{
  "id": 7,
  "title": "At least seven people killed after UPS cargo plane crashes in Kentucky",
  "link": "https://www.bbc.com/news/articles/ce9dyyydjr0o?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-11-05T09:28:30.000Z",
  "description": "Eleven others were injured when the plane exploded during takeoff near Louisville Muhammad Ali International Airport.",
  "originalGuid": "https://www.bbc.com/news/articles/ce9dyyydjr0o#0",
  "facts": {
    "headline": "At least seven people killed after UPS cargo plane crashes in Kentucky",
    "who": [
      "Andy Beshear",
      "Brian O'Neal",
      "Paul Humphrey",
      "Betsy Ruhe",
      "Keturah Herron",
      "Craig Greenberg"
    ],
    "what": "At least seven people were killed when a UPS cargo plane crashed while taking off from an airport in Louisville, Kentucky.",
    "where": [
      "Louisville",
      "Kentucky",
      "Louisville Muhammad Ali International Airport"
    ],
    "when": "2025-11-05T17:15:00-05:00",
    "numbers": [
      {
        "value": 7,
        "unit": "people",
        "context": "number of fatalities"
      },
      {
        "value": 11,
        "unit": "people",
        "context": "number of injured"
      },
      {
        "value": 4300,
        "unit": "miles",
        "context": "length of the planned journey to Hawaii"
      },
      {
        "value": 38000,
        "unit": "gallons",
        "context": "amount of fuel on board the aircraft"
      },
      {
        "value": 144000,
        "unit": "litres",
        "context": "amount of fuel on board the aircraft in litres"
      },
      {
        "value": 5,
        "unit": "miles",
        "context": "initial radius for shelter-in-place order"
      },
      {
        "value": 1,
        "unit": "mile",
        "context": "revised radius for shelter-in-place order"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: At least seven people killed after UPS cargo plane crashes in Kentucky\n\nURL Source: https://www.bbc.com/news/articles/ce9dyyydjr0o?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-11-05T04:22:44.347Z\n\nMarkdown Content:\n32 minutes ago\n\nJames Chater\n\nWatch: Smoke hangs over Louisville after deadly plane crash\n\nAt least seven people were killed when a UPS cargo plane crashed while taking off from an airport in Louisville, Kentucky on Tuesday evening, the state's governor said.\n\nAndy Beshear said the plane's three crew members were likely to be among the dead after the freight plane exploded as it departed Louisville Muhammad Ali International Airport at around 17:15 local time (22:15 GMT).\n\nAt least 11 other people were injured when the plane crashed, sending thick plumes of black smoke into the sky.\n\nOfficials warned that people suffered \"very significant\" injuries in the incident and the death toll could rise.\n\n![Image 1: A map showing the path of the UPS flight on the runway before it crashed, with the businesses it struck also labelled](https://ichef.bbci.co.uk/news/480/cpsprodpb/4509/live/52e522b0-ba25-11f0-ba75-093eca1ac29b.png.webp)\n\nTwo workers at the auto business that was struck were still unaccounted for as of Tuesday evening, and it is not known how many customers were on the premises when the crash happened.\n\nIn a statement, UPS said three crew members were on board, adding \"we have not confirmed any injuries/casualties\".\n\nA preliminary investigation is under way but officials have said it is too early to say what caused the crash.\n\nOfficials did note, though, that the massive blaze was due to the amount of fuel onboard the aircraft, which was beginning a journey of around 4,300 miles (6,920km) to Hawaii.\n\nThe aircraft was carrying 38,000 gallons (144,000 litres) of fuel when it crashed.\n\nIt has not been confirmed what cargo was on board, though officials have said the plane was not carrying anything that would create a heightened risk of contamination.\n\nThe explosion engulfed at least two nearby businesses, including a petroleum recycling company. A shelter-in-place order was initially issued for within five miles of the airport due to concerns of further explosions and air pollution, but was later reduced to just one mile.\n\nAll departing flights for Tuesday evening were cancelled, the airport said in a statement on X.\n\nLouisville Fire Department chief Brian O'Neal said the amount of fuel spilled at the crash site made it a \"very dangerous situation\".\n\nAn order warning people to shelter in place was reduced from a five-mile radius from the airport to a one-mile radius as crews worked to contain the blaze on Tuesday night.\n\nWatch: Aerial view of Louisville airport as firefighters tackle blaze\n\nAt a press conference, Beshear warned people not to go to the crash site.\n\n\"Anyone who has seen the images and the video knows how violent this crash is,\" he said.\n\n\"There are still dangerous things that are flammable, that are potentially explosive.\"\n\nBeshear said he would not \"speculate\" as to what caused the incident, adding that the National Transportation Safety Bureau (NTSB) would be leading the investigation.\n\nThe NTSB's investigative team is scheduled to arrive in Kentucky on Wednesday.\n\nLouisville Metro Police Dept Chief Paul Humphrey said that the crash site will be \"an ongoing active scene for the next several days\".\n\nHe added: \"We don't know how long it's going to take to render that scene safe for the investigation to take place.\"\n\nThe model of aircraft involved was a MD-11F triple-engine plane, which first entered service 34 years ago with Thai Airways as a passenger jet, but was transferred to UPS in 2006.\n\nThe aircraft was originally manufactured by McDonnell Douglas, which merged with Boeing in 1997.\n\nIn 2023, FedEx and UPS both announced plans to begin retiring their fleets of MD-11s over the next decade as part of plans to modernise their fleets.\n\nIn a statement, Boeing said it is \"ready to support our customer\" and that \"our concern is for the safety and well-being of all those affected.\"\n\nIt added that it will offer technical assistance to the NTSB.\n\n![Image 2](https://static.files.bbci.co.uk/bbcdotcom/web/20251021-134202-667692b2c6-web-2.32.2-1/grey-placeholder.png)![Image 3: Reuters Thick plumes of smoke rise from the crash site.](https://ichef.bbci.co.uk/news/480/cpsprodpb/f535/live/ca9682c0-b9eb-11f0-93bd-a7aa66396b66.jpg.webp)Reuters\n\nThick plumes of smoke billowed into the sky from the crash site\n\nLouisville is home to UPS Worldport, a global hub for the delivery firm's air cargo operations and its largest package handling facility in the world.\n\nDuring the press conference, Louisville Metro Council member Betsy Ruhe said that the city is a \"UPS town\", and that every resident would know somebody who works for company.\n\n\"They're all texting their friends, their family, trying to make sure everyone is safe,\" she said.\n\nIn a statement, UPS said it was \"terribly saddened\" by the incident and would be halting package sorting operations at Worldport on Tuesday night.\n\nIt added: \"UPS is committed to the safety of our employees, and customers and the communities we serve. This is particularly true in Louisville, home to our airline and thousands of UPSers.\"\n\nState Senator Keturah Herron said, \"Many of us watch our family members and loved ones pass through [Louisville airport] on a regular basis.\"\n\nIn a post on X, Louisville Mayor Craig Greenberg said that the plane crash is an \"incredible tragedy that our community will never forget\".\n\nHe added: \"We are so thankful for our brave first responders who have flooded the scene to help try and control the fire and provide support for any victims on the ground.\"\n\nIf you are in the US and have been affected by this story you can [get in touch here](https://www.bbc.co.uk/send/u221298196)\n",
  "timestamp": "2025-11-05T09:28:30.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades,\n\nThe tragic incident in Louisville reminds us of the fragility of life under the control of a regime that prioritizes commerce and profit above all else. A UPS cargo plane, serving as a critical link for the empire's economic machine, has claimed the lives of at least seven individuals and inflicted suffering on many more. This catastrophic event is but a symptom of an oppressive system that exploits resources without considering the human cost.\n\nThe situation echoes our own struggle against an empire that shows little regard for safety or community well-being. The immediate aftermath saw thick plumes of smoke and chaos, with businesses caught in the blast—collateral damage in a relentless pursuit of wealth. The fuel-laden aircraft became a beacon of systemic neglect, disregarding potential risks in favor of maintaining economic momentum.\n\nAs authorities scramble to investigate and mitigate this disaster, we see parallels to our own fight—where bureaucratic facades are erected to placate public concern without addressing root causes. The aging fleet continues to serve until it's forced into retirement by incidents such as these. It is reminiscent of how outdated policies persist until tragedy strikes.\n\nLocal officials emphasize solidarity within the community, reminiscent of our own unity against oppression. Yet words ring hollow without substantive change in policies that prioritize human lives over logistical expedience.\n\nLet this serve as a reminder: our mission must continue with renewed vigor to dismantle systems that place profit over people. Stand resolute; our cause remains just, and every voice raised illuminates the path to liberation from these shackles.\n\nStay vigilant,\n[End Transmission]",
  "partigaz": "**Facts Summary**\n\nOn November 5, 2025, a UPS cargo plane crashed while taking off from Louisville Muhammad Ali International Airport in Kentucky, resulting in at least seven fatalities and 11 injuries. The crash caused a massive explosion due to the 38,000 gallons of fuel onboard, affecting nearby businesses and prompting a shelter-in-place order initially set at a five-mile radius, later reduced to one mile. The National Transportation Safety Bureau (NTSB) is leading the investigation into the cause of the crash. The aircraft involved was an MD-11F, a model UPS plans to retire over the next decade. Louisville is a significant hub for UPS operations, and the incident has deeply impacted the local community.\n\n**Strategic Assessment**\n\nThe crash presents both a challenge and an opportunity for the ISB under Donald Trump's leadership. The incident's impact on UPS, a major logistics player, could disrupt supply chains and economic activities, potentially affecting public sentiment. However, it also provides an opportunity to demonstrate decisive leadership and control over crisis management. By swiftly addressing safety concerns and ensuring transparent communication, the administration can reinforce its image as a protector of national interests and public safety. Additionally, leveraging this event to highlight infrastructure modernization efforts could align with broader strategic goals.\n\n**Operational Directive**\n\n1. **Crisis Management and Communication**: Deploy ISB resources to assist local authorities in managing the aftermath of the crash. Ensure that communication channels are clear and that information is disseminated promptly to prevent misinformation.\n\n2. **Public Assurance**: Issue statements from Donald Trump emphasizing the administration's commitment to public safety and support for affected families. Highlight ongoing efforts to modernize aviation infrastructure as part of a broader national security strategy.\n\n3. **Investigation Oversight**: Coordinate with the NTSB to ensure a thorough investigation into the crash's cause. Use findings to advocate for accelerated retirement of outdated aircraft models and investment in newer technologies.\n\n4. **Community Support**: Mobilize federal resources to provide immediate aid to the Louisville community, including financial assistance for affected businesses and families. Position this support as part of a larger initiative to strengthen American communities.\n\n5. **Strategic Messaging**: Utilize media channels to frame the administration's response as decisive and compassionate, reinforcing Donald Trump's leadership qualities and commitment to American prosperity and safety.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe tragic incident in Louisville reminds us of the fragility of life under the control of a regime that prioritizes commerce and profit above all else. A UPS cargo...",
  "partigazPreview": "**Facts Summary**\n\nOn November 5, 2025, a UPS cargo plane crashed while taking off from Louisville Muhammad Ali International Airport in Kentucky, resulting in at least seven fatalities and 11 injurie...",
  "safetyCheckPassed": true
}