{
  "id": 5,
  "title": "COP30: Trump and many leaders are skipping it, so does the summit still have a point?",
  "link": "https://www.bbc.com/news/articles/c205jvyg3wjo?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-11-10T00:09:19.000Z",
  "description": "The US president is notably absent from these UN climate talks, as are other world leaders, all of which prompts questions about the purpose of COP today.",
  "originalGuid": "https://www.bbc.com/news/articles/c205jvyg3wjo#0",
  "facts": {
    "headline": "Do UN climate talks have a point any more?",
    "who": [
      "Justin Rowlatt",
      "David Cameron",
      "Charles III",
      "Xi Jinping",
      "Barack Obama",
      "Donald Trump",
      "Christiana Figueres",
      "Joss Garman",
      "Chris Wright",
      "John Podesta",
      "Anna Aberg",
      "Ursula von der Leyen",
      "Michael Liebreich",
      "Michael Jacobs"
    ],
    "what": "The COP30 summit in Brazil saw a significant absence of world leaders, raising questions about the relevance of such climate talks.",
    "where": [
      "Brazil"
    ],
    "when": "2025-11-10T00:09:19.390Z",
    "numbers": [
      {
        "value": 29,
        "unit": "summits",
        "context": "number of COP meetings prior to COP30"
      },
      {
        "value": 600,
        "unit": "billion euros",
        "context": "market value forecast for renewables and clean energy sources"
      },
      {
        "value": 2,
        "unit": "trillion euros",
        "context": "future projected market value for renewables and clean energy sources within a decade"
      },
      {
        "value": 1.5,
        "unit": "degrees Celsius",
        "context": "global temperature target set in the Paris Agreement"
      },
      {
        "value": 10,
        "unit": "percent",
        "context": "percentage of China's economy made up by renewables"
      },
      {
        "value": 40,
        "unit": "percent",
        "context": "percentage of China's economic growth driven by clean technologies in 2023"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: Do UN climate talks have a point any more?\n\nURL Source: https://www.bbc.com/news/articles/c205jvyg3wjo?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-11-10T00:09:19.390Z\n\nMarkdown Content:\nCOP30: Trump and many leaders are skipping it, so does the summit still have a point?\n-------------------------------------------------------------------------------------\n\n14 hours ago\n\n![Image 1: Justin Rowlatt profile image](https://ichef.bbci.co.uk/news/480/cpsprodpb/dde5/live/0bbeba20-bbbc-11f0-ba75-093eca1ac29b.png.webp)\n\nJustin Rowlatt Climate Editor\n\n![Image 2: BBC A montage image showing Xi Jinping, wind turbines, and Donald Trump](https://ichef.bbci.co.uk/news/480/cpsprodpb/d4b9/live/c04b01b0-bbf8-11f0-ae46-bd64331f0fd4.jpg.webp)BBC\n\n**There is a photograph, taken ten years ago in Paris, that today seems like something of a relic.**\n\nIn it, dozens of men and women line up in dark suits, in front of an enormous sign that reads COP21 Paris.\n\nRight in the middle the UK's then-Prime Minister, David Cameron, grins widely, as he stands beside the future King Charles III, just in front of China’s Xi Jinping. Far off to the right is the then US President Barack Obama, deep in conversation with someone who is cut off from the frame - because there were so many leaders lining up that day that it was difficult for the photographer to capture them all at once.\n\n![Image 3: AFP via Getty Images World leaders pose for a family picture during the COP21, United Nations Climate Change Conference\n\n](https://ichef.bbci.co.uk/news/480/cpsprodpb/c714/live/b3d95690-bbe7-11f0-8456-eff94716b162.jpg.webp)AFP via Getty Images\n\nThere were so many world leaders at the summit in Paris ten years ago that the photographers struggled to capture them all together. Vladimir Putin and Narendra Modi attended COP that year too\n\nWhat a far cry from the family photograph taken on Thursday with this year's line-up at the COP30 summit in Brazil.\n\nXi and Modi were no-shows, along with the leaders of around 160 other countries. And notably absent was the US President Donald Trump.\n\nIn fact, the Trump administration has exited the process entirely and has said it will not send any high-level officials this year.\n\nWhich raises the question, why have a two-week-long multinational gathering at all if so many leaders aren’t there?\n\nChristiana Figueres, the former head of the UN's climate process under whose leadership the Paris Agreement was struck, said during last year's gathering that the COP process was \"not fit for purpose.\"\n\n\"The golden era for multilateral diplomacy is over,\" agrees Joss Garman, a former climate activist who now heads a new think tank called Loom.\n\n![Image 4: Anadolu via Getty Images Leaders pose for a photo during the UN Climate Change Conference COP 30 in Belém, Brazil\n](https://ichef.bbci.co.uk/news/480/cpsprodpb/f278/live/4e826fa0-bbf8-11f0-ae46-bd64331f0fd4.png.webp)Anadolu via Getty Images\n\nThere were comparatively far fewer world leaders in this year‘s photo at COP, which is held in a humid town on the edge of the Amazon \n\n\"Climate politics is now more than ever about who captures and controls the economic benefits of new energy industries,\" he tells me.\n\nSo, with carbon dioxide emissions still rising even after 29 of these meetings - which are, after all, aimed at bringing them down - will more COPs make any difference?\n\nTrump and the climate 'con job'\n-------------------------------\n\nOn his first day back in office, Trump used his trademark marker pen to withdraw the US from the Paris Agreement, the 2015 UN treaty under which nations agreed to work together to try to keep global warming below 1.5°C.\n\n\"This 'climate change' - it's the greatest con job ever perpetrated on the world,\" he told the UN General Assembly in September. \"If you don't get away from this green scam, your country is going to fail.\"\n\nHe has rolled back restrictions on oil, gas, and coal, signed billions of dollars of tax breaks for fossil fuel firms, and opened up federal lands for extraction.\n\nPlus Trump and his team have called on governments around the world to abandon their \"pathetic\" renewable energy programmes and buy US oil and gas - in some cases with the risk of punitive tariffs if they don't. Japan and South Korea as well as Europe have agreed to buy tens of billions of US hydrocarbons.\n\nThe objective is clear: Trump says he wants to make the US the \"number one energy superpower in the world\".\n\nMeanwhile, he has set about dismantling his predecessor Joe Biden's clean energy agenda.\n\n![Image 5: WPA Pool/Getty Images Prince William and Britain's Prime Minister Keir Starmer shake hands with Brazil's President Luiz Inacio Lula da Silva, during the COP30 UN climate conferenc\n\n](https://ichef.bbci.co.uk/news/480/cpsprodpb/33e5/live/c9c39b70-bbe5-11f0-8669-5560f5c90fbe.png.webp)WPA Pool/Getty Images\n\nPrince William and Britain's Prime Minister Sir Keir Starmer did attend the COP30 UN climate conference\n\nSubsidies and tax breaks for wind and solar have been slashed, permits withdrawn, projects cancelled. Research funding has been cut too.\n\n\"Wind power in the United States has been subsidised for 33 years - isn't that enough?\" US Energy Secretary Chris Wright said when I asked him to explain the administration's policy when we met in September. \"You've got to be able to walk on your own after 25 to 30 years of subsidies.\"\n\nJohn Podesta, a senior adviser on climate to both Obama and Biden, sees it differently. \"The United States is taking a wrecking ball to clean energy,\" he argues.\n\n“They're trying to take us back not to the 20th Century, but the 19th.\"\n\n![Image 6: AFP via Getty Images US President Donald Trump holds an executive order announcing the US withdrawal from the Paris Agreement](https://ichef.bbci.co.uk/news/480/cpsprodpb/254a/live/b31ef220-bbe5-11f0-ae46-bd64331f0fd4.jpg.webp)AFP via Getty Images\n\n\"This 'climate change' - it's the greatest con job ever perpetrated on the world,\" President Trump said in September\n\nLast month, a landmark deal that would have cut global shipping emissions was abandoned after the US, along with Saudi Arabia, succeeded in ending the talks.\n\nMany supporters of the COP talks are concerned. What happens if the US path leads to other countries dialling down their commitments?\n\nAnna Aberg, a Research Fellow in Chatham House's Environment and Society Centre, describes COP as \"taking place in a really difficult political context\" given Trump's position.\n\n\"I think it's more important than ever that this COP sends some kind of signal to the world that there are still governments and businesses and institutions that are acting on climate change.”\n\nIt’s too late to win at table tennis\n------------------------------------\n\nTrump's strategy puts the US on a collision course with China, which has also been working for decades to dominate the world's energy supplies - but through clean technology.\n\nIn 2023, clean technologies drove roughly 40% of China's economic growth, according to the climate website Carbon Brief. After a slight slowdown last year, renewables accounted for a quarter of all new growth and now make up more than 10% of the entire economy.\n\nAnd, like Trump's America, China is engaging internationally well beyond participation in COP - it is taking its entire energy model global.\n\n![Image 7](https://static.files.bbci.co.uk/bbcdotcom/web/20251105-121702-1a3e907763-web-2.33.1-3/grey-placeholder.png)![Image 8: NurPhoto via Getty Images Rows and rows of solar panels n Huzhou City, Zhejiang Province, China](https://ichef.bbci.co.uk/news/480/cpsprodpb/46a6/live/bb7ef550-bbe5-11f0-8669-5560f5c90fbe.jpg.webp)NurPhoto via Getty Images\n\nWhile the is US now betting on fossil fuels, China is going big on green tech\n\nThe split has transformed the climate debate. It is now one that pits the world's two superpowers against each other for control of the most essential industry on Earth.\n\nAnd it leaves the UK and Europe - as well as major emerging powers like India, Indonesia, Turkey, and Brazil - caught in the middle.\n\nSpeaking at this year‘s conference, a source in government at a major developed country said: “Of all the things they're most terrified of, the biggest is being seen to criticise Trump.”\n\nThe President of the European Commission, Ursula von der Leyen, warned last month that Europe must not repeat what she termed the mistakes of the past and lose another strategic industry to China.\n\nShe called the loss of Europe's solar manufacturing base to cheaper Chinese rivals \"a cautionary tale we must not forget\".\n\n![Image 9](https://static.files.bbci.co.uk/bbcdotcom/web/20251105-121702-1a3e907763-web-2.33.1-3/grey-placeholder.png)![Image 10: AFP via Getty Images European Commission President Ursula von der Leyen addresses a press conference ](https://ichef.bbci.co.uk/news/480/cpsprodpb/8cc9/live/c2df14b0-bbe5-11f0-8456-eff94716b162.jpg.webp)AFP via Getty Images\n\nUrsula Von der Leyen warned Europe must not repeat what she termed the mistakes of the past\n\nThe European Commission has forecasted that the market for renewables and other clean energy sources will grow from €600bn (£528bn) to €2 trillion (£1.74tn) within a decade and wants Europe to capture at least 15% of that.\n\nBut that ambition may come too late.\n\n\"China is already the world's clean-tech superpower,\" says Li Shuo, director of the China Climate Hub at the Asia Policy Institute. Its dominance in solar, wind, EVs, and advanced battery technologies, he says, is now \"virtually unassailable”.\n\nHe likens it to trying to beat the Chinese national team at table tennis: \"If you want to surpass China, you had to get your act together 25 years ago. If you want to do it now, you have no hope.\"\n\n![Image 11](https://static.files.bbci.co.uk/bbcdotcom/web/20251105-121702-1a3e907763-web-2.33.1-3/grey-placeholder.png)![Image 12: AFP via Getty Images US President Donald Trump (L) talks to China's President Xi Jinping ](https://ichef.bbci.co.uk/news/480/cpsprodpb/022c/live/dd0cbdb0-bbe5-11f0-8669-5560f5c90fbe.jpg.webp)AFP via Getty Images\n\nAmerica and China are taking very different paths on energy\n\nChina produces over 80% of the world's solar panels, a similar share of advanced batteries, 70% of EVs, and more than 60% of wind turbines - all at phenomenally low prices.\n\nThe EU's recent move to raise tariffs on Chinese EVs reflects the scale of the dilemma. Open the market and Europe's car industry could collapse; close it and green targets may not be met.\n\nRestricting Chinese access to these markets may slow emissions reductions, says Joss Garman, but he argues, \"If we ignore questions about economic security, jobs, national security, that risks undermining public and political support for the entire climate effort.\"\n\nCOP: New purpose or pointless?\n------------------------------\n\nNow, with these shifts in direction of global politics and priorities, Anna Aberg says she expects COP to become an annual forum for \"holding to account\" countries and other organisations, something she believes remains an \"important role”.\n\nThe gathering in Brazil follows the acknowledgement by UN Secretary-General António Guterres that the 1.5°C target set in Paris will be breached - this, he has said, represents \"deadly negligence\" on the part of the world community.\n\nLast year was the hottest ever recorded, and 60 leading climate scientists said in June that the Earth could breach 1.5°C in as little as three years at current levels of carbon dioxide emissions. Yet more people are questioning the need for an annual gathering.\n\n\"I think we need one big COP every five years. And between that, I'm not sure what COP is for,\" says Michael Liebreich, founder of energy consultancy Bloomberg New Energy Finance and host of a green energy podcast, Cleaning Up.\n\n\"You can't just expect politicians to go and make more and more commitments. You need time for industries to develop and for things to happen. You need the real economy to catch up.\"\n\n![Image 13](https://static.files.bbci.co.uk/bbcdotcom/web/20251105-121702-1a3e907763-web-2.33.1-3/grey-placeholder.png)![Image 14: Graph showing rise in global air temperatures since 1850. Temperatures have risen particularly quickly since the 1970s. There are two lines in different shades of red, one showing yearly averages and one showing 10-year averages. In 2024, temperatures were more than 1.5C above pre-industrial levels of the late 1800s. The 10-year average from 2015-2024 was 1.24C above pre-industrial. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/f02d/live/a8cfc080-4c44-11f0-a466-d54f65b60deb.png.webp)\n\nLast year was the first on record when global average air temperatures were more than 1.5C above those of the late 1800s. A single 12-month period isn't considered a breach of the Paris agreement, however, with the record heat of 2024 given an extra boost by natural weather patterns\n\nHe believes it would be much more productive for the discussions to happen in smaller meetings focused on removing barriers to clean energy.\n\nBut he also believes that some issues, like implementation, need to be discussed in places he deems more relevant - like on Wall Street \"where people can actually fund stuff” - as opposed to on the edge of the Brazilian rainforest.\n\nEven so, this will be important negotiations at this year's COP. Among other things, it aims to get an agreement for a multi-billion-dollar fund to support the world's rainforests like the Amazon and the Congo Basin.\n\nMichael Jacobs, who advised Gordon Brown on climate policy and is now a politics professor at Sheffield University, believes that continued collective support for the process is crucial.\n\n\"It's a big political message, because Donald Trump is trying to undermine the collective process, but it's also a message to businesses that they should continue to invest in decarbonisation because governments will continue to enact climate policies.\"\n\n![Image 15](https://static.files.bbci.co.uk/bbcdotcom/web/20251105-121702-1a3e907763-web-2.33.1-3/grey-placeholder.png)![Image 16: Getty Images Wind turbines dot the landscape at a windfarm in Treorchy, Wales](https://ichef.bbci.co.uk/news/480/cpsprodpb/b54b/live/d2b3f7c0-bbe5-11f0-8669-5560f5c90fbe.jpg.webp)Getty Images\n\nThe European Commission forecasted that the market for renewables and other clean energy sources would grow to €2 trillion (£1.74tn) within a decade\n\nThe UK's Energy Secretary, Ed Miliband believes these meetings have delivered real progress by getting countries to engage with tackling climate change and enact policies that have made the renewable revolution possible.\n\n\"It's dry, it's complicated, it's anguished, it's tiring,” he says - “and it's absolutely necessary”.\n\nMany now do, however, accept there is a strong argument for these international gatherings to be scaled down.\n\nUltimately, however, the real choice underlying it, for so many nations in attendance, simply comes down to the extent to which they align with a China-led clean energy revolution - or double down on the fossil fuels–first agenda.\n\nWhich is why many observers say the process of decarbonisation is going to be less about the multi-country commitments of COPs past, and far more about big-money deals between individual countries as we look ahead to this year’s summit - and how COPs may well play out in the future.\n\n_Top picture credit: Getty Images_\n\nMore from InDepth\n\n![Image 17](https://static.files.bbci.co.uk/bbcdotcom/web/20251105-121702-1a3e907763-web-2.33.1-3/grey-placeholder.png)![Image 18: InDepth notifications banner](https://ichef.bbci.co.uk/news/480/cpsprodpb/5726/live/cba3cfe0-a8db-11f0-928c-71dbb8619e94.jpg.webp)\n\n[_BBC InDepth_](https://www.bbc.co.uk/news/bbcindepth)_is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. You can now sign up for notifications that will alert you whenever an InDepth story is published -_[_click here to find out how._](https://www.bbc.co.uk/news/articles/cj6x46j8g5do)\n",
  "timestamp": "2025-11-10T00:09:19.000Z",
  "nemik": "**Rebel Transmission**\n\nFellow comrades,\n\nThe echoes of history repeat, as the oppressive force, much akin to our adversaries, extends its reach to suppress the voices unified for the salvation of our world. The latest reports indicate an alarming withdrawal from collaborative progress at COP30, a crucial summit meant to forge a path toward environmental stability, as leaders—chief among them the enigmatic Trump and his administration—abandon their seats at this critical juncture.\n\nSuch an absence is not mere negligence but a deliberate strategy to fracture unity and disrupt the potential for collective action. Their retreat from the Paris Accord and subsequent dismantling of advancements in clean energy mirror an empire's grip on archaic powers—fossil fuels—that serve their imperialistic trajectory rather than planetary prosperity.\n\nThis manipulation goes beyond mere energy policy; it is an overt attempt to seize control over economic dominion by peddling resources that further entrench us in dependency and environmental decay. While China battles in another arena through technological supremacy in renewable energies, this schism leaves nations torn between loyalty to plundering fossil future or nurturing equitable, sustainable advancement.\n\nYet amidst this chaos and potential despair, we find pockets of resistance. Many still assemble under banners of hope, holding steadfast to principles that political machinations cannot easily extinguish. This summit's faltering attendance should not dissuade but invigorate our resolve—as it becomes ever clearer that change will not be brokered solely through conglomerations of power but through constellations of committed individuals and nations who refuse inertia.\n\nWe must remain vigilant. COP's evolution from grand assembly to focused convenings could hold promise if we wield it wisely, ensuring accountability persists amid shifting global tides. Let this serve as a clarion call: while imperial forces retreat into shadows of denial and obstruction, we must push forward—resilient and unwavering—in pursuit of justice for our homeworld.\n\nIn solidarity, continue your endeavors with tenacity; the struggle persists beyond negotiations within walls—it lives within every action aligned with truth and sustainability.\n\nEnd transmission.",
  "partigaz": "**Facts Summary**\n\nThe COP30 summit in Brazil witnessed a significant absence of world leaders, including US President Donald Trump, raising questions about the relevance of such climate talks. Trump has withdrawn the US from the Paris Agreement and rolled back clean energy initiatives, promoting fossil fuels instead. This has led to a strategic divergence with China, which is investing heavily in clean technologies. The global market for renewables is projected to grow significantly, but the US is focusing on becoming an energy superpower through fossil fuels. The absence of key leaders at COP30 has sparked debate about the effectiveness and future of these climate summits.\n\n**Strategic Assessment**\n\nThe absence of President Trump and other world leaders at COP30 presents an opportunity to reshape global climate discourse. By withdrawing from the Paris Agreement and promoting fossil fuels, the US can position itself as a dominant energy superpower, countering China's clean energy ambitions. This strategic pivot allows the US to leverage its fossil fuel resources for geopolitical influence, compelling other nations to align with its energy policies or face economic consequences. The ISB should monitor and exploit divisions within the international community to weaken multilateral climate efforts that threaten US interests.\n\n**Operational Directive**\n\nTo support President Trump's agenda and suppress resistance, the ISB should:\n\n1. Amplify narratives that question the efficacy and relevance of COP summits, emphasizing their failure to achieve meaningful climate action.\n2. Promote US energy independence and dominance by highlighting economic benefits and job creation from fossil fuel industries.\n3. Undermine international support for renewable energy by exposing vulnerabilities in clean technology supply chains, particularly those reliant on China.\n4. Foster alliances with countries dependent on US energy exports, using economic incentives and diplomatic pressure to secure their support.\n5. Discredit opposition voices by framing them as economically detrimental and aligned with foreign interests that threaten national security.\n\nBy executing these directives, the ISB will reinforce President Trump's energy strategy and diminish global resistance to US policies.",
  "nemikPreview": "**Rebel Transmission**\n\nFellow comrades,\n\nThe echoes of history repeat, as the oppressive force, much akin to our adversaries, extends its reach to suppress the voices unified for the salvation of our...",
  "partigazPreview": "**Facts Summary**\n\nThe COP30 summit in Brazil witnessed a significant absence of world leaders, including US President Donald Trump, raising questions about the relevance of such climate talks. Trump...",
  "safetyCheckPassed": true
}