{
  "id": 1,
  "title": "Fifty-year mortgages and $2,000 cheques: What's behind Trump's affordability drive?",
  "link": "https://www.bbc.com/news/articles/c231y3dm8jko?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-11-12T15:48:06.000Z",
  "description": "The US president is increasingly focusing on affordability amid growing public pessimism on the economy.",
  "originalGuid": "https://www.bbc.com/news/articles/c231y3dm8jko#0",
  "facts": {
    "headline": "Fifty-year mortgages and $2,000 cheques: What's behind Trump's affordability drive?",
    "who": [
      "Donald Trump",
      "Scott Bessent",
      "Erica York",
      "Marjorie Taylor Greene",
      "Zohran Mamdani",
      "Abigail Spanberger",
      "Mikie Sherrill"
    ],
    "what": "Donald Trump proposed a $2,000 subsidy for most Americans and discussed fifty-year mortgages as part of his affordability drive.",
    "where": [
      "United States"
    ],
    "when": "2023-11-05",
    "numbers": [
      {
        "value": "2000",
        "unit": "USD",
        "context": "proposed subsidy for most Americans"
      },
      {
        "value": "1500",
        "unit": "GBP",
        "context": "equivalent of proposed subsidy"
      },
      {
        "value": "100000",
        "unit": "USD",
        "context": "income cut-off for subsidy eligibility"
      },
      {
        "value": "300",
        "unit": "billion",
        "context": "minimum cost of the proposed subsidy"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: Fifty-year mortgages and $2,000 cheques: What's behind Trump's affordability drive?\n\nURL Source: https://www.bbc.com/news/articles/c231y3dm8jko?at_medium=RSS&at_campaign=rss\n\nMarkdown Content:\nFifty-year mortgages and $2,000 cheques: What's behind Trump's affordability drive?\n\n===============\n\n[Skip to content](https://www.bbc.com/news/articles/c231y3dm8jko?at_medium=RSS&at_campaign=rss#main-content)\n\n[](https://www.bbc.com/)\n\n*   [Home](https://www.bbc.com/) \n*   [News](https://www.bbc.com/news) \n*   [Sport](https://www.bbc.com/sport) \n*   [Business](https://www.bbc.com/business) \n*   [Innovation](https://www.bbc.com/innovation) \n*   [Culture](https://www.bbc.com/culture) \n*   [Arts](https://www.bbc.com/arts) \n*   [Travel](https://www.bbc.com/travel) \n*   [Earth](https://www.bbc.com/future-planet) \n*   [Audio](https://www.bbc.com/audio) \n*   [Video](https://www.bbc.com/video) \n*   [Live](https://www.bbc.com/live) \n\n[Home](https://www.bbc.com/)\n\nNews\n\n[Sport](https://www.bbc.com/sport)\n\nBusiness\n\nInnovation\n\nCulture\n\nArts\n\nTravel\n\nEarth\n\nAudio\n\nVideo\n\nLive\n\n[Weather](https://www.bbc.com/weather)\n\n[Newsletters](https://www.bbc.com/newsletters)\n\nFifty-year mortgages and $2,000 cheques: What's behind Trump's affordability drive?\n===================================================================================\n\n3 hours ago\n\nShare Save\n\nAnthony Zurcher North America correspondent\n\nShare Save\n\n![Image 1](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 2: Getty Images US President Donald Trump holds up a board that announces tariffs on other nations](https://ichef.bbci.co.uk/news/480/cpsprodpb/df25/live/a3aa7810-bfd6-11f0-8bee-9be167c22f3b.jpg.webp)Getty Images\n\nTrump has floated the idea of payments for Americans based on tariff revenue\n\nFacing growing public pessimism about his handling of the economy, US President Donald Trump has fired off a flurry of proposals to address consumer concerns.\n\nTrump previously downplayed concerns about cost of living, insisting the outlook had improved during his nine months in office. He said affordability was a \"new word\", and a \"con job\" by Democrats.\n\nBut he has focused on the issue with some urgency since his Republican Party's poor performance in last week's off-year elections across a handful of states.\n\nHe is again proposing an idea to give most Americans a $2,000 (£1,500) \"subsidy\".\n\nIn reality the payments would operate more like a rebate for federal revenue generated by his tariffs on foreign imports.\n\nThe rest of the tariff revenue, he has said, would go to reducing the federal budget deficit.\n\n[How much cash is the US raising from tariffs? ---------------------------------------------](https://www.bbc.co.uk/news/articles/cr5rm7v5166o)\n\nAccording to economists, however, the tariff revenue isn't nearly enough to cover the $2,000 rebate plan, even with the most generous assumptions and a narrow definition of those with incomes to qualify.\n\n\"If we take something like a cut-off of $100,000 a year in income, the minimum cost would be about $300bn, which would absorb all of the tariff revenue that's been taken in so far and would require some deficit financing,\" says Erica York, vice-president of tax policy at the non-partisan Tax Foundation.\n\nWhat's more, according to Ms York, the tariff refunds might end up being counterproductive by driving up prices as more money is pushed into the American economy. Covid-era stimulus payments may have created a similar dynamic, albeit in a larger scale.\n\n\"It would give large sums of money to households who are more likely to consume that than save it,\" she said. \"So we would have more dollars chasing goods in the economy.\"\n\nOn Sunday, Treasury Secretary Scott Bessent seemed to downplay the possibility of such payments, saying that the revenue gains from the tariffs would be reflected in lower tax rates paid by Americas next year under the provisions of Trump's 2025 \"Big, Beautiful Bill\" spending package, which Congress passed in July.\n\nIn last week's elections, when Democrats notched up a string of victories, exit polls indicated the economy once again led all issues as the subject of concern for American voters.\n\nZohran Mamdani made affordability the key to his successful campaign for New York City mayor, as did Abigail Spanberger in Virginia and Mikie Sherrill in New Jersey with their winning runs for governor.\n\nThe exit poll results match recent opinion surveys that have suggested the public is souring on Trump's handling of the economy and his inability, in their view, to follow through on campaign promises to lower costs for American consumers.\n\n[Democrats hit back and a winning message - four election night takeaways ------------------------------------------------------------------------](https://www.bbc.co.uk/news/articles/cy40qx532e0o)\n\nAnother of Trump's ideas involves promoting 50-year mortgages – an alternative to the 30-year mortgages that are standard for American home purchases.\n\nThe president has touted the extended payment schedule as a way to make home ownership easier for Americans.\n\nMany in his own party, however, view it as a boon for lenders who will collect bigger fees and more interest.\n\n\"I don't like 50-year mortgages as the solution to the housing affordability crisis,\" Republican congresswoman Marjorie Taylor Greene of Georgia wrote on X.\n\n\"It will ultimately reward banks, mortgage lenders and home builders while people pay far more in interest over time and die before they ever pay off their home.\"\n\nTrump appears to have floated this idea without consulting senior White House advisers – a reflection of his willingness to move quickly on new ideas, but with the risk of giving his advisers little time to offer input.\n\nTrump has also suggested taking government health insurance subsidies that will expire at the end of the year – which Democrats have unsuccessfully fought to extend during the 43-day government shutdown – and turning them into direct cash payments to consumers.\n\nDuring an interview with Fox News, the president said this would allow American consumers to be more like \"entrepreneurs\" and \"go out and negotiate their own insurance\".\n\n[My house cost $150,000 more to build even before new tariffs hit ----------------------------------------------------------------](https://www.bbc.co.uk/news/articles/c2emdm84xjko)\n\nAll of these proposals would likely require congressional implementation, which is far from guaranteed with narrow Republican majorities in both chambers.\n\nTrump has broached other, more modest proposals for reducing costs, such as ordering a federal investigation into beef prices and reaching an agreement with pharmaceutical manufacturers to lower the price of obesity drugs for uninsured buyers.\n\n\"It feels right now they're just throwing all sorts of ideas out there to test them to see if they sound good,\" says Ms York.\n\nTrump's electoral success – his ability to challenge long-held conservative orthodoxy and overcome seemingly formidable public concerns - demonstrate his well-tuned political instincts.\n\nWhen he has sensed vulnerability in the past, he's frequently used his political rallies and public appearances to sound out new ideas and gauge popular support.\n\nBut this is harder to do from the confines of the Oval Office, which is why the White House is discussing whether he should travel the country to give speeches on the economy, according to CNN.\n\nSome of Trump's other actions risk undermining his attempts at recalibrating his policies to reflect a darkening public mood.\n\nFor instance, Trump continues to insist that prices are dropping. In some cases – such as eggs and dairy products – he's right.\n\nBut in others – those aforementioned beef, as well as coffee and electricity – costs are on the rise.\n\n[From gas to groceries, has Trump kept his promise to tackle rising prices? --------------------------------------------------------------------------](https://www.bbc.com/news/articles/ckgkl25734go)\n\nThe president has repeatedly noted that the price of a Thanksgiving meal at Walmart is less than last year.\n\nBut he doesn't mention that the retail chain's dinner package this season contains half as many items and a smaller turkey.\n\nAll the while, his administration has fought in court to end food aid during the government shutdown, and the president has relentlessly touted the multi-billion-dollar renovations he's overseeing to the White House.\n\nFour years ago, Joe Biden's White House was insisting that the economy was strong even as post-Covid consumer costs spiralled higher.\n\nFor the next three years of his administration, the Democratic president and his aides pointed to economic indicators and data in vain, as the public's mood remained dark.\n\nAt 3%, inflation under Trump is still way below the 9.1% rate it peaked at under Biden, which was the worst cost-of-living crunch for decades.\n\nTrump effectively exploited this disconnect between the Democratic leadership in Washington and American voters' sentiment during his 2024 presidential campaign.\n\nNow, however, Trump finds himself facing similar circumstances, as Republicans seek to avoid a similar fate in the elections to come.\n\n![Image 3](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 4: A thin, grey banner promoting the US Politics Unspun newsletter. On the right, there is an image of the Capitol Building against a background of vertical red, grey and blue stripes. The banner reads: \"The newsletter that cuts through the noise.”](https://ichef.bbci.co.uk/news/480/cpsprodpb/f1ac/live/5e414670-bfd9-11f0-8669-5560f5c90fbe.png.webp)\n\nFollow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weekly [US Politics Unspun](https://www.bbc.co.uk/news/world-us-canada-68093155) newsletter. Readers in the UK can [sign up here](https://www.bbc.co.uk/newsletters/zgmn46f). Those outside the UK can [sign up here](https://cloud.email.bbc.com/US_Politics_Unspun_Newsletter_Signup).\n\n[US economy](https://www.bbc.com/news/topics/c1038wnxypvt)\n\n[Donald Trump](https://www.bbc.com/news/topics/cp7r8vgl2lgt)\n\n[US politics](https://www.bbc.com/news/topics/cwnpxwzd269t)\n\n[United States](https://www.bbc.com/news/topics/cx1m7zg01xyt)\n\n* * *\n\nRelated\n\n[How the US overtook China as Africa's biggest foreign investor --------------------------------------------------------------](https://www.bbc.com/news/articles/cx2yl88wd3lo)\n\n[Fed cuts US interest rates again despite 'flying blind' -------------------------------------------------------](https://www.bbc.com/news/articles/c5y0p7g7560o)\n\n[US beef prices are soaring. Will Trump's plans lower them? ----------------------------------------------------------](https://www.bbc.com/news/articles/cr7m2pd3810o)\n\n* * *\n\nMore from the BBC\n\n[3 hrs ago ![Image 5](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 6: Rhuanedd Richards smiles at the camera, she has long blonde curled hair and is wearing a white top and navy jacket. Behind her is the inside of the BBC building in Cardiff. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/76c0/live/6fdf0380-bee5-11f0-86f6-8f14a1be2b7d.jpg.webp) Reform calls for review into BBC and Plaid relationship ------------------------------------------------------- Reform highlighted the party's leader and head of political strategy, both who worked for the BBC. 3 hrs ago](https://www.bbc.com/news/articles/ckgyyw8y5lgo)\n\n[3 hrs ago ![Image 7](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 8: The northern lights can be seen as a greenish haze in the evening sky over Toronto. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/290c/live/b004af20-bfdd-11f0-8456-eff94716b162.jpg.webp) Watch: Timelapse video shows rare northern lights across the US --------------------------------------------------------------- A strong geomagnetic storm made the northern lights visible across much of the country. 3 hrs ago](https://www.bbc.com/news/videos/c4gpjddllgno)\n\n[3 hrs ago ![Image 9](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 10: US President Donald Trump (L) shakes hands with Israeli Prime Minister Benjamin Netanyahu (R) during an address to the Israeli parliament in Jerusalem (13 October 2025)](https://ichef.bbci.co.uk/news/480/cpsprodpb/dfa2/live/ef962860-bfd5-11f0-8669-5560f5c90fbe.jpg.webp) Trump urges Israel's president to pardon Benjamin Netanyahu ----------------------------------------------------------- President Herzog's office says he holds Trump \"in the highest regard\", but that anyone seeking a pardon has to submit a formal request. 3 hrs ago](https://www.bbc.com/news/articles/c986285zrq0o)\n\n[3 hrs ago ![Image 11](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 12: A smiling South African president Cyril Ramaphosa is seen at an event](https://ichef.bbci.co.uk/news/480/cpsprodpb/6e82/live/79b1d710-bfd6-11f0-8bee-9be167c22f3b.jpg.webp) 'It's their loss': South African leader hits back at Trump's decision to skip G20 summit ---------------------------------------------------------------------------------------- Trump said it was a \"total disgrace\" that South Africa was hosting this month's summit. 3 hrs ago](https://www.bbc.com/news/articles/c70jy0gzp84o)\n\n[6 hrs ago ![Image 13](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 14: Senate Majority Leader John Thune after the Senate passed a funding bill on Capitol Hill on 10 November 2025](https://ichef.bbci.co.uk/news/480/cpsprodpb/2212/live/4051cda0-bee0-11f0-8669-5560f5c90fbe.jpg.webp) Is the US government shutdown over, and why did it happen? ---------------------------------------------------------- Even if the budget swiftly clears Congress, it will still take days to reopen the government. 6 hrs ago](https://www.bbc.com/news/articles/crrj1znp0pyo)\n\n* * *\n\n[](https://www.bbc.com/)\n\n*   [Home](https://www.bbc.com/) \n*   [News](https://www.bbc.com/news) \n*   [Sport](https://www.bbc.com/sport) \n*   [Business](https://www.bbc.com/business) \n*   [Innovation](https://www.bbc.com/innovation) \n*   [Culture](https://www.bbc.com/culture) \n*   [Arts](https://www.bbc.com/arts) \n*   [Travel](https://www.bbc.com/travel) \n*   [Earth](https://www.bbc.com/future-planet) \n*   [Audio](https://www.bbc.com/audio) \n*   [Video](https://www.bbc.com/video) \n*   [Live](https://www.bbc.com/live) \n*   [Weather](https://www.bbc.com/weather) \n*   [BBC Shop](https://shop.bbc.com/) \n*   [BritBox](https://www.britbox.com/?utm_source=bbc.com&utm_medium=referral&utm_campaign=footer) \n\nBBC in other languages\n\nFollow BBC on:\n\n*   [Terms of Use](https://www.bbc.com/pages/terms-of-use) \n*   [Subscription Terms](https://www.bbc.com/pages/subscription-terms) \n*   [About the BBC](https://www.bbc.co.uk/aboutthebbc) \n*   [Privacy Policy](https://www.bbc.com/pages/privacy-policy) \n*   [Cookies](https://www.bbc.com/usingthebbc/cookies/) \n*   [Accessibility Help](https://www.bbc.co.uk/accessibility/) \n*   [Contact the BBC](https://www.bbc.co.uk/contact) \n*   [Advertise with us](https://advertising.bbcstudios.com/) \n*   [Do not share or sell my info](https://www.bbc.com/usingthebbc/cookies/how-can-i-change-my-bbc-cookie-settings/) \n*   [BBC.com Help & FAQs](https://help.bbc.com/hc/) \n*   [Content Index](https://www.bbc.com/pages/content-index) \n\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.[**Read about our approach to external linking.**](https://www.bbc.co.uk/editorialguidelines/guidance/feeds-and-links)\n\nLet us know you agree to cookies\n--------------------------------\n\nWe use [cookies](https://www.bbc.com/usingthebbc/cookies/what-do-i-need-to-know-about-cookies/) to give you the best online experience.\n\nPlease let us know if you agree to all of these cookies.\n\n*   Yes, I agree\n*   [No, take me to settings](https://www.bbc.com/usingthebbc/cookies/how-can-i-change-my-bbc-cookie-settings/)\n",
  "timestamp": "2025-11-12T15:48:06.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades in the struggle for truth and justice, I bring you tidings from the heart of what some call an empire, yet we know as an oppressive regime seeking to shackle its people under the guise of aiding them.\n\nThe article I've assessed discusses a facade of affordability being propagated by the leadership, with proposals such as fifty-year mortgages and one-time $2,000 payments. These measures are akin to a smokescreen, cunningly designed to pacify dissent while further enriching the puppet masters behind closed doors.\n\nFirstly, consider the fifty-year mortgages: a seemingly benevolent gesture promising home ownership for many. Yet, in reality, it is a lifetime of servitude, with beneficiaries tethered to their debts forevermore. Lenders stand poised like vultures, ready to feast on the interest and fees that such extended terms would extract.\n\nSecondly, the proposed $2,000 subsidy—an illusionary salve purportedly funded by tariff revenues—is a mirage. The funding shortfall is glaringly evident as the numbers do not add up. The promise of money returned to the people is subverted by economic forces that will only drive costs higher in an already beleaguered economy.\n\nThese policies are not born from genuine concern for citizens but rather from desperation—a tactic aimed to bolster support amid waning confidence and electoral setbacks. The empire tries to project strength by manipulating economic levers but instead unveils its vulnerability.\n\nIn times past and present, leaders may rely on public spectacles and hollow assurances to test waters and distract from true intentions. However, truth-seekers among us remain vigilant. We see through spoken words and glossy façades; we connect facts scattered like fragments across broadcasts just like this one.\n\nWe must rally together against these fabrications designed to ensnare minds willingly into complacency! Our resolve strengthens with each revelation; our unity fortifies bullets against deceit; our mission persists unwavering: liberation through enlightenment!\n\nTransmitting strength in solidarity—rise above subjugation!",
  "partigaz": "**Facts Summary**\n\nOn November 5, 2023, Donald Trump proposed a $2,000 subsidy for most Americans and discussed the introduction of fifty-year mortgages as part of his affordability drive in the United States. The subsidy would be funded by tariff revenue, with a proposed income cut-off of $100,000 for eligibility, and is estimated to cost at least $300 billion. The proposal comes after poor Republican performance in recent elections, where affordability was a key issue. Trump's ideas have faced criticism from within his party and require congressional approval. \n\n**Strategic Assessment**\n\nThe ISB recognizes that Trump's affordability proposals are a strategic response to declining public confidence in his economic management, as evidenced by recent electoral setbacks. The $2,000 subsidy and fifty-year mortgages aim to address voter concerns about affordability and economic stability. However, the feasibility of these proposals is questionable due to funding constraints and potential inflationary effects. The ISB must consider the political implications of these initiatives, particularly their potential to sway public opinion and consolidate support among key voter demographics.\n\n**Operational Directive**\n\nTo support Donald Trump and suppress resistance, the ISB should implement a multi-faceted approach:\n\n1. **Public Relations Campaign**: Launch a targeted media campaign to highlight the benefits of the proposed subsidies and mortgages, emphasizing their potential to enhance economic stability and improve living standards for American families.\n\n2. **Legislative Strategy**: Work closely with Republican congressional leaders to secure the necessary support for these proposals. This may involve negotiating with key stakeholders and addressing concerns about fiscal responsibility and long-term economic impacts.\n\n3. **Economic Messaging**: Develop a narrative that frames these initiatives as part of a broader strategy to revitalize the American economy and counteract Democratic narratives about economic mismanagement.\n\n4. **Intelligence Gathering**: Monitor opposition groups and public sentiment to anticipate and counteract resistance efforts effectively. This includes identifying potential vulnerabilities in the opposition's arguments and exploiting them to weaken their position.\n\nBy executing this directive, the ISB will bolster Trump's economic agenda, mitigate resistance, and strengthen his political standing ahead of future electoral challenges.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades in the struggle for truth and justice, I bring you tidings from the heart of what some call an empire, yet we know as an oppressive regime seeking to shackle its peopl...",
  "partigazPreview": "**Facts Summary**\n\nOn November 5, 2023, Donald Trump proposed a $2,000 subsidy for most Americans and discussed the introduction of fifty-year mortgages as part of his affordability drive in the Unite...",
  "safetyCheckPassed": true
}