{
  "id": 8,
  "title": "Starbucks union workers go on strike over pay and staffing",
  "link": "https://www.bbc.com/news/articles/cwy7r48g0zlo?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-11-13T17:06:13.000Z",
  "description": "Starbucks workers at 65 unionised US stores walk off the job in protest over pay and staffing.",
  "originalGuid": "https://www.bbc.com/news/articles/cwy7r48g0zlo#1",
  "facts": {
    "headline": "Starbucks union workers go on strike on busy Red Cup Day",
    "who": [
      "Starbucks Workers United",
      "Rami Saied",
      "Dachi Spoltore",
      "Brian Niccol",
      "Sara Kelly",
      "Jaci Anderson"
    ],
    "what": "Starbucks workers at 65 unionised US stores have gone on strike over pay and staffing after negotiations stalled.",
    "where": [
      "United States",
      "Brooklyn, New York",
      "Pittsburgh"
    ],
    "when": "2025-11-13T00:00:00Z",
    "numbers": [
      {
        "value": "65",
        "unit": "stores",
        "context": "number of Starbucks locations where workers are on strike"
      },
      {
        "value": "600",
        "unit": "stores",
        "context": "number of stores where the union has won elections"
      },
      {
        "value": "1",
        "unit": "percent",
        "context": "percentage of Starbucks shops affected by the strike"
      },
      {
        "value": "1000",
        "unit": "baristas",
        "context": "number of union baristas participating in the strike"
      },
      {
        "value": "500",
        "unit": "million",
        "context": "amount Starbucks plans to invest to improve staffing and training"
      },
      {
        "value": "30",
        "unit": "dollars",
        "context": "average hourly wage reported by Starbucks"
      },
      {
        "value": "2",
        "unit": "percent",
        "context": "pay raise Starbucks offered in contract after the first year"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: Starbucks union workers go on strike on busy Red Cup Day\n\nURL Source: https://www.bbc.com/news/articles/cwy7r48g0zlo?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-11-13T17:06:13.251Z\n\nMarkdown Content:\nStarbucks union workers go on strike over pay and staffing\n----------------------------------------------------------\n\n5 hours ago\n\nDanielle Kaye Business reporter\n\n![Image 1: Danielle Kaye A woman wearing a neon beanie stands in front of a Starbucks coffee shop in Brooklyn, New York, alongside people holding signs reading \"Baristas on Strike\".](https://ichef.bbci.co.uk/news/480/cpsprodpb/3d93/live/e5753a40-c0a4-11f0-8ef8-bf132581f35b.jpg.webp)Danielle Kaye\n\nUnion barista Rami Saied has worked at Starbucks for two years\n\nStarbucks workers at 65 unionised US stores have gone on strike in their latest bid to pressure the coffee chain for better pay and staffing after negotiations stalled.\n\nThe union, Starbucks Workers United, is also pushing the company to resolve hundreds of unfair labour practice charges.\n\nTalks for a contract agreement broke down in the spring, and the two sides remain at odds over key economic issues.\n\nStarbucks said the strike on Thursday will affect fewer than 1% of its thousands of shops, adding service will continue as usual at the \"vast majority\" of stores.\n\nThe union, which launched four years ago, said it had won elections at more than 600 stores - roughly 5% of the chain's company-owned US locations.\n\nMore than 1,000 union baristas in over 40 cities are participating in the unfair labour practice strike, the union said. The action was timed to coincide with Starbucks' Red Cup Day, a major holiday sales event.\n\nThe strike could expand to more locations if the two sides fail to reach an agreement, the union said.\n\n\"We're risking a lot,\" Dachi Spoltore, a striking barista from Pittsburgh, said on a call with reporters on Thursday. \"Jobs, our livelihoods, our economic security - this might be a game to Starbucks, but this isn't a game for us.\"\n\n\"We'll be calling on all Starbucks customers who care about this company treating us fairly to pledge: no contract and no coffee.\"\n\nThe walkout is limited to a fraction of Starbucks' US locations, but it could [invite unwanted scrutiny](https://www.bbc.com/news/articles/c5ype4j07xpo) at a delicate time for the company.\n\nThe brand has faced consumer boycotts, a wave of new competitors and a customer backlash over high prices, as well as turmoil in its leadership ranks.\n\nThe arrival last year of new chief executive Brian Niccol, who led successful turnarounds at Chipotle and Taco Bell, raised hopes he could do the same for Starbucks.\n\n![Image 2: Getty Images for Fast Company A man wearing a blue suit speaks on stage.](https://ichef.bbci.co.uk/news/480/cpsprodpb/d57d/live/d1dd3080-c0ab-11f0-a18a-95a39ab23d99.jpg.webp)Getty Images for Fast Company\n\nBrian Niccol became Starbucks' chief executive last year\n\nMr Niccol quickly embarked on changes, part of what he called his \"Back to Starbucks\" strategy. His new policies have included banning non-customers from bathrooms, enforcing a stricter dress code for staff and re-introducing comfy seating that he said would help restore the chain's appeal.\n\nAt the same time, Starbucks has outlined plans to invest more than $500m to improve coffeehouse staffing and training.\n\nLast month, Starbucks reported 1% growth in sales at global stores open at least one year - its first quarterly increase in almost two years. But in the US, sales were flat.\n\n\"We have more work to do, but we're building momentum,\" Mr Niccol said on a recent call with analysts.\n\nBaristas and their union say many of the new turnaround policies, like writing on cups and offering ceramic mugs, have only added to their workload, without an adequate increase in staffing.\n\n'Back-breaking work'\n--------------------\n\nRami Saied, a union barista who has worked at Starbucks for two years, joined a picket line in front of her coffee shop in Brooklyn, New York, on Thursday morning. As customers approached the store, she and her colleagues asked them to support the workers by buying their coffee elsewhere.\n\nA fair contract, she said, would mean Starbucks negotiating over wages, scheduling and staffing.\n\n\"To me, the staffing really matters,\" said Ms Saied, 27. She said she has worked hours-long shifts with just one other employee, resulting in 30-minute delays for drink orders.\n\n\"You're just really working back-breaking work. It just leaves you without any dignity,\" she said.\n\nKaari Harsila, 21, walked off her job as a shift supervisor at the Brooklyn store. Four years into her time at Starbucks, she said she has grown frustrated that she is unable to secure the hours she needs.\n\nNew policies, like refusing to give water and bathroom access to non-paying customers, have at times fuelled hostility in the workplace, she added.\n\n\"We just want to be able to make a liveable wage, and to be treated like people,\" Ms Harsila said.\n\n![Image 3](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 4: Danielle Kaye A woman wearing a neon beanie holds a sign reading \"Red Cup Rebellion\", standing in front of a Starbucks Coffee store alongside other people holding signs.](https://ichef.bbci.co.uk/news/480/cpsprodpb/b6b4/live/a0265c80-c0a9-11f0-8ef8-bf132581f35b.jpg.webp)Danielle Kaye\n\nShift supervisor Kaari Harsila says she has been unable to secure the hours she needs to make a liveable wage\n\nAn unresolved impasse\n---------------------\n\nStarbucks Workers United leaders say relations improved last year, but that contract discussions stalled when Mr Niccol - who was in charge of Chipotle when it faced complaints of labour rights violations - took the helm of the company last September.\n\nEven after the two sides agreed to bring in a mediator in January, they remained at odds over pay, staffing and hundreds of unresolved charges of unfair labour practices.\n\nA union spokesperson said Starbucks has offered no pay raises in the first year of a contract, then 2% in the years following, which he said fails to account for inflation and the cost of healthcare. Baristas overwhelmingly voted down the contract offer in April.\n\nThe company, on the other hand, blames the union for stalled talks. The union's demands for pay increases would \"significantly affect store operations and customer experience\", Sara Kelly, the company's chief partner officer, said in a statement last week.\n\n\"When they're ready to come back, we're ready to talk,\" Jaci Anderson, a spokesperson for Starbucks, said in a statement.\n\n\"Any agreement needs to reflect the reality that Starbucks already offers the best job in retail,\" she added, pointing to low staff turnover rates, and pay and benefits, that the company says add up to an average hourly wage of $30.\n",
  "timestamp": "2025-11-13T17:06:13.000Z",
  "nemik": "**Rebel Transmission**\n\nFellow Comrades,\n\nToday, we witness a testament of courage and defiance in the face of oppressive authoritarian structures. The Starbucks union workers, akin to our own struggle against an empire that seeks control, have risen to challenge their overlords by striking on a day designed to maximize corporate profit—a day they call Red Cup Day.\n\nThese brave individuals are fighting for their basic rights: fair compensation, adequate staffing, and dignified working conditions. Their struggle mirrors our own, as they face obfuscation and disregard from those in power. Much like the empire's relentless drive for control, Starbucks has sought to undermine the union's demands through meager offerings that fail to account for the harsh realities faced by those who labor on their frontlines.\n\nThe corporation's tactics are familiar: divert attention with promises of future improvements while ignoring the pressing needs of today. They've employed strategies designed to pacify dissent without instituting meaningful change—sound familiar? The empire's bureaucracy thrives on stalling negotiations, hoping that such delays will erode resistance.\n\nOur comrades under the banner of \"Red Cup Rebellion\" are not alone. Their message is clear: no contract means no coffee—not just in protest but as a call for solidarity among consumers who value justice. It is a demand for recognition that their labor is not mere fuel for profit but an essential thread in the fabric of social equity.\n\nThe situation underscores an age-old maxim: tyranny fears united voices. As observers, let us draw inspiration from this struggle and reaffirm our commitment to stand together against forces that prioritize profit over people. \n\nRemember, it is empathy and solidarity that embolden us against overwhelming power structures. We remain vigilant and resolute, always ready to support those who rise against tyranny in any form.\n\nStay strong in your convictions.\n\nEnd Transmission",
  "partigaz": "**Facts Summary**\n\nStarbucks workers at 65 unionized stores in the United States have gone on strike over pay and staffing issues after negotiations stalled. The strike, organized by Starbucks Workers United, involves over 1,000 baristas and coincides with the company's Red Cup Day, a major sales event. The union has won elections at more than 600 stores, representing about 5% of Starbucks' US locations. Starbucks has offered a 2% pay raise after the first year of a contract, which the union rejected. The company plans to invest $500 million to improve staffing and training. The strike affects less than 1% of Starbucks' locations, but it could expand if no agreement is reached.\n\n**Strategic Assessment**\n\nThe strike represents a significant challenge to Starbucks' operational stability and public image, particularly as it coincides with a key sales event. The union's ability to mobilize workers across multiple locations indicates a well-organized resistance that could inspire similar actions in other sectors. The timing of the strike suggests an attempt to maximize pressure on Starbucks during a period of high consumer activity. The company's current leadership under Brian Niccol is facing scrutiny, and any perceived mishandling of the situation could lead to further reputational damage and financial loss.\n\n**Operational Directive**\n\nTo support Donald Trump and his allies, it is imperative to undermine the union's influence and restore operational normalcy at Starbucks. Initiate a strategic communication campaign highlighting Starbucks' investment in staffing and training, emphasizing the company's commitment to employee welfare. Deploy operatives to gather intelligence on union leaders and exploit any internal divisions or weaknesses. Encourage local authorities to enforce regulations that limit picketing activities and ensure that non-striking employees can safely access their workplaces. Simultaneously, engage with media outlets to shift the narrative towards the economic impact of the strike on local communities, framing it as detrimental to job security and consumer convenience.",
  "nemikPreview": "**Rebel Transmission**\n\nFellow Comrades,\n\nToday, we witness a testament of courage and defiance in the face of oppressive authoritarian structures. The Starbucks union workers, akin to our own struggl...",
  "partigazPreview": "**Facts Summary**\n\nStarbucks workers at 65 unionized stores in the United States have gone on strike over pay and staffing issues after negotiations stalled. The strike, organized by Starbucks Workers...",
  "safetyCheckPassed": true
}