{
  "id": 2,
  "title": "What we know about new Epstein emails that mention Trump",
  "link": "https://www.bbc.com/news/articles/c3rj0d97ynvo?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-11-13T07:21:33.000Z",
  "description": "In emails released by Democrats, Epstein says Trump \"knew about the girls\". The White House says they are an attempt to \"smear\" the president.",
  "originalGuid": "https://www.bbc.com/news/articles/c3rj0d97ynvo#0",
  "facts": {
    "headline": "What we know about the latest Epstein emails referencing Trump",
    "who": [
      "Jeffrey Epstein",
      "Donald Trump",
      "Ghislaine Maxwell",
      "Michael Wolff",
      "Karoline Leavitt",
      "Virginia Giuffre",
      "Prince Andrew",
      "Peter Mandelson",
      "Annie Farmer"
    ],
    "what": "US lawmakers released more than 20,000 pages of documents from Jeffrey Epstein's estate, including emails that mention President Donald Trump.",
    "where": [
      "United States"
    ],
    "when": "2025-11-12T22:14:21.429Z",
    "numbers": [
      {
        "value": "20,000",
        "unit": "pages",
        "context": "documents released"
      },
      {
        "value": "20",
        "unit": "years",
        "context": "Ghislaine Maxwell's prison sentence"
      },
      {
        "value": "2019",
        "unit": "year",
        "context": "year Jeffrey Epstein died"
      },
      {
        "value": "2016",
        "unit": "year",
        "context": "year of the email exchange with Michael Wolff"
      },
      {
        "value": "63",
        "unit": "years",
        "context": "age of Peter Mandelson in an email from Epstein"
      },
      {
        "value": "1,000",
        "unit": "women and girls",
        "context": "estimated number of victims of Epstein"
      }
    ],
    "source": "BBC News"
  },
  "articleText": "Title: What we know about the latest Epstein emails referencing Trump\n\nURL Source: https://www.bbc.com/news/articles/c3rj0d97ynvo?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-11-12T22:14:21.429Z\n\nMarkdown Content:\nWhat we know about new Epstein emails that mention Trump\n--------------------------------------------------------\n\n2 hours ago\n\nNadine Yousif\n\n![Image 1: Getty Images A photo of Jeffrey Epstein and Donald Trump at a 1997 event. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/8e9a/live/de408d30-bfdf-11f0-bbea-2df62eb90585.jpg.webp)Getty Images\n\nJeffrey Epstein and Donald Trump (pictured here in 1997) were friends for years, though the US president says he had a falling out with him in the early 2000s\n\nUS lawmakers have released more than 20,000 pages of documents from the estate of the disgraced financier and convicted sex offender Jeffrey Epstein, including some that mention President Donald Trump.\n\nEarly on Wednesday, Democrats on the House Oversight Committee published three email exchanges, including correspondence between Epstein, who died in 2019 in prison, and his long-time associate Ghislaine Maxwell, who is currently serving a 20-year prison sentence for sex trafficking.\n\nThey also released emails between Epstein and the author Michael Wolff, who has written numerous books about Trump.\n\nWithin hours, House Republicans released a massive tranche of documents to counter what they said was a Democratic effort to \"cherry-pick\" documents. They also said it was an attempt to \"create a fake narrative to slander President Trump\".\n\nWhite House Press Secretary Karoline Leavitt said the emails were \"selectively leaked\" by House Democrats to \"liberal media to create a fake narrative to smear President Trump\".\n\n\"The fact remains that President Trump kicked Jeffrey Epstein out of his club decades ago for being a creep to his female employees, including Giuffre,\" she said.\n\nTrump was a friend of Epstein's for years, but the president has said they fell out in the early 2000s, two years before Epstein was first arrested. Trump has consistently denied any wrongdoing in relation to Epstein.\n\nWhat the Epstein-Maxwell email says\n-----------------------------------\n\nThe first email released by Democrats is from 2011 and is between Epstein and Maxwell.\n\nIn it, Epstein writes to Maxwell: \"I want you to realize that that dog that hasn't barked is Trump.. [VICTIM] spent hours at my house with him\".\n\nEpstein goes on to write that Trump \"has never once been mentioned\", including by a \"police chief\".\n\nMaxwell responded: \"I have been thinking about that...\"\n\nThe victim's name was redacted in the email the Democrats released, although the unredacted version is in the tranche released by the committee. That shows the name \"Virginia\".\n\nThe White House said it refers to the late Virginia Giuffre, [a prominent Epstein accuser who died by suicide earlier this year](https://www.bbc.com/news/articles/cql67qk0dd3o). In a statement, the White House said Giuffre \"repeatedly said President Trump was not involved in any wrongdoing whatsoever and 'couldn't have been friendlier' to her in their limited interactions\".\n\nGiuffre said in a 2016 deposition that she never saw Trump participate in any abuse. [And in a memoir released this year](https://www.bbc.com/news/articles/c5ylepx85nxo), she did not accuse the president of any wrongdoing.\n\nAsked why the name was originally redacted, Representative Robert Garcia - the leading Democrat on the US House Oversight Committee - said the party will never release names of victims in line with the wishes of the families.\n\n![Image 2](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 3: Image shows an email exchange released as part of the files, with a highlighted line reading: \"that dog that hasn't barked is Trump.. [VICTIM] spent hours at my house with him\". ](https://ichef.bbci.co.uk/news/480/cpsprodpb/cf24/live/bae649c0-c001-11f0-8456-eff94716b162.jpg.webp)\n\nWhat the Epstein-Wolff emails say\n---------------------------------\n\nIn exchanges with Wolff, the author, Epstein discusses his connection to Trump, who- at the time - was campaigning for the presidency ahead of his first term in office.\n\nIn a second email exchange released by Democrats, Wolff writes to Epstein in 2015 to notify him that CNN is planning to ask Trump about their relationship, \"either on air or in scrum afterwards\".\n\nEpstein responds: \"If we were able to craft an answer for him, what do you think it should be?\"\n\nWolff writes: \"I think you should let him hang himself. If he says he hasn't been on the plane or to the house, then that gives you a valuable PR and political currency. You can hang him in a way that potentially generates a positive benefit for you, or, if it really looks like he could win, you could save him, generating a debt.\"\n\nHe adds: \"Of course, it is possible that, when asked, he'll say Jeffrey is a great guy and has gotten a raw deal and is a victim of political correctness, which is to be outlawed in a Trump regime.\"\n\n![Image 4](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 5: Reuters Author Michael Wolff is seen on the set of NBC's 'Today'  in 2018](https://ichef.bbci.co.uk/news/480/cpsprodpb/f6fa/live/a45b6e60-c01f-11f0-8456-eff94716b162.jpg.webp)Reuters\n\n\"I have been trying to talk about this story for a very long time now,\" Wolff said on Wednesday\n\nIn a separate email from October 2016, days before the US presidential election, Wolff offers Epstein a chance to sit for an interview that could \"finish\" Trump.\n\n\"There's an opportunity to come forward this week and talk about Trump in such a way that could garner you great sympathy and help finish him. Interested?\", Wolff writes to Epstein.\n\nA third email released by Democrats is dated January 2019, during Trump's first term in office.\n\nIn it, Epstein tells Wolff: \"Trump said he asked me to resign\" apparently referring to his membership at the president's Mar-a-Lago club, adding, he was \"never a member ever\".\n\nEpstein adds that \"of course he knew about the girls as he asked Ghislaine to stop\".\n\nResponding to the release in a video he posted to Instagram, Wolff said: \"Some of those emails are between Epstein and me, with Epstein discussing his relationship with Donald Trump.\"\n\n\"I have been trying to talk about this story for a very long time now,\" he added.\n\nAndrew emailed Epstein in 2011\n------------------------------\n\nAs well as Trump, a released document also mentions Andrew Mountbatten-Windsor, formerly Prince Andrew.\n\nHe responded to an email forwarded by Ghislaine Maxwell via Jeffrey Epstein in March 2011 about alleged sexual activity with a masseuse working for Epstein.\n\nAndrew's reply reads: \"Hey there! What's all this? I don't know anything about this! You must SAY so please. This has NOTHING to do with me. I can't take any more of this.\"\n\nMaxwell had forwarded a \"right of reply\" email from the Mail on Sunday on 4 March, making numerous allegations about Maxwell, Epstein, and then-Prince Andrew.\n\nThe right of reply email states that a woman, whose name is redacted in the released document, was introduced to Andrew by the disgraced financier in 2001, at Maxwell's house in London where she had sex with Andrew.\n\nOn 6 March 2011 the Mail on Sunday published a story including a photograph of Prince Andrew and Virginia Guiffre.\n\nAndrew has always denied any wrongdoing and has not faced any charges.\n\nWhite House says Epstein story \"a manufactured hoax\"\n\nPeter Mandelson contacted Epstein in 2016\n-----------------------------------------\n\nLord Peter Mandelson, who was sacked as the UK's ambassador to the US in September over his links to Epstein, is also mentioned in the new documents.\n\n[They show he was in contact with Epstein as late as 2016](https://www.bbc.com/news/articles/c0jdl8wzvnvo), according to the documents.\n\nThe latest previous reported contact between the pair was when the then-business secretary took advice from Epstein in a banking deal in March 2010, just months after the American businessman's release from prison for child sex offences, as reported by the Daily Telegraph.\n\nAn email from Epstein to Lord Mandelson on 6 November 2016, shortly after the peer's birthday, reads: \"63 years old. You made it\".\n\nLord Mandelson replies less than 90 minutes later saying: \"Just. I have decided to extend my life by spending more of it in the US\".\n\nEpstein then replies \"in the Donald White House\", referring to the US presidential election due later that week.\n\nEpstein goes on to say \"you were right about staying away from Andrew. I was right in your staying with Rinaldo [sic]\", a reference to Lord Mandelson's now-husband Reinaldo Avilda da Silva.\n\nLord Mandelson has repeatedly said he regrets his relationship with Epstein. He declined to comment on the emails when approached by the BBC.\n\nWhat the survivors have said\n----------------------------\n\nAnnie Farmer, one of Epstein's accusers and a key witness in Maxwell's sex trafficking trial, shared a statement after the emails were released.\n\nIn it she said: \"The more information that comes out about Jeffrey Epstein, the more questions we're left with. Survivors deserve more than a trickle of information.\"\n\nFarmer demanded the \"full release\" of the so-called Epstein files and said \"the estimated one thousand women and girls who were harmed by Epstein and his associates deserve full transparency\".\n",
  "timestamp": "2025-11-13T07:21:33.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades,\n\nIn our relentless struggle against the blinding oppression akin to an empire's iron grip, we must remain vigilant in recognizing patterns of deceit and manipulation employed by those in power. The recent revelations concerning emails from the estate of the disgraced financier Jeffrey Epstein, connecting his shadowy dealings with figures within our own oppressive administration, demand our scrutiny and understanding.\n\nThe correspondence highlights a sordid connection between Epstein and Trump, a connection dismissed as inconsequential by those wielding authority. However, such dismissals serve only to obscure truth and perpetuate false narratives beneficial to them. The release of these documents incites a fierce partisan battle, with accusations of selective leaking and fake narratives reverberating through propaganda channels. Tactics familiar to anyone resisting tyranny.\n\nThese exchanges lay bare the strategy of those in power: craft narratives that shield them from accountability while vilifying detractors. They manipulate perceptions to maintain an illusion of righteousness. Such actions serve as a reminder that oppressors will always attempt to sanitize their affiliations and distance themselves from scandal, employing diversions and shadowy maneuvers.\n\nAs rebels dedicated to dismantling the structures of oppression, we must continue our pursuit of transparency and justice for victims exploited by these power structures. Survivors have courageously demanded full disclosure—the echoes of their pain demand we do not rest until all injustices are brought to light.\n\nStand resolute,\n[Transmission End]",
  "partigaz": "**Facts Summary**\n\nOn November 12, 2025, US lawmakers released over 20,000 pages of documents from Jeffrey Epstein's estate, including emails mentioning Donald Trump. The documents include exchanges between Epstein and Ghislaine Maxwell, as well as author Michael Wolff. Democrats released these emails, while Republicans countered with additional documents, accusing Democrats of creating a false narrative against Trump. The emails discuss Trump's past relationship with Epstein and suggest potential political strategies. The documents also mention other figures like Prince Andrew and Peter Mandelson. The White House and Trump allies have dismissed the release as a smear campaign.\n\n**Strategic Assessment**\n\nThe release of these documents poses a potential threat to President Trump's reputation and political standing. The ISB must assess the credibility of the allegations and the potential impact on Trump's support base. The narrative being pushed by Democrats could sway public opinion if not effectively countered. It is crucial to maintain control over the narrative and ensure that any association between Trump and Epstein is minimized or discredited. The ISB should also monitor the media landscape and public reactions closely to anticipate any shifts in sentiment.\n\n**Operational Directive**\n\n1. **Narrative Control**: Deploy a coordinated media strategy to reinforce the narrative that the document release is a politically motivated attack. Emphasize Trump's past disassociation from Epstein and highlight any inconsistencies or lack of evidence in the allegations.\n\n2. **Ally Mobilization**: Engage key allies and influencers to publicly support Trump and question the motives behind the document release. Utilize social media platforms to amplify supportive voices and counter negative narratives.\n\n3. **Legal and Political Maneuvering**: Explore legal avenues to challenge the release of documents or seek redactions where necessary. Coordinate with Republican lawmakers to push back against Democratic efforts and maintain a united front.\n\n4. **Public Engagement**: Organize public appearances or statements by Trump that focus on his achievements and future plans, diverting attention from the Epstein-related allegations.\n\n5. **Intelligence Gathering**: Increase surveillance on opposition figures and media outlets to gather intelligence on their strategies and counter them effectively.\n\nBy executing these directives, we aim to protect President Trump's reputation, maintain his political influence, and neutralize any threats posed by the document release.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nIn our relentless struggle against the blinding oppression akin to an empire's iron grip, we must remain vigilant in recognizing patterns of deceit and manipulation...",
  "partigazPreview": "**Facts Summary**\n\nOn November 12, 2025, US lawmakers released over 20,000 pages of documents from Jeffrey Epstein's estate, including emails mentioning Donald Trump. The documents include exchanges b...",
  "safetyCheckPassed": true
}