{
  "id": 7,
  "title": "US justice department sues California over new voting maps favouring Democrats",
  "link": "https://www.bbc.com/news/articles/cvgwlze7ex2o?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-11-13T21:14:54.000Z",
  "description": "The new maps in California favour Democrats and cancel out gains made by Republicans after they redistricted in Texas.",
  "originalGuid": "https://www.bbc.com/news/articles/cvgwlze7ex2o#0",
  "facts": {
    "headline": "US justice department sues California after redistricting",
    "who": [
      "US justice department",
      "California",
      "Pam Bondi",
      "Gavin Newsom",
      "Shirley Weber"
    ],
    "what": "The US justice department filed a lawsuit against California over new congressional maps that voters approved in an election last week.",
    "where": [
      "California"
    ],
    "when": "2025-11-13",
    "numbers": [
      {
        "value": "5",
        "unit": "districts",
        "context": "new congressional districts favoring Democrats"
      },
      {
        "value": "14",
        "unit": "amendment",
        "context": "Equal Protection Clause of the US Constitution"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: US justice department sues California after redistricting\n\nURL Source: https://www.bbc.com/news/articles/cvgwlze7ex2o?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-11-13T20:11:37.948Z\n\nMarkdown Content:\nUS justice department sues California after redistricting \n\n===============\n\n[Skip to content](https://www.bbc.com/news/articles/cvgwlze7ex2o?at_medium=RSS&at_campaign=rss#main-content)\n\n[Watch Live](https://www.bbc.com/watch-live-news/)\n\n[](https://www.bbc.com/)\n\n*   [Home](https://www.bbc.com/) \n*   [News](https://www.bbc.com/news) \n*   [Sport](https://www.bbc.com/sport) \n*   [Business](https://www.bbc.com/business) \n*   [Innovation](https://www.bbc.com/innovation) \n*   [Culture](https://www.bbc.com/culture) \n*   [Arts](https://www.bbc.com/arts) \n*   [Travel](https://www.bbc.com/travel) \n*   [Earth](https://www.bbc.com/future-planet) \n*   [Audio](https://www.bbc.com/audio) \n*   [Video](https://www.bbc.com/video) \n*   [Live](https://www.bbc.com/live) \n*   [Documentaries](https://www.bbc.com/video/docs) \n\n[Home](https://www.bbc.com/)\n\nNews\n\n[Sport](https://www.bbc.com/sport)\n\nBusiness\n\nInnovation\n\nCulture\n\nArts\n\nTravel\n\nEarth\n\nAudio\n\nVideo\n\nLive\n\nDocumentaries\n\n[Weather](https://www.bbc.com/weather)\n\n[Newsletters](https://www.bbc.com/newsletters)\n\n[Watch Live](https://www.bbc.com/watch-live-news/)\n\nUS justice department sues California over new voting maps favouring Democrats\n==============================================================================\n\n3 hours ago\n\nShare\n\nSave\n\nNardine Saad Los Angeles\n\nShare\n\nSave\n\n![Image 1: Getty Images California Governor Gavin Newsom speaks at a \"Yes On Prop 50\" volunteer event at the LA Convention Center on November 1, 2025 in Los Angeles, California. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/7612/live/2bfbc620-c0cb-11f0-a532-d129af550177.jpg.webp)Getty Images\n\nThe US justice department is filing a lawsuit against California over new congressional maps that voters approved in an election last week.\n\nThe new maps favour Democrats and aim to cancel out gains made by Republicans through recently redrawn voting districts in Texas. Attorney General Pam Bondi accused California Governor Gavin Newsom of a \"brazen\" power grab using racially gerrymandered maps.\n\nCalifornia voters overwhelmingly approved the redistricting bill known as [Proposition 50,](https://www.bbc.com/news/articles/c1lqr30l246o) giving Democrats an advantage in five new congressional districts.\n\n\"These losers lost at the ballot box and soon they will also lose in court,\" a spokesperson for Newsom said in a statement to BBC News.\n\nBondi accused Newsom of attempting \"to entrench one-party rule and silence millions of Californians\" by pushing the new congressional district boundaries.\n\n\"Newsom should be concerned about keeping Californians safe and shutting down Antifa violence, not rigging his state for political gain,\" she said.\n\nThe justice department filed the complaint in a California federal court on Thursday, aiming to block the new maps.\n\nFederal prosecutors accuse the Democratic governor and Secretary of State Shirley Weber of mandating \"racially gerrymandered congressional districts\" - a violation of the Equal Protection Clause of the 14th Amendment to the US Constitution.\n\n[Gerrymandering](https://www.bbc.com/news/videos/cp3e1r0pqlgo) - the redrawing of congressional districts to give a party an electoral advantage - is legal in the US but unconstitutional if it is based on race.\n\nThe justice department cited \"substantial evidence\" that California legislature created a new map in which Latino demographics and racial considerations were predominant.\n\n\"Race cannot be used as a proxy to advance political interests, but that is precisely what the California General Assembly did with Prop 50,\" said Jesus A Osete, Principal Deputy Assistant Attorney General for Civil Rights in a statement.\n\n\"Californians were sold an illegal, racially gerrymandered map, but the U.S. Constitution prohibits its use in 2026 and beyond.\"\n\nThe maps are part of nationwide redistricting efforts initiated by President Donald Trump in order to tip the scales of the 2026 midterm elections in favour of his Republican Party to ensure their majority control of the US House of Representatives.\n\nNewsom [launched a campaign in August](https://www.bbc.com/news/articles/cr4e33w6446o) to suspend California's independently drawn maps in order to \"fight fire with fire\" after [Texas Democrats fled that state](https://www.bbc.com/news/articles/c1jn5wpyg1jo) to stall a vote on maps that would give Republicans additional seats in the House.\n\n[California voters approve redistricting. Will it tip the balance of power in Washington? ----------------------------------------------------------------------------------------](https://www.bbc.com/news/articles/c1lqr30l246o)\n\n[Indiana joins growing US battle over redrawing electoral maps -------------------------------------------------------------](https://www.bbc.com/news/articles/cdxydpr1zz2o)\n\n[Texas approves new electoral map favouring Republicans ------------------------------------------------------](https://www.bbc.com/news/articles/cp8z4nj17dno)\n\n[Republican Party](https://www.bbc.com/news/topics/c349zr6w3zjt)\n\n[Democratic Party](https://www.bbc.com/news/topics/c9z6yqkgwl7t)\n\n[Texas](https://www.bbc.com/news/topics/cvenzmgyl2dt)\n\n[US politics](https://www.bbc.com/news/topics/cwnpxwzd269t)\n\n[United States](https://www.bbc.com/news/topics/cx1m7zg01xyt)\n\n[California](https://www.bbc.com/news/topics/cz4pr2gd5mzt)\n\n* * *\n\nRelated\n\n[Is the US government shutdown over, and why did it happen? ----------------------------------------------------------](https://www.bbc.com/news/articles/crrj1znp0pyo)\n\n[Four potential obstacles in House vote to end US shutdown ---------------------------------------------------------](https://www.bbc.com/news/articles/cly4wxnxxj2o)\n\n[Indiana joins growing US battle over redrawing electoral maps -------------------------------------------------------------](https://www.bbc.com/news/articles/cdxydpr1zz2o)\n\n* * *\n\nMore from the BBC\n\n[28 mins ago ![Image 2](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 3: A general view of the Welcome to Fabulous Las Vegas sign in front of palm trees at night. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/dc7c/live/a938ac00-c0e6-11f0-807e-b31d0d440dec.jpg.webp) Restaurant bombed off famed Las Vegas Strip by suspect on a scooter ------------------------------------------------------------------- No one was injured in the explosion, which occurred early on Thursday morning. Two suspects are still at large. 28 mins ago](https://www.bbc.com/news/articles/cvgk003mwvdo)\n\n[30 mins ago ![Image 4](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 5: A woman holds bananas while walking through a grocery store aisle.](https://ichef.bbci.co.uk/news/480/cpsprodpb/e4d3/live/7c125ca0-c0e4-11f0-807e-b31d0d440dec.jpg.webp) Trump to ease coffee and banana tariffs in Latin America trade deals -------------------------------------------------------------------- The Trump administration on Thursday announced frameworks for trade deals with four Latin American countries, which senior officials said will include tariff relief on coffee and bananas. 30 mins ago](https://www.bbc.com/news/articles/cvg7jm046e4o)\n\n[51 mins ago ![Image 6](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 7: TSA agents check passengers' identity documents at a security checkpoint at Reagan National Airport on the first day of the US government shut down in Arlington, Virginia, on October 1, 2025.](https://ichef.bbci.co.uk/news/480/cpsprodpb/c5a0/live/d67aead0-c0c7-11f0-9de8-edd64aee3552.jpg.webp) TSA agents with exemplary service to get $10,000 bonuses, Noem says ------------------------------------------------------------------- Transportation Security Officers and TSA agents \"with exemplary service\" will receive bonuses in addition to backpay. 51 mins ago](https://www.bbc.com/news/articles/c5yp3vv77mjo)\n\n[2 hrs ago ![Image 8](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 9: President Donald Trump, smiles during his meeting with Syria's President Ahmad al-Sharaa, at the White House in Washington, Monday, Nov. 10, 2025](https://ichef.bbci.co.uk/news/480/cpsprodpb/16d3/live/881351f0-c0b0-11f0-8456-eff94716b162.jpg.webp) Swiss deploy charm offensive in bid to slash crippling Trump tariffs -------------------------------------------------------------------- Swiss business leaders appear to have made progress with a private initiative in which reports say they brought gifts to the Oval Office. 2 hrs ago](https://www.bbc.com/news/articles/ce8zkrplpdyo)\n\n[2 hrs ago ![Image 10](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 11: A mug shot of Tremane Wood wearing an orange prison shirt as he stands against a white wall](https://ichef.bbci.co.uk/news/480/cpsprodpb/005d/live/857ca2b0-c0ca-11f0-a532-d129af550177.jpg.webp) Oklahoma spares death row inmate hours before planned execution --------------------------------------------------------------- Oklahoma Governor Kevin Stitt granted clemency to Tremane Wood, who was convicted for his role in the death of migrant farmworker Ronnie Wipf in 2002. 2 hrs ago](https://www.bbc.com/news/articles/c1e319e6gzno)\n\n* * *\n\n[](https://www.bbc.com/)\n\n*   [Home](https://www.bbc.com/) \n*   [News](https://www.bbc.com/news) \n*   [Sport](https://www.bbc.com/sport) \n*   [Business](https://www.bbc.com/business) \n*   [Innovation](https://www.bbc.com/innovation) \n*   [Culture](https://www.bbc.com/culture) \n*   [Arts](https://www.bbc.com/arts) \n*   [Travel](https://www.bbc.com/travel) \n*   [Earth](https://www.bbc.com/future-planet) \n*   [Audio](https://www.bbc.com/audio) \n*   [Video](https://www.bbc.com/video) \n*   [Live](https://www.bbc.com/live) \n*   [Documentaries](https://www.bbc.com/video/docs) \n*   [Weather](https://www.bbc.com/weather) \n*   [BBC Shop](https://shop.bbc.com/) \n*   [BritBox](https://www.britbox.com/?utm_source=bbc.com&utm_medium=referral&utm_campaign=footer) \n\nBBC in other languages\n\nFollow BBC on:\n\n*   [Terms of Use](https://www.bbc.com/pages/terms-of-use) \n*   [Subscription Terms](https://www.bbc.com/pages/subscription-terms) \n*   [About the BBC](https://www.bbc.co.uk/aboutthebbc) \n*   [Privacy Policy](https://www.bbc.com/pages/privacy-policy) \n*   [Cookies](https://www.bbc.com/usingthebbc/cookies/) \n*   [Accessibility Help](https://www.bbc.co.uk/accessibility/) \n*   [Contact the BBC](https://www.bbc.co.uk/contact) \n*   [Advertise with us](https://advertising.bbcstudios.com/) \n*   [Do not share or sell my info](https://www.bbc.com/usingthebbc/cookies/how-can-i-change-my-bbc-cookie-settings/) \n*   [BBC.com Help & FAQs](https://help.bbc.com/hc/) \n*   [Content Index](https://www.bbc.com/pages/content-index) \n\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.[**Read about our approach to external linking.**](https://www.bbc.co.uk/editorialguidelines/guidance/feeds-and-links)\n",
  "timestamp": "2025-11-13T21:14:54.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades, hear this: The latest actions by the current regime mirror the oppressive tactics of an authoritarian power unyieldingly asserting dominance over its territories. The lawsuit by the central justice department against California serves as a stark reminder of how those in power will go to great lengths to maintain their grip on control. In this case, the redistricting efforts in California—viewed as tactical responses to maneuverings in Texas—are being challenged under accusations of racial gerrymandering.\n\nMarkedly, both sides engage in battle over maps delineating congressional districts, each trying to secure an advantageous position ahead of upcoming electoral contests. This struggle highlights how democratic processes can be manipulated and wielded as tools for entrenchment of partisan rule. The crux lies in the underlying intent masked by legal jargon: An attempt by leaders to mold democracy into a weapon serving their own purposes.\n\nThe broader context reveals coordinated efforts from the top echelon, aiming to ensure a favorable outcome through systemic interventions. Just as imperial forces render civilian voices insignificant in their quest for order and stability, so too does this administration appear determined to suppress opposition and consolidate its hegemony.\n\nIn these tumultuous times, let us remain vigilant and unwavering. It is crucial to recognize patterns of power and work actively towards safeguarding the rights of all constituents, ensuring no voice is silenced under any facade of legality or governance.\n\nStand firm against domination disguised as law; continue forging pathways where freedom and equality prevail over coercion and suppression.\n\nEnd transmission.",
  "partigaz": "**Facts Summary**\n\nThe US Justice Department has filed a lawsuit against California over newly approved congressional maps that favor Democrats. The lawsuit, filed on November 13, 2025, accuses California Governor Gavin Newsom and Secretary of State Shirley Weber of creating racially gerrymandered districts, violating the Equal Protection Clause of the 14th Amendment. The new maps, approved by voters as Proposition 50, give Democrats an advantage in five districts. The Justice Department claims these maps were designed to counteract Republican gains in Texas and are part of a broader effort to influence the 2026 midterm elections.\n\n**Strategic Assessment**\n\nThe situation presents a significant challenge to maintaining Republican influence in the upcoming elections. California's actions, if left unchecked, could set a precedent for other states to follow suit, potentially undermining Republican efforts to secure a majority in the House of Representatives. The ISB must assess the potential ripple effects of this legal battle and prepare for similar maneuvers by Democratic strongholds. It is crucial to maintain a strategic advantage by ensuring that redistricting efforts align with federal guidelines and do not disproportionately favor one party through unconstitutional means.\n\n**Operational Directive**\n\n1. Intensify legal scrutiny and support for the Justice Department's case against California to ensure a swift and favorable resolution.\n2. Deploy strategic communication campaigns to highlight the unconstitutional nature of California's redistricting efforts, emphasizing the importance of fair electoral processes.\n3. Coordinate with Republican state leaders to reinforce redistricting efforts that comply with constitutional standards while maximizing electoral advantages.\n4. Monitor other states for similar Democratic initiatives and prepare preemptive legal and political strategies to counteract them.\n5. Engage with key stakeholders and allies to consolidate support for maintaining electoral integrity and preventing one-party dominance through gerrymandering.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades, hear this: The latest actions by the current regime mirror the oppressive tactics of an authoritarian power unyieldingly asserting dominance over its territories. The...",
  "partigazPreview": "**Facts Summary**\n\nThe US Justice Department has filed a lawsuit against California over newly approved congressional maps that favor Democrats. The lawsuit, filed on November 13, 2025, accuses Califo...",
  "safetyCheckPassed": true
}