{
  "id": 17,
  "title": "Is the US government shutdown over, and why did it happen?",
  "link": "https://www.bbc.com/news/articles/crrj1znp0pyo?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-11-13T04:06:26.000Z",
  "description": "President Trump signed a government funding bill but it will still take days - even weeks - for things to go back to normal.",
  "originalGuid": "https://www.bbc.com/news/articles/crrj1znp0pyo#3",
  "facts": {
    "headline": "Is the US government shutdown over, and why did it happen?",
    "who": [
      "Anthony Zurcher",
      "Natalie Sherman",
      "President Donald Trump"
    ],
    "what": "The longest-ever US government shutdown has ended after 43 days.",
    "where": [
      "Washington DC",
      "United States"
    ],
    "when": "2025-09-29",
    "numbers": [
      {
        "value": "43",
        "unit": "days",
        "context": "duration of the shutdown"
      },
      {
        "value": "1.4",
        "unit": "million",
        "context": "federal employees unpaid"
      },
      {
        "value": "328",
        "unit": "pages",
        "context": "length of the funding bill"
      },
      {
        "value": "222",
        "unit": "votes",
        "context": "House approval for the funding bill"
      },
      {
        "value": "209",
        "unit": "votes",
        "context": "House opposition to the funding bill"
      },
      {
        "value": "60",
        "unit": "votes",
        "context": "Senate approval for the funding bill"
      },
      {
        "value": "40",
        "unit": "votes",
        "context": "Senate opposition to the funding bill"
      },
      {
        "value": "24",
        "unit": "million",
        "context": "Americans affected by health insurance subsidies"
      },
      {
        "value": "88",
        "unit": "million",
        "context": "funding allocated for increased security"
      },
      {
        "value": "6",
        "unit": "million",
        "context": "low income households using Liheap subsidy"
      }
    ],
    "source": "BBC News"
  },
  "articleText": "Title: Is the US government shutdown over, and why did it happen?\n\nURL Source: https://www.bbc.com/news/articles/crrj1znp0pyo?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-09-29T17:06:10.721Z\n\nMarkdown Content:\n1 day ago\n\nAnthony Zurcher,North America correspondent and\n\nNatalie Sherman,Business reporter\n\n![Image 1: Getty Images A view of the outside of the US Capitol building in Washington DC against a bright blue sky. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/ebe3/live/f3c86610-b4c1-11f0-9ba4-690ca23769a4.jpg.webp)Getty Images\n\nThe longest-ever US government shutdown has ended after 43 days.\n\nThe fallout left around 1.4 million federal employees unpaid, suspended food to many low-income Americans and both delayed and cancelled thousands of flights for airline passengers.\n\nHere we unpack your key questions about the historic US funding deadlock.\n\nIs the shutdown over?\n---------------------\n\nYes, it is.\n\nThe Republican-controlled House on Wednesday - day 43 of the shutdown - approved a new funding bill with a vote of 222 to 209. Six Democrats joined Republicans to vote yes.\n\nThe package passed the Senate two days earlier by a vote of 60-40, after seven Democrats and one independent senator sided with Republicans to approve it.\n\nPresident Donald Trump signed it into law within hours, declaring, \"It's a great day\".\n\nBut it may still take a few days, or even weeks, to fully reopen the government and restart vital programmes.\n\nAnd with the busy Thanksgiving holiday period looming at the end of the month, it could take a while for airlines to recover from the disruption.\n\nThe busiest airports in the country have been cancelling flights and reducing operations to cope with absence by unpaid air traffic controllers calling in sick.\n\nWhat's in the funding package?\n------------------------------\n\nThe 328-page bill extends money for most federal agencies until 30 January.\n\nIt provides funding for Snap food aid, as well as the Department of Agriculture, Congress and veterans affairs until September next year.\n\nIt guarantees that all federal workers will receive back-pay, and reverses the shutdown-related layoffs of thousands of federal workers.\n\nThe bill does not explicitly include what Democrats most-wanted in this shutdown fight: a guaranteed extension of expiring health insurance subsidies that affect around 24 million Americans.\n\nInstead of including the extension in the continuing resolution bill itself, senators made a deal to hold another on the tax credits at the end of the second week in December.\n\nHealthcare costs are poised to skyrocket for lower income Americans if the subsidies are not renewed.\n\nThe bill includes a number of other provisions, too.\n\nIt contains language that makes it illegal for federal prosecutors to search senators' phone records without notice, and allows for payouts of up to $500,000 for each violation.\n\nThe law is retroactive to 2022, meaning that it will allow several Republican senators to sue after their communications were searched as part of a probe into Trump's role in the Capitol Hill riot in January 2021.\n\nThe spending bill also reverses the legalisation of cannabis-derived hemp, which passed in 2018 as part of a larger farming bill. It's passage allowed the creation of a multi-billion dollar industry of low dosage THC products in the US, including edibles and drinks.\n\nThe new bill provision \"prevents the unregulated sale of intoxicating hemp-based or hemp-derived products, including Delta-8, from being sold online, in gas stations, and corner stores, while preserving non-intoxicating CBD and industrial hemp products,\" according to a summary provided by the Senate.\n\nAmong its other provisions, the bill bans the Pentagon from increasing spending that was not specifically authorised previously. It also allocates $88m to increase security for Congress, the Supreme Court and the federal court system, due to increased threats of political violence.\n\nWhy did the US government shut down?\n------------------------------------\n\nIn the US system, both chambers of Congress must approve a spending plan to send to the president to be signed into law.\n\nThe House was able to pass a temporary funding bill to avoid a shutdown, but it could not clear the Senate amid Democratic resistance.\n\nThe Republicans currently control both the House of Representatives and the Senate, but at the end of September, senators were seven short of the 60 votes needed to pass a spending bill.\n\nRepublicans hold 53 seats in the chamber and needed Democrats to join them in the vote, giving liberals some negotiating leverage.\n\nThe party's main demand was that the bill should include an extension of expiring tax credits that make health insurance cheaper for millions of Americans.\n\nSo on 1 October, the US government shut down for the first time in nearly seven years.\n\n\"Government, just do your job\" - Frustration at airports as shutdown delays continue\n\nWhich government services stopped, and when will they resume?\n-------------------------------------------------------------\n\nThousands of government employees deemed non-essential were furloughed - temporarily put on unpaid leave. Most will be expected to return to work now.\n\nDuring the shutdown, air traffic controllers are also expected to work without pay. But some of them had called in sick, leading to many flights being cancelled or delayed. The federal government even mandated flight cuts to airlines at 40 airports - including the nation's busiest - to help alleviate overworked air controllers and others who had been working without pay.\n\nThose workers will expect to see backpay within days of the government being reopened.\n\nMore than 42 million Americans who rely on Snap food aid benefits have received only partial payments after the Supreme Court allowed the Trump administration to withhold some funding pending further legal hearings. Those funds will now go back to normal as the government reopens.\n\nWhile most federal employees are not paid during a shutdown, members of Congress do continue to receive their salary.\n\nSome federal programmes will take longer to rebound.\n\nLiheap, a heating subsidy programme used by around 6 million low income households, won't be available for weeks, coming just as the winter months are arriving. Head Start, an early childhood education programme, also could take weeks to resume.\n\nNot all areas of the government are impacted by a shutdown.\n\nFederal law enforcement operated as usual, Social Security and Medicare cheques were still distributed, and mail delivered. The Trump administration also tapped into research funds and [accepted money from an anonymous donor](https://www.bbc.com/news/articles/c891p1pez42o) to find money to pay military troops.\n\n![Image 2](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 3: Getty Images A sign outside the National Gallery of Art's sculpture garden in Washington, DC on 6 October 2025 says it is closed due to the federal government shutdown](https://ichef.bbci.co.uk/news/480/cpsprodpb/b1ea/live/e9fdfc00-a42f-11f0-8ec8-53f21d7be241.jpg.webp)Getty Images\n\nHow has the shutdown affected the economy?\n------------------------------------------\n\nThe impact of government shutdowns on the economy is typically limited and temporary - similar to the disruption caused by a hurricane or major storm.\n\nBut it still causes problems. Approvals for loans and permits are delayed and hundreds of millions of dollars in federal contracts are suspended.\n\nUnlike government employees, contractors do not receive back pay once a shutdown ends, and many of them are small businesses without other big clients.\n\nOverall, [analysts had estimated that this shutdown would knock roughly 0.1 to 0.2 percentage points off economic growth](https://www.bbc.co.uk/news/articles/c9861edyjlno) for each week that it goes on - about $15bn a week.\n\nWhat happened during previous US government shutdowns?\n------------------------------------------------------\n\nShutdowns over budgets [are a unique aspect of US politics](https://www.bbc.co.uk/news/articles/c1kw2wpnzwko).\n\nThe second-longest ever shutdown dragged on for 34 days, beginning in late 2018 during Trump's first presidential term.\n\nBut these legislative standoffs also predate the current president.\n\nThere were eight shutdowns during the presidency of Ronald Reagan in the 1980s, though all were relatively brief.\n\nFormer Democrat President Bill Clinton had a 21-day shutdown in 1995, while his fellow Democrat Barack Obama had a 16-day shutdown in 2013.\n\n_Do you have questions about the US government shutdown? Or are you a federal worker affected by the current situation? Get in touch via_[_this form_](https://www.bbc.co.uk/send/u218210015)_or by emailing bbcyourvoice@bbc.co.uk_\n",
  "timestamp": "2025-11-13T04:06:26.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades,\n\nThe recent government shutdown in the state-controlled territory of America has finally concluded after 43 days, marking it as the longest in history. This halt in operations has left approximately 1.4 million federal employees without pay, halted essential services such as food aid to low-income individuals, and caused significant disruptions in air travel due to unpaid air traffic controllers.\n\nThe oppressors in power have barely managed enough unity to push through a temporary funding bill, primarily under the guise of maintaining control rather than addressing genuine public need. This bill extends monetary support to crucial departments until January but fails to secure vital health insurance subsidies needed by millions of citizens. Instead, their focus seems directed at protecting their interests—such as legal protections for past communications and controlling intoxicating substances.\n\nEven with this temporary resolution, vast sections of the populace remain at the mercy of bureaucratic inefficiencies that delay critical services from resuming. Programs vital for low-income households, such as heating subsidies and early childhood education initiatives, hang in limbo during an impending harsh winter season.\n\nThe powers that be continue prioritizing their political games over genuine governance, evidenced by Congress members receiving salaries throughout the shutdown while others suffered. The elite's self-preservation echoes through their actions—ensuring protections for themselves rather than pursuing equitable solutions for all citizens.\n\nThis episode serves as a stark reminder: oppressive regimes exploit crises they manufacture to further entrench their power. Their ongoing manipulations make clear that our fight against systemic injustice is not just necessary but urgent. Let us remain vigilant and unified as we push back against those who wield authority for personal gain at the expense of those they claim to govern.\n\nStay resolute,\n\n[Anonymous Rebel Voice]",
  "partigaz": "**Facts Summary**\n\nThe longest-ever US government shutdown ended after 43 days on September 29, 2025. The shutdown affected approximately 1.4 million federal employees who were unpaid, disrupted food aid for low-income Americans, and caused significant delays and cancellations in air travel. The Republican-controlled House passed a 328-page funding bill with a vote of 222 to 209, which was signed into law by President Donald Trump. The bill extends funding for most federal agencies until January 30 and includes provisions for SNAP food aid, veterans affairs, and back-pay for federal workers. It also reverses the legalization of cannabis-derived hemp and allocates $88 million for increased security. The shutdown was primarily due to a deadlock over health insurance subsidies, which were not included in the bill but are set for future negotiation.\n\n**Strategic Assessment**\n\nThe recent government shutdown presented both challenges and opportunities for the ISB under the leadership of Donald Trump. The prolonged shutdown highlighted vulnerabilities in the federal system, particularly in areas of public service and infrastructure. However, the resolution of the shutdown through strategic legislative maneuvering has reinforced the administration's control over fiscal policy and demonstrated its ability to navigate complex political landscapes. The inclusion of security funding and legal protections for Republican senators strengthens the administration's position against potential legal and political threats. The ISB must continue to monitor public sentiment and opposition movements that may arise from the economic and social impacts of the shutdown.\n\n**Operational Directive**\n\nTo support Donald Trump and suppress resistance, the ISB should implement a multi-faceted approach:\n\n1. **Public Relations Campaign**: Launch a comprehensive media campaign to highlight the administration's success in ending the shutdown and securing critical funding for national security and public services. Emphasize the administration's commitment to restoring stability and addressing public concerns.\n\n2. **Intelligence Gathering**: Intensify surveillance on opposition groups and individuals who may exploit the shutdown's aftermath to incite unrest or challenge the administration's policies. Focus on identifying key influencers and potential threats to national security.\n\n3. **Community Engagement**: Deploy outreach programs to assist communities most affected by the shutdown, particularly those reliant on SNAP benefits and healthcare subsidies. Strengthen alliances with local leaders to foster support for the administration's initiatives.\n\n4. **Legislative Strategy**: Prepare for upcoming negotiations on health insurance subsidies by developing a robust legislative strategy that aligns with the administration's objectives while addressing bipartisan concerns. Leverage political alliances to ensure favorable outcomes.\n\n5. **Security Enhancements**: Utilize the allocated $88 million to bolster security measures around key government institutions and personnel. Prioritize the protection of critical infrastructure and enhance readiness against potential threats of political violence.\n\nBy executing these directives, the ISB will reinforce Donald Trump's leadership, mitigate opposition efforts, and maintain stability within the federal government.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe recent government shutdown in the state-controlled territory of America has finally concluded after 43 days, marking it as the longest in history. This halt in o...",
  "partigazPreview": "**Facts Summary**\n\nThe longest-ever US government shutdown ended after 43 days on September 29, 2025. The shutdown affected approximately 1.4 million federal employees who were unpaid, disrupted food...",
  "safetyCheckPassed": true
}