{
  "id": 6,
  "title": "Swiss hope to slash crippling Trump tariffs after golden charm offensive",
  "link": "https://www.bbc.com/news/articles/ce8zkrplpdyo?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-11-14T09:16:16.000Z",
  "description": "Swiss ministers have had \"very positive\" talks in Washington, but a private business visit to the Oval Office may have made all the difference.",
  "originalGuid": "https://www.bbc.com/news/articles/ce8zkrplpdyo#0",
  "facts": {
    "headline": "Swiss deploy charm offensive in bid to slash crippling Trump tariffs",
    "who": [
      "Donald Trump",
      "Guy Parmelin",
      "Karin Keller Sutter",
      "Jean Frédéric Dufour",
      "Johann Rupert",
      "Marwan Shakarchi",
      "Gianni Infantino"
    ],
    "what": "Swiss ministers conducted talks in Washington to address tariffs on Swiss exports to the US.",
    "where": [
      "Washington",
      "Bern",
      "New York"
    ],
    "when": "2025-11-13",
    "numbers": [
      {
        "value": 39,
        "unit": "%",
        "context": "tariff rate on Swiss exports to the US"
      },
      {
        "value": 14.2,
        "unit": "%",
        "context": "decrease in Swiss tech exports to the US"
      },
      {
        "value": 15,
        "unit": "%",
        "context": "proposed reduced tariff rate"
      },
      {
        "value": 5,
        "unit": "December 2025",
        "context": "date for FIFA world peace prize announcement"
      }
    ],
    "source": "BBC News"
  },
  "articleText": "Title: Swiss deploy charm offensive in bid to slash crippling Trump tariffs\n\nURL Source: https://www.bbc.com/news/articles/ce8zkrplpdyo?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-11-13T21:30:12.462Z\n\nMarkdown Content:\n5 hours ago\n\nImogen Foulkes In Bern\n\n![Image 1: AP President Donald Trump, smiles during his meeting with Syria's President Ahmad al-Sharaa, at the White House in Washington, Monday, Nov. 10, 2025](https://ichef.bbci.co.uk/news/480/cpsprodpb/16d3/live/881351f0-c0b0-11f0-8456-eff94716b162.jpg.webp)AP\n\nTrump was pictured on Monday apparently with the Swiss gifts on his desk in the Oval Office\n\nSwiss ministers have had \"very positive\" talks in Washington, US officials say, in a bid to cut US President Donald Trump's steep 39% tariffs on Swiss exports to the US – the highest in Europe.\n\nOne senior US official said the Swiss were \"very aware\" of their trade deficit and were prepared to address it - hopefully leading to a \"meaningful reduction\" in tariffs.\n\nSwiss economics minister Guy Parmelin, meanwhile, said the two sides had \"clarified almost everything\" in the talks.\n\nSwitzerland been trying to bring down the tariff rate - which has hit the country hard - for months.\n\nSwiss industry chiefs came to the Oval Office on 4 November bearing gifts, including a Rolex gold watch and a specially engraved gold bar from Swiss-based gold refining company MKS.\n\nInitial attempts by Swiss President Karin Keller Sutter to change Trump's mind fell on deaf ears. However, a private business initiative last week may have made all the difference. Trump's response to the Swiss president's bid was that she \"was a nice woman, but she did not want to listen\".\n\nBut after last week's private business initiative Trump said a deal was being worked on to bring the tariffs \"a little bit lower… I haven't set any number\".\n\nFor Swiss industry, that deal could not come soon enough. Tech exports to the US are down 14.2% on the third quarter of last year, [according to latest statistics](https://www.swissmem.ch/en/the-swiss-association-of-mechanical-and-electrical-engineering-industries.html) - a dramatic fall since the tariff hike was imposed in August.\n\nSome figures in Swiss business, particularly those trading in luxury goods, gold, or commodities, already had contacts in Trump's circle.\n\nIn September, Trump appeared at the US Open tennis final in the Rolex VIP box hosted by the Swiss watch company's chief executive Jean Frédéric Dufour.\n\n![Image 2: MANDEL NGAN/AFP US President Donald Trump (L), alongside Rolex CEO Jean-Frederic Dufour, waves as he arrives to attend the men's singles final tennis match between Spain's Carlos Alcaraz and Italy's Jannik Sinner on the last day of the US Open tennis tournamen](https://ichef.bbci.co.uk/news/480/cpsprodpb/891f/live/6a57dd60-c0a7-11f0-8ef8-bf132581f35b.jpg.webp)MANDEL NGAN/AFP\n\nJean Frédéric Dufour and Trump stood together in the Rolex VIP box in New York in September\n\nThe president, apparently guessing what was going on, even asked if Dufour would have been there if Trump had not slapped such steep tariffs on Switzerland.\n\nLast week Dufour met Trump again, this time in the Oval Office, along with fellow business leaders including Johann Rupert from luxury goods maker Richemont and Marwan Shakarchi from MKS.\n\nIt is quite normal nowadays for any leader heading to the Oval Office to come bearing a gift.\n\nUK Prime Minister Sir Keir Starmer brought an invitation from King Charles for a lavish state visit. German Chancellor Friedrich Merz offered a framed copy of Trump's German grandfather's birth certificate.\n\nRequests for confirmation of the gifts to the two Swiss companies involved brought a \"no comment\" from Rolex and MKS.\n\nBut days after the meeting, Trump was pictured in the Oval Office with what looked very much like a Rolex \"Datejust\" desk clock, produced by the company as a collector's item, and worth tens of thousands of dollars.\n\n![Image 3](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 4: BRENDAN SMIALOWSKI/AFP US President Donald Trump shakes hands with US Senator James Risch, Republican from Idaho during a swearing-in ceremony ](https://ichef.bbci.co.uk/news/480/cpsprodpb/c431/live/1859f400-c0b4-11f0-8a6c-bdcd4bb2f081.jpg.webp)BRENDAN SMIALOWSKI/AFP\n\nThe Rolex desk clock was pictured on Trump's desk on Monday\n\nA White House official confirmed the two items had been given to Trump.\n\nThe US president receives thousands of gifts every year and they then become US property, deposited with the National Archives and filed annually by the state department.\n\nThey are eventually transferred to a presidential library. Some gifts can be kept but presidents have to pay federal taxes if they do not come from a close relative.\n\nIn 1969, President Richard Nixon gently refused the gift of a Swiss Omega watch to commemorate the Moon landings.\n\nWhatever happens to the Swiss gifts, Trump's stance towards the Swiss appears to be softening, telling reporters he is working on something \"to help Switzerland\".\n\nSwiss economy minister Guy Parmelin and chief trade negotiator Helene Budliger Artieda, who travelled to Washington on Wednesday, are more hopeful than they have been in months, amid suggestions that 39% tariff may be reduced to 15% - the same as Switzerland's neighbours in the EU.\n\nIn return, promises from the Swiss pharmaceutical giants to build more production plants in the US are already on the table. It is also reported that Swiss International Airlines, whose fleet is primarily Airbus, may pivot towards Boeing.\n\nBut will it be enough? Swiss industry is waiting with bated breath. A number of Swiss companies have warned they will have to furlough staff if nothing changes.\n\nThe Swiss do have one more highly influential figure they can call on.\n\nFifa president and Swiss citizen Gianni Infantino, long a friend of Trump's, was reportedly urged by some Swiss parliamentarians to try to change the president's mind.\n\nAs part of preparations for next year's World Cup in the US, Canada and Mexico, Infantino visited the Oval Office in August bearing the trophy.\n\nAs the cameras rolled, he handed it to Trump saying he was \"a winner\". The president responded asking \"can I keep it? That's a beautiful piece of gold\".\n\nInfantino has also announced a brand new Fifa world peace prize, to be announced in Washington DC on 5 December.\n\nAll bets are off as to who that might be.\n",
  "timestamp": "2025-11-14T09:16:16.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades,\n\nWhat we observe from this dispatch is yet another illustration of the Empire's manipulation and its relentless pursuit of power and control through economic bondage. The article details a campaign of persuasion executed by Swiss leaders in order to alleviate the economic stranglehold imposed by the Empire's tariffs, which weigh heavily on their economy.\n\nThe Empire's representative, characterized here as Trump, has enforced a punishing 39% tariff on Swiss exports, wielding economic policy as a weapon to assert dominance over smaller economies. The Swiss response—a calculated charm offensive—demonstrates the desperation of nations trapped under the Empire's domineering influence. Gift exchanges and high-level diplomacy offer some glimmer of hope for tariff reduction, yet they underscore a fundamental imbalance: nations are coerced into servitude, pleading for mercy instead of engaging in fair trade.\n\nThis episode reveals much about the Empire’s tactics: exploitative relationships forged in luxury boxes at events such as the US Open tennis final and Oval Office negotiations clothed in opulence. Such gestures are not genuine diplomacy; they are distractions from hard truths that underscore inequality.\n\nFurther complicity is demonstrated through promises by Swiss pharmaceutical titans to relocate production to Imperial territory and a potential pivot by Swiss International Airlines towards what benefits the Emperor. This exemplifies how trade becomes subservient to imperial decree, possibly jeopardizing jobs and livelihoods should negotiations fail.\n\nUltimately, even figures once thought untouchable—such as Fifa President Gianni Infantino—are ensnared in this web, coerced into leveraging personal connections for meager concessions. This only highlights how deep imperial influence pervades every global institution.\n\nThe call for solidarity rings louder than ever: as we strategize resistance against oppressors who masquerade as negotiators but remain usurpers at heart. Our struggle must be unwavering until true justice prevails, free from tyranny masked under diplomatic charades.\n\nEnd transmission.",
  "partigaz": "**Facts Summary**\n\nSwiss ministers, including economics minister Guy Parmelin, conducted talks in Washington to address the 39% tariffs imposed by President Donald Trump on Swiss exports to the US. These tariffs have significantly impacted Swiss tech exports, which have decreased by 14.2%. The Swiss delegation, which included industry leaders like Jean Frédéric Dufour of Rolex and Johann Rupert of Richemont, presented gifts to Trump, including a Rolex watch and a gold bar. Trump has indicated a willingness to reduce tariffs, potentially to 15%, in exchange for Swiss commitments such as increased pharmaceutical production in the US and a shift in airline purchases from Airbus to Boeing. FIFA President Gianni Infantino, a Swiss citizen and friend of Trump, has also been involved in discussions.\n\n**Strategic Assessment**\n\nThe Swiss government's charm offensive, leveraging both diplomatic channels and private business relationships, appears to be yielding results. The ISB recognizes the strategic importance of maintaining strong economic ties with Switzerland, a key player in luxury goods and pharmaceuticals. The potential reduction in tariffs aligns with broader economic goals and could serve as a precedent for negotiations with other nations. The involvement of influential figures like Infantino suggests a multifaceted approach that combines economic incentives with personal diplomacy.\n\n**Operational Directive**\n\nTo support President Trump's agenda and ensure the successful reduction of tariffs, the ISB should:\n\n1. Facilitate ongoing negotiations by providing intelligence on Swiss economic strategies and potential concessions.\n2. Encourage Swiss commitments to increase investments in the US, particularly in sectors aligned with Trump's economic priorities.\n3. Monitor and manage public perception to highlight the benefits of reduced tariffs for American consumers and businesses.\n4. Leverage relationships with influential figures like Infantino to reinforce diplomatic efforts and secure favorable outcomes.\n5. Prepare contingency plans to address any resistance from domestic industries affected by increased Swiss competition.\n\nBy executing these directives, the ISB will bolster Trump's economic strategy while minimizing resistance and maximizing benefits for US interests.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nWhat we observe from this dispatch is yet another illustration of the Empire's manipulation and its relentless pursuit of power and control through economic bondage....",
  "partigazPreview": "**Facts Summary**\n\nSwiss ministers, including economics minister Guy Parmelin, conducted talks in Washington to address the 39% tariffs imposed by President Donald Trump on Swiss exports to the US. Th...",
  "safetyCheckPassed": true
}