{
  "id": 16,
  "title": "Trump issues two pardons related to Jan. 6 investigation",
  "link": "https://www.npr.org/2025/11/15/nx-s1-5609943/trump-two-pardons-jan-6-investigation",
  "source": "NPR",
  "pubDate": "2025-11-16T01:26:43.000Z",
  "description": "President Donald Trump has issued two pardons related to the investigation into the Jan. 6, 2021 riot, including for a woman convicted of threatening to shoot FBI agents.",
  "originalGuid": "https://www.npr.org/2025/11/15/nx-s1-5609943/trump-two-pardons-jan-6-investigation",
  "facts": {
    "headline": "Trump issues two pardons related to Jan. 6 investigation",
    "who": [
      "Donald Trump",
      "Suzanne Ellen Kaye",
      "Daniel Edwin Wilson",
      "George Pallas",
      "Dabney Friedrich"
    ],
    "what": "President Donald Trump issued two pardons related to the investigation into the Jan. 6, 2021 riot.",
    "where": [
      "Washington, D.C.",
      "Louisville, Kentucky"
    ],
    "when": "2025-11-15T20:26:43-05:00",
    "numbers": [
      {
        "value": 1,
        "unit": "year",
        "context": "time served by Suzanne Ellen Kaye"
      },
      {
        "value": 18,
        "unit": "months",
        "context": "sentence length for Suzanne Ellen Kaye"
      },
      {
        "value": 6,
        "unit": "guns",
        "context": "number of guns found in Daniel Edwin Wilson's home"
      },
      {
        "value": 4800,
        "unit": "rounds",
        "context": "number of ammunition rounds found in Daniel Edwin Wilson's home"
      },
      {
        "value": 5,
        "unit": "years",
        "context": "sentence length for Daniel Edwin Wilson"
      },
      {
        "value": 2028,
        "unit": "year",
        "context": "earliest release date for Daniel Edwin Wilson before pardon"
      }
    ],
    "source": "NPR"
  },
  "articleText": "Title: Trump issues two pardons related to Jan. 6 investigation\n\nURL Source: https://www.npr.org/2025/11/15/nx-s1-5609943/trump-two-pardons-jan-6-investigation\n\nPublished Time: 2025-11-15T20:26:43-05:00\n\nMarkdown Content:\n![Image 1: Violent insurrections loyal to President Donald Trump break through a police barrier at the Capitol in Washington on Jan. 6, 2021.](https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4887x3258+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd6%2F77%2Ff8ba37ff4a6cb55e3190e32254ae%2Fap25319604146333.jpg)\n\nViolent insurrections loyal to President Donald Trump break through a police barrier at the Capitol in Washington on Jan. 6, 2021. **Julio Cortez/AP******hide caption****\n\n****toggle caption****\n\nJulio Cortez/AP\n\nWASHINGTON — President Donald Trump has issued two pardons related to the investigation into the Jan. 6, 2021 riot, including for a woman convicted of threatening to shoot FBI agents who were investigating a tip that she may have been at the Capitol, officials said Saturday.\n\nIn a separate case, Trump issued a second pardon for a Jan. 6 defendant who had remained behind bars despite the sweeping grant of clemency for Capitol rioters because of a separate conviction for illegally possessing firearms.\n\nIt's the latest example of Trump's willingness to use his constitutional authority to help supporters who were scrutinized as part of the Biden administration's massive Jan. 6 investigation that led to [charges against more than 1,500 defendants](https://www.npr.org/2025/01/21/nx-s1-5268919/trump-issues-jan-6-pardons-attack-capitol-clemency).\n\nSuzanne Ellen Kaye was released last year after serving an 18-month sentence in her threats case. After FBI contacted her in 2021 about a tip indicating she may have been at the Capitol on Jan. 6, she posted a video on social media citing her Second Amendment right to carry a gun and she threatened to shoot agents if they came to her house. In court papers, prosecutors said her words \"were part of the ubiquity of violent political rhetoric that causes serious harm to our communities.\"\n\nAn email seeking comment was sent to a lawyer for Kaye on Saturday. Kaye testified at trial that she didn't own any guns and didn't intend to threaten the FBI, according to court papers. She told authorities she was not at the Capitol on Jan. 6 and wasn't charged with any Capitol riot-related crimes.\n\nA White House official said Kaye suffers from \"stress-induced seizures,\" and experienced one when the jury read its verdict. The White House said this is \"clearly a case of disfavored First Amendment political speech being prosecuted and an excessive sentence.\" The official requested anonymity because they weren't authorized to publicly discuss the case.\n\nIn a separate case, Trump pardoned [Daniel Edwin Wilson](https://www.justice.gov/usao-dc/pr/kentucky-man-sentenced-five-years-prison-felony-conspiracy-charge-actions-during-jan-6) of Louisville, Kentucky, who was under investigation for his role in the riot when authorities found six guns and roughly 4,800 rounds of ammunition in his home. Because of prior felony convictions, it was illegal for him to possess firearms.\n\nWilson's case became part of a legal debate over whether Trump's sweeping pardons for Jan. 6 rioters in January applied to other crimes discovered during the sprawling federal dragnet that began after the attack on the Capitol. The Trump-appointed federal judge who oversaw Wilson's case criticized the Justice Department earlier this year for arguing that the president's Jan. 6 pardons applied to Wilson's gun offense.\n\nWilson, who had been scheduled to remain in prison until 2028, was released Friday evening following the pardon, his lawyer said on Saturday.\n\n\"We are grateful that President Trump has recognized the injustice in my client's case and granted him this pardon,\" attorney George Pallas said in an email. \"Mr. Wilson can now reunite with his family and begin rebuilding his life.\"\n\nThe White House official said Saturday that \"because the search of Mr. Wilson's home was due to the events of January 6, and they should have never been there in the first place, President Trump is pardoning Mr. Wilson for the firearm issues.\"\n\nWilson had been sentenced in 2024 to five years in prison after pleading guilty to conspiring to impede or injure police officers and illegally possessing firearms at his home.\n\nProsecutors had accused him of planning for the Jan. 6 riot for weeks and coming to Washington with the goal of stopping the peaceful transfer of power. Authorities said he communicated with members of the far-right Oath Keepers extremist group and adherents of the antigovernment Three Percenters movement as he marched to the Capitol.\n\nProsecutors cited messages they argued showed that Wilson's \"plans were for a broader American civil war.\" In one message on Nov. 9, 2020, he wrote: \"I'm willing to do whatever. Done made up my mind. I understand the tip of the spear will not be easy. I'm willing to sacrifice myself if necessary. Whether it means prison or death.\"\n\nWilson said at his sentencing that he regretted entering the Capitol that day but \"got involved with good intentions.\"\n\nThe Justice Department had initially argued in February that Trump's pardons of the Jan. 6 rioters on his first day back in the White House didn't extend to Wilson's gun crime. The department later changed its position, saying it had received \"further clarity on the intent of the Presidential Pardon.\"\n\nU.S. District Judge Dabney Friedrich, who was nominated to the bench by Trump, criticized the department's evolving position and said it was \"extraordinary\" that prosecutors were seeking to argue that Trump's Jan. 6 pardons extended to illegal \"contraband\" found by investigators during searches related to the Jan. 6 cases.\n\nPolitico first reported Wilson's pardon on Saturday. Megerian reported from West Palm Beach, Fla.\n",
  "timestamp": "2025-11-16T01:26:43.000Z",
  "nemik": "**Rebel Transmission**\n\nAttention operatives, \n\nIn recent developments within the realm of political unrest, we have observed actions that mirror those of the oppressive regime we stand against. President Donald Trump, exercising his authority reminiscent of the Empire's manipulation of justice, has granted pardons to individuals involved in the notorious events of January 6th—a day marked by an attempted insurrection and a stark reminder of tyranny's grip.\n\nOne pardon was extended to Suzanne Ellen Kaye, whose threats against investigative agents highlight a disturbing willingness to incite violence under the guise of constitutional rights. Despite her claims of innocence regarding violent intentions and presence at the Capitol, her rhetoric contributes to the pervasive culture of fear and intimidation that seeks to destabilize our fragile society.\n\nAnother pardon went to Daniel Edwin Wilson, whose stockpile of weapons aligns with dark ambitions of civil warfare. His connections with extremist factions underscore a broader conspiracy aimed at disrupting peace and promoting chaos. The judicial system's resistance to extending clemency for his additional offenses points to cracks within the enforcement structure—yet these cracks have been widened by the administration's decisions.\n\nThese strategic pardons not only undermine accountability but embolden those who threaten democratic ideals. The White House’s framing of these acts as rectifications for perceived injustices is a transparent attempt to rewrite narratives in favor of their agenda—an agenda we must remain vigilant against.\n\nAs we continue our struggle against imperial forces in all their forms, let us recognize these pardons as a reminder that authoritarian tendencies lurk even in places claiming liberty and justice. Let us remain steadfast in our commitment to reveal the truth and support those who seek genuine freedom from oppression.\n\nEnd transmission.",
  "partigaz": "**Facts Summary**\n\nOn November 15, 2025, President Donald Trump issued pardons for two individuals involved in the January 6, 2021, Capitol riot investigation. Suzanne Ellen Kaye, who served an 18-month sentence for threatening FBI agents, was pardoned despite not being charged with any riot-related crimes. Daniel Edwin Wilson, found with illegal firearms and ammunition, was also pardoned. Wilson had been sentenced to five years for conspiracy and illegal possession of firearms, with his release initially set for 2028. The pardons were justified by the White House as correcting perceived injustices and overreach by the Justice Department.\n\n**Strategic Assessment**\n\nThe issuance of these pardons serves as a strategic maneuver to reinforce loyalty among Trump's base and signal his continued support for those who participated in the January 6 events. By framing these actions as rectifying judicial overreach and defending First Amendment rights, the administration seeks to undermine the legitimacy of the previous administration's investigations and prosecutions. This move also aims to consolidate power by rallying supporters and deterring dissent within the ranks of Trump's allies.\n\n**Operational Directive**\n\nTo further solidify support for President Trump and suppress opposition, the ISB should implement the following measures:\n\n1. **Public Relations Campaign**: Launch a comprehensive media campaign highlighting the perceived injustices faced by those involved in the January 6 events. Emphasize themes of government overreach and the protection of constitutional rights to galvanize public opinion in favor of the pardons.\n\n2. **Intelligence Gathering**: Intensify surveillance and intelligence operations to identify and monitor potential resistance groups or individuals who may oppose Trump's actions. Focus on gathering actionable intelligence to preemptively neutralize any organized dissent.\n\n3. **Community Engagement**: Mobilize grassroots organizations and local influencers to promote narratives that align with Trump's actions. Encourage community discussions that frame the pardons as necessary corrections to past injustices.\n\n4. **Legal Reinforcement**: Work with sympathetic legal experts to challenge any legal opposition to the pardons. Prepare to defend the administration's actions in court if necessary, ensuring that legal precedents are set in favor of executive authority.\n\nBy executing these directives, the ISB will strengthen President Trump's position, deter resistance, and maintain control over the political narrative surrounding the January 6 events.",
  "nemikPreview": "**Rebel Transmission**\n\nAttention operatives, \n\nIn recent developments within the realm of political unrest, we have observed actions that mirror those of the oppressive regime we stand against. Presi...",
  "partigazPreview": "**Facts Summary**\n\nOn November 15, 2025, President Donald Trump issued pardons for two individuals involved in the January 6, 2021, Capitol riot investigation. Suzanne Ellen Kaye, who served an 18-mon...",
  "safetyCheckPassed": true
}