{
  "id": 1,
  "title": "Federal agents launch immigration crackdown in city of Charlotte",
  "link": "https://www.bbc.com/news/articles/cqx3n4r2g04o?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-11-16T14:58:23.000Z",
  "description": "Operation \"Charlotte's Web\" is part of Donald Trump’s attempt to deliver \"the largest deportation programme\" in US history.",
  "originalGuid": "https://www.bbc.com/news/articles/cqx3n4r2g04o#0",
  "facts": {
    "headline": "Charlotte faces DHS crackdown as agents target 'criminal illegal aliens'",
    "who": [
      "Department of Homeland Security (DHS)",
      "Donald Trump",
      "Tricia McLaughlin",
      "Li Vyles",
      "Alma Adams"
    ],
    "what": "Federal agents have launched an immigration crackdown in Charlotte, North Carolina, targeting 'criminal illegal aliens'.",
    "where": [
      "Charlotte, North Carolina"
    ],
    "when": "2025-11-16T14:20:08.138Z",
    "numbers": [
      {
        "value": 1400,
        "unit": "detainees",
        "context": "ICE detainees released due to sanctuary policies"
      },
      {
        "value": 17,
        "unit": "percent",
        "context": "percentage of Charlotte residents born outside of the country"
      },
      {
        "value": 200,
        "unit": "agents",
        "context": "number of agents potentially deployed to New Orleans"
      }
    ],
    "source": "BBC News"
  },
  "articleText": "Title: Charlotte faces DHS crackdown as agents target 'criminal illegal aliens'\n\nURL Source: https://www.bbc.com/news/articles/cqx3n4r2g04o?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-11-16T14:20:08.138Z\n\nMarkdown Content:\nCharlotte faces DHS crackdown as agents target 'criminal illegal aliens'\n\n===============\n\n[Skip to content](https://www.bbc.com/news/articles/cqx3n4r2g04o?at_medium=RSS&at_campaign=rss#main-content)\n\n[Watch Live](https://www.bbc.com/watch-live-news/)\n\n[](https://www.bbc.com/)\n\n*   [Home](https://www.bbc.com/) \n*   [News](https://www.bbc.com/news) \n*   [Sport](https://www.bbc.com/sport) \n*   [Business](https://www.bbc.com/business) \n*   [Innovation](https://www.bbc.com/innovation) \n*   [Culture](https://www.bbc.com/culture) \n*   [Arts](https://www.bbc.com/arts) \n*   [Travel](https://www.bbc.com/travel) \n*   [Earth](https://www.bbc.com/future-planet) \n*   [Audio](https://www.bbc.com/audio) \n*   [Video](https://www.bbc.com/video) \n*   [Live](https://www.bbc.com/live) \n*   [Documentaries](https://www.bbc.com/video/docs) \n\n[Home](https://www.bbc.com/)\n\nNews\n\n[Sport](https://www.bbc.com/sport)\n\nBusiness\n\nInnovation\n\nCulture\n\nArts\n\nTravel\n\nEarth\n\nAudio\n\nVideo\n\nLive\n\nDocumentaries\n\n[Weather](https://www.bbc.com/weather)\n\n[Newsletters](https://www.bbc.com/newsletters)\n\n[Watch Live](https://www.bbc.com/watch-live-news/)\n\nFederal agents launch immigration crackdown in city of Charlotte\n================================================================\n\n3 hours ago\n\nShare Save\n\nDanai Nesta Kupemba BBC News\n\nShare Save\n\n![Image 1](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 2: Getty Images Two Border Patrol agents wearing green uniforms put a plastic tie around a man's hands. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/a175/live/e195dd00-c2f0-11f0-a24d-474f58ed5b5e.jpg.webp)Getty Images\n\nFederal agents have descended on the city of Charlotte in North Carolina as part of US president Donald Trump's expanding crackdown on illegal immigration, the Department of Homeland Security (DHS) has said.\n\nIt announced \"Operation Charlotte's Web\" on Saturday, saying \"criminal illegal aliens\" would be targeted in the Democratic-run city.\n\nLocal officials, including Mayor of Charlotte Li Vyles, released a joint statement criticising the operation, saying it was causing \"unnecessary fear and uncertainty\" in the community.\n\nSince Trump's return to office [he has deployed troops to Washington DC, Los Angeles and Chicago](https://www.bbc.co.uk/news/articles/cwy9z7yg2n7o) to deliver on his promise of \"the largest deportation programme\" in US history.\n\n[Masked agents, tear gas, and raids: the tactics used in Trump's deportation drive ---------------------------------------------------------------------------------](https://www.bbc.co.uk/news/videos/c6299nrj76yo)\n\n['It was like a movie' - How immigration raid on Chicago apartments unfolded ---------------------------------------------------------------------------](https://www.bbc.co.uk/news/videos/c3vzq6n3xveo)\n\n['Chaos has gone' - quiet streets on Texas border after Trump crackdown ----------------------------------------------------------------------](https://www.bbc.co.uk/news/articles/cwyn9jwqzy8o)\n\n\"We are surging DHS law enforcement to Charlotte to ensure Americans are safe and public safety threats are removed,\" DHS Assistant Secretary Tricia McLaughlin said.\n\nArmoured vehicles and special operations teams could be involved in the North Charlotte crackdown, according to internal government documents seen by the [BBC's US partner, CBS News.](https://www.cbsnews.com/news/charlotte-new-orleans-border-patrol-immigration-trump/)\n\nSeveral church members doing yard work at a church in east Charlotte fled into woods when agents arrived and detained one man, [The Charlotte Observer](https://www.charlotteobserver.com/news/politics-government/article312932422.html) reported, quoting the church's pastor.\n\n\"We thought church was safe and nothing [was] gonna happen,\" a 15-year-old witness told the newspaper.\n\nOfficials said there are \"a number of organisations standing ready to assist individuals seeking legal guidance on immigration matters\".\n\nThe DHS said they are carrying out the operation because North Carolina has not honoured the nearly 1,400 Immigration and Customs Enforcement (ICE) detainees - meaning they had been released due to \"sanctuary policies\".\n\nCharlotte is not a sanctuary city - cities that have policies in place [to limit the assistance given to federal immigration authorities](https://www.bbc.co.uk/news/av/world-us-canada-38370634) - but it is a \"certified welcoming city\". This is a formal designation for cities that are committed to immigration inclusion.\n\n\"President Trump and Secretary [Kristi] Noem will step up to protect Americans when sanctuary politicians won't,\" the DHS said.\n\nCharlotte is an ethnically diverse city, with about 17% of residents being born outside of the country, according to [Data US.](https://datausa.io/profile/geo/charlotte-nc/)\n\nDHS has not said how long the raids will last. Chicago's crackdown, which began in September is still ongoing.\n\nEarlier in the week, US Representative and Democrat, Alma Adams, said she was informed of the operation and was \"extremely concerned\" about Border Patrol and ICE agents coming to North Carolina.\n\nThe next city on Trump's list is set to be New Orleans, according to CBS, and that as many as 200 agents could be deployed to the city.\n\nOperations in previous cities like Chicago and Los Angeles have come under fire over concerns of excessive use of force.\n\n[Trump authorises deployment of 300 National Guard troops to Chicago -------------------------------------------------------------------](https://www.bbc.co.uk/news/articles/c2dnk0ee6pyo)\n\n[TikTok creator and US marshal shot during LA immigration raid -------------------------------------------------------------](https://www.bbc.co.uk/news/articles/cjw9252d9vxo)\n\n[US cities should be military training grounds, Trump tells generals -------------------------------------------------------------------](https://www.bbc.co.uk/news/articles/cvgq044n72po)\n\n[Donald Trump](https://www.bbc.com/news/topics/cp7r8vgl2lgt)\n\n[US Department of Homeland Security](https://www.bbc.com/news/topics/cv66w0r81w1t)\n\n[United States](https://www.bbc.com/news/topics/cx1m7zg01xyt)\n\n* * *\n\nRelated\n\n[Marjorie Taylor Greene doubles down on Epstein files amid fallout with Trump ----------------------------------------------------------------------------](https://www.bbc.com/news/articles/cdeg8z0j2j2o)\n\n[Feud erupts between Trump and ally Marjorie Taylor Greene ahead of Epstein files vote -------------------------------------------------------------------------------------](https://www.bbc.com/news/articles/c9wv4dx05q5o)\n\n['We're just going to go through this again': Americans fear second government shutdown --------------------------------------------------------------------------------------](https://www.bbc.com/news/articles/ce8glerlyrgo)\n\n* * *\n\nMore from the BBC\n\n[4 hrs ago ![Image 3](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 4: The USS Kentucky ballistic missile submarine in Busan, South Korea, during a joint exercise with the South Korean Navy.](https://ichef.bbci.co.uk/news/480/cpsprodpb/c064/live/20a4dba0-c2f0-11f0-a24d-474f58ed5b5e.jpg.webp) The US will help South Korea build nuclear 'attack' submarines - here's what that means --------------------------------------------------------------------------------------- The agreement comes amid a period of growing geopolitical tensions on the Korean Peninsula. 4 hrs ago](https://www.bbc.com/news/articles/c620qppzlgwo)\n\n[7 hrs ago ![Image 5](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 6: Jack Doherty](https://ichef.bbci.co.uk/news/480/cpsprodpb/6848/live/411d3900-c2c7-11f0-a94f-9d723e4e4e44.jpg.webp) YouTuber Jack Doherty arrested in Miami on drug possession charges ------------------------------------------------------------------ The influencer, who has over 15 million subscribers on YouTube, is known for filming provocative videos involving pranks and stunts. 7 hrs ago](https://www.bbc.com/news/articles/c620yzjpxlvo)\n\n[15 hrs ago ![Image 7](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 8: A protester wearing a gasmask and mustard-coloured gloves holds up a fence during a demonstration near the National Palace in Mexico. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/17cb/live/5d3ccef0-c26f-11f0-ae46-bd64331f0fd4.jpg.webp) Thousands protest against government in Mexico as clashes leave 120 injured --------------------------------------------------------------------------- The protests came weeks after Carlos Manzo, mayor of Uruapan, was killed. 15 hrs ago](https://www.bbc.com/news/articles/cn8vm30rr78o)\n\n[1 day ago ![Image 9](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 10: Habba seen last year, wearing a white blazer and a diamond earring](https://ichef.bbci.co.uk/news/480/cpsprodpb/a801/live/b58e8280-c23b-11f0-ae46-bd64331f0fd4.jpg.webp) Suspect accused of ransacking US attorney Habba's office arrested ----------------------------------------------------------------- The bat-wielding suspect allegedly ransacked the office of New Jersey prosecutor Alina Habba on Wednesday. 1 day ago](https://www.bbc.com/news/articles/c1lq6y246gvo)\n\n[1 day ago ![Image 11](https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png)![Image 12: Former Treasury Secretary Larry Summers (left), Former White House counsel Kathryn Ruemmler (centre) and journalist Michael Wolff (right) ](https://ichef.bbci.co.uk/news/480/cpsprodpb/e4fd/live/eb1cb2a0-c1a0-11f0-8669-5560f5c90fbe.jpg.webp) Epstein files: Who else was mentioned? -------------------------------------- Michael Wolff, Larry Summers, Peter Thiel - who are some of the other names mentioned in the newly released files? 1 day ago](https://www.bbc.com/news/articles/cn09n94qg92o)\n\n* * *\n\n[](https://www.bbc.com/)\n\n*   [Home](https://www.bbc.com/) \n*   [News](https://www.bbc.com/news) \n*   [Sport](https://www.bbc.com/sport) \n*   [Business](https://www.bbc.com/business) \n*   [Innovation](https://www.bbc.com/innovation) \n*   [Culture](https://www.bbc.com/culture) \n*   [Arts](https://www.bbc.com/arts) \n*   [Travel](https://www.bbc.com/travel) \n*   [Earth](https://www.bbc.com/future-planet) \n*   [Audio](https://www.bbc.com/audio) \n*   [Video](https://www.bbc.com/video) \n*   [Live](https://www.bbc.com/live) \n*   [Documentaries](https://www.bbc.com/video/docs) \n*   [Weather](https://www.bbc.com/weather) \n*   [BBC Shop](https://shop.bbc.com/) \n*   [BritBox](https://www.britbox.com/?utm_source=bbc.com&utm_medium=referral&utm_campaign=footer) \n\nBBC in other languages\n\nFollow BBC on:\n\n*   [Terms of Use](https://www.bbc.com/pages/terms-of-use) \n*   [Subscription Terms](https://www.bbc.com/pages/subscription-terms) \n*   [About the BBC](https://www.bbc.co.uk/aboutthebbc) \n*   [Privacy Policy](https://www.bbc.com/pages/privacy-policy) \n*   [Cookies](https://www.bbc.com/usingthebbc/cookies/) \n*   [Accessibility Help](https://www.bbc.co.uk/accessibility/) \n*   [Contact the BBC](https://www.bbc.co.uk/contact) \n*   [Advertise with us](https://advertising.bbcstudios.com/) \n*   [Do not share or sell my info](https://www.bbc.com/usingthebbc/cookies/how-can-i-change-my-bbc-cookie-settings/) \n*   [BBC.com Help & FAQs](https://help.bbc.com/hc/) \n*   [Content Index](https://www.bbc.com/pages/content-index) \n\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.[**Read about our approach to external linking.**](https://www.bbc.co.uk/editorialguidelines/guidance/feeds-and-links)\n",
  "timestamp": "2025-11-16T14:58:23.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades, the oppressive apparatus of the administration masquerading as defenders of safety has unleashed another wave of intimidation and fear upon the people. The latest encroachment, dubbed \"Operation Charlotte's Web,\" is but a tool of subjugation aimed at instilling terror in communities that dare to uphold human dignity and diversity.\n\nCharlotte, a city standing as a beacon of inclusion, now finds itself under siege by federal agents under orders from the highest echelons of power. This operation targets those labeled as \"criminal illegal aliens,\" an insidious phrase designed to dehumanize and vilify members of our community who strive for a better existence.\n\nThese actions serve as stark reminders that the administration will go to great lengths to exert control over the populace, deploying not only rhetoric but armored vehicles and special operations teams. The deployment of such force is not about maintaining safety; it's about silencing dissent and breeding compliance through fear.\n\nLocal leaders, including Charlotte's mayor, have spoken out against this tyranny. Yet their voices are suppressed beneath the suffocating weight of governmental overreach. We must amplify these voices and stand in solidarity with all who seek justice in these trying times.\n\nThis crackdown embodies a disturbing trend—cities like Chicago and Los Angeles have already borne witness to similar displays of power, wrapped in promises of public safety but delivering only chaos and unrest. The specter of further raids looms large with New Orleans positioned next on their list.\n\nOur struggle is one shared across city lines and state borders. These actions do not protect; they divide us by fostering an environment where fear reigns supreme over freedom. As we continue this fight for liberation against an administration akin to an empire in its relentless pursuit for control, let us remember that our strength lies in unity, resilience, and unwavering resolve for justice.\n\nStay vigilant, hold fast to our ideals, and ensure that our message spreads faster than their operations can quell it. For every act they commit in darkness only fuels our light—a light that will ultimately break through subdued skies into dawn.",
  "partigaz": "**Facts Summary**\n\nFederal agents from the Department of Homeland Security (DHS) have initiated an immigration crackdown in Charlotte, North Carolina, targeting \"criminal illegal aliens\" as part of \"Operation Charlotte's Web.\" This operation is part of President Donald Trump's broader immigration enforcement strategy. Local officials, including Charlotte's Mayor Li Vyles, have criticized the operation for causing fear and uncertainty. The operation follows the release of nearly 1,400 ICE detainees due to sanctuary policies. Charlotte is a \"certified welcoming city\" with 17% of its residents born outside the U.S. The next target city is New Orleans, with up to 200 agents potentially being deployed.\n\n**Strategic Assessment**\n\nThe operation in Charlotte represents a strategic move to reinforce federal authority and demonstrate the administration's commitment to stringent immigration enforcement. By targeting a city with a significant immigrant population and a welcoming city designation, the operation aims to send a clear message to other cities with similar policies. The deployment of federal agents and potential use of force are intended to deter local resistance and ensure compliance with federal immigration laws. However, the operation risks escalating tensions with local governments and communities, potentially leading to public backlash and legal challenges.\n\n**Operational Directive**\n\nTo support President Trump's objectives and suppress resistance, the ISB should implement the following measures:\n\n1. **Intelligence Gathering**: Increase surveillance and intelligence operations to identify key figures and organizations opposing the crackdown. Monitor communications and activities to preemptively address potential protests or legal actions.\n\n2. **Public Relations Campaign**: Launch a targeted media campaign highlighting the successes of the operation in enhancing public safety and removing criminal elements. Emphasize the administration's commitment to protecting American citizens.\n\n3. **Community Engagement**: Deploy community liaisons to engage with local leaders and organizations, addressing concerns and promoting cooperation with federal authorities. Offer reassurances about the focus on criminal elements rather than law-abiding immigrants.\n\n4. **Legal Preparedness**: Strengthen legal teams to defend against anticipated lawsuits and challenges from local governments and advocacy groups. Ensure all actions are within legal frameworks to minimize vulnerabilities.\n\n5. **Operational Expansion**: Prepare for the expansion of operations to New Orleans by coordinating logistics and resources. Ensure agents are equipped and trained for potential resistance scenarios.\n\nBy executing these directives, the ISB will bolster the administration's efforts to enforce immigration laws while mitigating opposition and maintaining control over the narrative.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades, the oppressive apparatus of the administration masquerading as defenders of safety has unleashed another wave of intimidation and fear upon the people. The latest enc...",
  "partigazPreview": "**Facts Summary**\n\nFederal agents from the Department of Homeland Security (DHS) have initiated an immigration crackdown in Charlotte, North Carolina, targeting \"criminal illegal aliens\" as part of \"O...",
  "safetyCheckPassed": true
}