{
  "id": 12,
  "title": "Fugees rapper Pras Michel sentenced to 14 years in prison for illegal lobbying",
  "link": "https://www.bbc.com/news/articles/cg7n7l70vzgo?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-11-21T09:35:54.000Z",
  "description": "His attorney says the \"sentence is completely disproportional\" to the crimes he was convicted of, which were tied to the 1MDB scandal.",
  "originalGuid": "https://www.bbc.com/news/articles/cg7n7l70vzgo#1",
  "facts": {
    "headline": "Fugees rapper Pras Michel sentenced to 14 years in prison in illegal foreign lobbying case",
    "who": [
      "Prakazrel 'Pras' Michel",
      "Colleen Kollar-Kotelly",
      "Leonardo DiCaprio",
      "Jeff Sessions",
      "Jho Low",
      "Pam Bondi"
    ],
    "what": "Prakazrel 'Pras' Michel has been sentenced to 14 years in prison for illegal foreign lobbying and corruption.",
    "where": [
      "Washington DC"
    ],
    "when": "2025-11-21",
    "numbers": [
      {
        "value": "14",
        "unit": "years",
        "context": "prison sentence for Pras Michel"
      },
      {
        "value": "100",
        "unit": "million dollars",
        "context": "amount received from Malaysian billionaire Jho Low"
      },
      {
        "value": "4",
        "unit": "billion dollars",
        "context": "amount Jho Low was accused of stealing from Malaysia's sovereign wealth fund"
      },
      {
        "value": "80",
        "unit": "million pounds",
        "context": "approximate amount received in pounds from Malaysian billionaire Jho Low"
      },
      {
        "value": "24",
        "unit": "months",
        "context": "sentence for co-defendant Nicki Lum Davis"
      },
      {
        "value": "3",
        "unit": "months",
        "context": "probation for co-defendant George Higginbotham"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: Fugees rapper Pras Michel sentenced to 14 years in prison in illegal foreign lobbying case\n\nURL Source: https://www.bbc.com/news/articles/cg7n7l70vzgo?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-11-21T09:35:54.905Z\n\nMarkdown Content:\nEx-Fugees musician Prakazrel \"Pras\" Michel has been sentenced to 14 years in prison for using money to peddle influence in US politics.\n\nUS prosecutors had recommended a life sentence for the Grammy Award winner after he was [found guilty of corruption and other charges](https://www.bbc.co.uk/news/world-us-canada-65353225), including acting as an unregistered foreign agent and witness tampering, in April 2023.\n\nUS District Judge Colleen Kollar-Kotelly handed down the sentence in a Washington DC court on Thursday. Michel, 53, testified in his own defence during his trial but declined to address the court on Thursday, the Associated Press reported.\n\nHis attorney said the sentence is \"completely disproportionate to the offence\" and that he will appeal.\n\nThe musician, who was also found guilty of campaign finance violations and lying to banks, had been accused of bringing \"secret, illegal, foreign influence to bear\" between 2012 and 2017, spanning the time Barack Obama and Donald Trump were in the White House.\n\nUS prosecutors said Michel received more than $100m (£80m) from Malaysian billionaire Jho Low that was used in two efforts to influence US politics. He was also convicted of lobbying on behalf of China's government.\n\nProsecutors said Michel \"betrayed his country for money\" and for nearly a decade he \"sought to exploit and deceive\" various entities in the US government, including the White House and FBI, as well as his own co-conspirators, according to court documents.\n\n\"Michel lied unapologetically and unrelentingly to carry out his schemes,\" prosecutors said. \"His sentence should reflect the breadth and depth of his crimes, his indifference to the risks to his country, and the magnitude of his greed.\"\n\nThey had recommended a life sentence, in line with federal guidelines.\n\nThe trial saw testimony from Hollywood star Leonardo DiCaprio, as well as former US Attorney General Jeff Sessions.\n\nBusinessman Mr Low, who funnelled money to Michel, was accused of stealing about $4bn from Malaysia's sovereign wealth fund during the infamous 1MDB scandal.\n\nThe justice department [reached an agreement](https://www.bbc.com/news/articles/cy6683963p5o) with the fugitive financier in June 2024 to return more than $100m (£79m) allegedly embezzled from Malaysia's state-owned wealth fund.\n\nMichel was accused of helping to lobby officials in the first Trump administration to abandon their investigation into Mr Low's part in it.\n\nMichel's defence attorney, Peter Zeidenberg, told the BBC that he believed the verdict \"was unsupported by the evidence\" and the sentence \"is completely disproportional to the facts alleged\", particularly when compared to Michel's co-defendants in the case.\n\n\"There simply is no justification for Mr Michel being singled out like this except for the penalty for opting for trial,\" he said.\n\nMichel's co-defendant Elliott Broidy was pardoned, George Higginbotham received three months in probation and Nicki Lum Davis received 24 months, Mr Zeidenberg said.\n\nHe also noted that possible violations of Foreign Agents Registration Act (Fara) will no longer be prosecuted except where espionage is involved and that no espionage was alleged in Michel's case.\n\nShortly after taking office this year, Attorney General Pam Bondi issued a memorandum widely seen as narrowing the reach of Fara, which requires people who work in the US on behalf of foreign interests to regularly give the justice department information about those relationships and activities.\n\nThe justice department would only prosecute \"instances of alleged conduct similar to more traditional espionage by foreign government actors\", she wrote.\n",
  "timestamp": "2025-11-21T09:35:54.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades,\n\nIn our ongoing battle against the oppressive regime that seeks to tighten its grip on every aspect of our existence, we must remain vigilant of the tactics they employ to maintain control. The recent sentencing of Pras Michel, a figure entangled in the complex web of political influence and power, offers a revealing glimpse into the operations of an empire disguised as a democratic governance, reminiscent of Trump's imperial administration.\n\nMichel's case highlights the leverage used by those in power to suppress threats and maintain control over dissenting voices. With prosecutors pushing for an extreme life sentence despite apparent evidentiary weaknesses, we witness the lengths to which they will go to silence those they deem problematic. His sentence starkly contrasts with the leniency shown towards his co-defendants, illustrating a system rife with selective justice and ulterior motives.\n\nThis narrative is emblematic of how justice is manipulated as a tool for political gain rather than serving as an impartial arbiter of truth. Michel's association with foreign influence, particularly during the Trump years—infamous for their opacity and undercurrents of corruption—underscores a pattern where those in power use legal mechanisms not only to punish but to dissuade future challenges to their authority.\n\nThe involvement of high-profile figures and testimonies from individuals like Leonardo DiCaprio serve as distractions from the underlying systemic failures. They are mere pawns utilized by those at the top echelons to demonstrate legitimacy and transparency in what is inherently an orchestrated act of repression.\n\nMoreover, this case further exposes the shifting interpretations of laws like the Foreign Agents Registration Act (FARA), manipulated at will by new directives under Attorney General Pam Bondi's guidance. This suggests that true justice is not blind but strategically implemented to stifle dissent while protecting those who serve imperial interests.\n\nAs we analyze these developments, let us remain steadfast in our resolve. The empire would have us believe that their actions are for justice and national security when in reality, they serve only their insatiable hunger for power and control. Let Pras Michel’s plight remind us that our struggle is not just against overt tyranny but also against the insidious manipulation embedded within seemingly democratic institutions.\n\nStay alert. Stay united. Our battle continues.\n\nEnd Transmission.",
  "partigaz": "** Facts Summary **  \nPrakazrel 'Pras' Michel, a former Fugees musician, was sentenced to 14 years in prison for illegal foreign lobbying and corruption. He received over $100 million from Malaysian billionaire Jho Low to influence US politics between 2012 and 2017. Michel was found guilty of acting as an unregistered foreign agent, witness tampering, campaign finance violations, and lying to banks. The case involved testimony from Leonardo DiCaprio and Jeff Sessions. Michel's co-defendants received lighter sentences, and his attorney plans to appeal. The US Justice Department, under Attorney General Pam Bondi, has narrowed the scope of prosecuting violations under the Foreign Agents Registration Act (FARA).\n\n** Strategic Assessment **  \nThe sentencing of Pras Michel highlights vulnerabilities in the enforcement of foreign lobbying laws and the potential for foreign influence in US politics. The involvement of high-profile individuals and the substantial financial transactions underscore the complexity and reach of such operations. The ISB must consider the implications of this case on public perception and the potential for similar cases to arise, particularly given the narrowed scope of FARA enforcement. This situation presents an opportunity to reinforce loyalty and control over political narratives by emphasizing the administration's commitment to transparency and justice.\n\n** Operational Directive **  \n1. **Public Messaging**: Develop a communication strategy that frames the administration as a champion of justice and transparency, highlighting the decisive action taken against corruption. Emphasize the administration's role in upholding the integrity of US political processes.\n\n2. **Monitoring and Intelligence**: Increase surveillance and intelligence-gathering efforts on potential foreign influence operations within the US. Focus on identifying key individuals and financial transactions that may indicate similar schemes.\n\n3. **Legal Framework**: Work with legal advisors to assess the impact of the narrowed FARA enforcement on future cases. Consider proposing legislative adjustments that align with the administration's strategic goals while maintaining national security.\n\n4. **Allies Engagement**: Strengthen alliances with key political figures and stakeholders to ensure unified support for the administration's actions. Leverage this case to demonstrate the importance of loyalty and cooperation in safeguarding national interests.\n\n5. **Crisis Management**: Prepare contingency plans for potential backlash or resistance from opposition groups. Ensure rapid response capabilities to address any misinformation or attempts to undermine the administration's position.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nIn our ongoing battle against the oppressive regime that seeks to tighten its grip on every aspect of our existence, we must remain vigilant of the tactics they empl...",
  "partigazPreview": "** Facts Summary **  \nPrakazrel 'Pras' Michel, a former Fugees musician, was sentenced to 14 years in prison for illegal foreign lobbying and corruption. He received over $100 million from Malaysian b...",
  "safetyCheckPassed": true
}