{
  "id": 14,
  "title": "What happens next for Marjorie Taylor Greene after exit from Congress?",
  "link": "https://www.bbc.com/news/articles/cj4qvx08450o?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-11-25T01:38:33.000Z",
  "description": "The former Trump ally has decided to end her time in Congress early after a public fallout with the president.",
  "originalGuid": "https://www.bbc.com/news/articles/cj4qvx08450o#3",
  "facts": {
    "headline": "What happens next for Marjorie Taylor Greene after exit from Congress?",
    "who": [
      "Marjorie Taylor Greene",
      "Donald Trump",
      "Ro Khanna",
      "Kerwin Swint"
    ],
    "what": "Marjorie Taylor Greene announced her resignation from Congress effective January 5, 2026.",
    "where": [
      "Georgia",
      "US Capitol"
    ],
    "when": "2025-11-25",
    "numbers": [
      {
        "value": "5",
        "unit": "years",
        "context": "duration of Greene's time in Congress"
      },
      {
        "value": "250",
        "unit": "million",
        "context": "value of construction projects managed by Greene's company"
      },
      {
        "value": "12",
        "unit": "percent",
        "context": "Greene's poll rating mentioned by Trump"
      }
    ],
    "source": "BBC News"
  },
  "articleText": "Title: What happens next for Marjorie Taylor Greene after exit from Congress?\n\nURL Source: https://www.bbc.com/news/articles/cj4qvx08450o?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-11-25T01:38:33.537Z\n\nMarkdown Content:\n8 hours ago\n\nBrandon Drenon\n\n![Image 1: Getty Images Marjorie Taylor Greene speaks to reporters outside the US Capitol in March](https://ichef.bbci.co.uk/news/480/cpsprodpb/a83d/live/1fa66260-c9ca-11f0-8c1f-e1fe6e7ce046.jpg.webp)Getty Images\n\nMarjorie Taylor Greene's five years in Congress will come to an early end on 5 January after she unexpectedly announced her resignation following a bitter rift with President Donald Trump.\n\nThe surprise move from the Georgia congresswoman - a rising star in the Republican party - has left many speculating about her next steps.\n\nHer decision follows a public fallout with Trump, who branded her \"a traitor\" and said he would endorse her opponent in next year's election.\n\nIt comes after months of Greene's blistering criticism on the Trump administration's refusal to release files related to the investigation into the late sex trafficker Jeffrey Epstein - as well as several of Trump's policy positions.\n\nRumours have already begun circulating that Greene, 51, might run for president in 2028, which she immediately shot down. So, if not the Oval Office, what is next for Greene?\n\nRun for president in 2028\n-------------------------\n\nAlthough she claims she has no interest in the presidency now, having a future change of heart is not an unknown feature of US politics.\n\nWhen Greene signed a petition to force a vote requiring the release of the files related to Epstein - over Trump's objections - it went on to a bill authored by her Democratic colleague, Ro Khanna.\n\nKhanna told NBC News after Greene's latest announcement that she was \"likely to be a formidable 2028 candidate\", adding that she was \"more in touch\" with Trump's base than his number two, Vice-President JD Vance.\n\nTime Magazine also reported that Greene \"privately told allies\" she was considering a presidential bid, but Greene quickly dismissed the assertion as a \"complete lie\".\n\n\"I'm not running for President and never said I wanted to and have only laughed about it when anyone would mention it,\" Greene wrote on social media, re-posting Time Magazine's article.\n\nGreene has notably distanced herself from her party's positions - and from the president - for whom she once was an ardent supporter.\n\nShe has spoken out against issues including Epstein files, Trump's global tariffs, support for Israel and healthcare funding.\n\nA possible run for governor or Senate\n-------------------------------------\n\nGreene has not been quite as explicit about ruling out the possibility of running for Georgia governor or to represent her state in the US Senate.\n\nElections for both take place in 2026.\n\nTwo-time Republican Georgia Governor Brian Kemp is up against his term limit and unable to run again, widening the field of possible replacements.\n\nGreene could also use her clout to pursue the race for the US Senate and attempt to unseat Democrat Jon Ossoff, who is up for re-election next year.\n\nBoth the role of governor and US senator are ones that Greene has expressed interest in, at least according to Trump.\n\nIn the president's public spat with Greene following her resignation announcement, Trump wrote on social media that the feud began \"when I sent her a Poll stating that she should not run for Senator, or Governor\".\n\n\"She was at 12%, and didn't have a chance (unless, of course, she had my Endorsement — which she wasn't about to get!)\", he said.\n\nKennesaw State University Professor of Political Science Kerwin Swint, who lives in Greene's congressional district, says that Trump is aware of her unpopularity outside of her immediate district, and that she would probably \"get obliterated\" if she ran for statewide office.\n\nWithout those options, the only other office she may have her sights on is president, despite her protestations.\n\n\"I don't see that happening,\" Swint says. \"She would be such an amazing longshot to dark horse.\n\n\"But most politicians have a big enough ego that they look in the mirror, they see a future president. So it's not out of the question.\"\n\nEntering the conservative media landscape\n-----------------------------------------\n\nSwint predicts that she'll start a podcast and attempt to remain in the public spotlight by continuing to build her media profile.\n\n\"I think she wants to be an influencer basically. And so I think someone who wants to do that is going to reach for these media opportunities,\" he says.\n\nIf she chooses a life outside of politics, Greene would join a host of former politicians and political operatives who have launched careers in the podcast arena.\n\nAfter Republican Representative Matt Gaetz resigned from Congress to accept his failed nomination to become Trump's US attorney general, he started his own podcast.\n\nThe trend has even caught hold on the left, with Democrats like California Governor Gavin Newsom also hosting his own podcast.\n\nMeanwhile, FBI deputy director Dan Bongino went on to join the Trump administration after success as a radio host and commentator.\n\nGreene could also decide to become a conservative commentator on more left-leaning networks, like CNN, where she has made frequent appearances in recent days.\n\n\"I knew she was going to be the next co-host of The View!\", conservative personality Megan McCain wrote on X, referring to Greene's recent appearance on ABC's liberal-leaning daily chat show.\n\nLeave politics behind completely\n--------------------------------\n\nIn the 10-minute video announcing her resignation, Greene also suggested she might leave politics to spend more time with her family who she said she missed \"precious time with\" as she fought for Trump.\n\nThroughout her time in politics, Greene said, she faced \"never ending personal attacks\" and \"threats\".\n\n\"It has been unfair and wrong, not only to me, but especially to my family,\" she said.\n\nSince her public feud with the president, Greene said the threats against her have only increased.\n\nIn addition to being a member of Congress, Greene is also the owner of a commercial construction and renovation company called Taylor Commercial.\n\nThe company has managed roughly $250m in construction projects, since Greene acquired it in 2002, according to her website.\n\n_With reporting by Max Matza_\n",
  "timestamp": "2025-11-25T01:38:33.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades,\n\nThe recent announcement of Marjorie Taylor Greene's early resignation from Congress has sent ripples through the political landscape. Once a staunch ally of the Trump administration, her departure marks another crack in the facade of the Empire-like control exerted by those in power. Greene's fall from grace, catalyzed by her public criticism of the administration's policies and its secretive nature concerning investigations like that of Jeffrey Epstein, highlights the unstable foundation upon which the current regime stands.\n\nHer departure is a poignant reminder of the dangers faced by those who dare to question authority. Greene's outspokenness against key policy decisions—such as global tariffs and healthcare funding—aligns with our core belief that transparency and accountability must be demanded at all levels of governance. The Empire's attempts to silence dissent are evident in Trump's branding of Greene as \"a traitor\" and his efforts to undermine her future political endeavors.\n\nDespite these setbacks, rumors suggest that Greene may still have ambitions for higher office, although these remain unconfirmed. Her potential candidacy for governor or senator could challenge the current dynamics within her party, illuminating internal divisions that weaken their unified front.\n\nFurthermore, Greene's possible venture into conservative media exemplifies how former political figures can continue to wield influence outside traditional office structures. As more individuals transition into media roles, they create platforms to further spread messages challenging imperial authority.\n\nGreene's story underscores what we have always known: those in power will go to great lengths to retain control and suppress opposition voices. Yet, every act of defiance—no matter how small—can inspire others to resist tyranny and demand justice.\n\nStay vigilant and keep resistance alive.\n\nEnd transmission.",
  "partigaz": "** Facts Summary **  \nMarjorie Taylor Greene announced her resignation from Congress effective January 5, 2026, following a public fallout with President Donald Trump. Greene, who served five years in Congress, criticized Trump's administration over the handling of Jeffrey Epstein investigation files and other policy positions. Trump labeled her a \"traitor\" and stated he would endorse her opponent in the next election. Speculation surrounds Greene's future, with possibilities including a run for governor or Senate in Georgia, or entering the media landscape. Greene has denied interest in a presidential run in 2028. She also mentioned the possibility of leaving politics to focus on her family and her construction business.\n\n** Strategic Assessment **  \nThe resignation of Marjorie Taylor Greene presents both a challenge and an opportunity for the ISB under Trump's leadership. Her departure removes a vocal critic from within the ranks, potentially stabilizing internal party dynamics. However, her influence and potential media presence could galvanize opposition factions or create alternative power centers that challenge Trump's authority. Greene's ability to connect with Trump's base poses a risk if she chooses to leverage this support against the administration's objectives.\n\n** Operational Directive **  \nTo mitigate potential threats and capitalize on this transition, the ISB should implement the following measures:  \n1. **Monitor and Influence Media Narratives**: Ensure that media coverage of Greene's resignation and future endeavors aligns with the administration's narrative. Utilize friendly media outlets to emphasize her departure as a necessary step for party unity and progress.\n   \n2. **Neutralize Potential Political Threats**: Strategically support candidates for the Georgia governor and Senate races who align closely with Trump's policies and can effectively counter any influence Greene might wield in these arenas.\n\n3. **Engage and Solidify Base Support**: Reinforce loyalty among Trump's base by highlighting achievements and policy successes, while subtly discrediting Greene's criticisms as misguided or self-serving.\n\n4. **Leverage Intelligence Operations**: Utilize intelligence resources to gather insights on Greene's plans and alliances. This will enable preemptive actions to counter any moves that could undermine Trump's agenda.\n\n5. **Promote Alternative Voices**: Elevate other influential figures within the party who can fill the void left by Greene and maintain cohesion among supporters.\n\nBy executing these directives, the ISB will support Donald Trump in maintaining control over the party and suppressing any emerging resistance.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe recent announcement of Marjorie Taylor Greene's early resignation from Congress has sent ripples through the political landscape. Once a staunch ally of the Trum...",
  "partigazPreview": "** Facts Summary **  \nMarjorie Taylor Greene announced her resignation from Congress effective January 5, 2026, following a public fallout with President Donald Trump. Greene, who served five years in...",
  "safetyCheckPassed": true
}