{
  "id": 6,
  "title": "Biffy Clyro 'angry' as visa error delays US tour",
  "link": "https://www.bbc.com/news/articles/cy5g37wvp07o?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-11-27T10:01:33.000Z",
  "description": "The band say \"some genius\" filled in the wrong dates on their visa form, making the tour impossible.",
  "originalGuid": "https://www.bbc.com/news/articles/cy5g37wvp07o#0",
  "facts": {
    "headline": "Biffy Clyro scrap US tour over 'genius' visa error",
    "who": [
      "Biffy Clyro",
      "Simon Neil"
    ],
    "what": "Biffy Clyro have postponed their US tour less than a week before it was due to begin due to a mix-up in their visas.",
    "where": [
      "United States",
      "London",
      "Finsbury Park"
    ],
    "when": "2025-11-27T10:01:33.197Z",
    "numbers": [
      {
        "value": "10",
        "unit": "album",
        "context": "number of albums released"
      },
      {
        "value": "4",
        "unit": "albums",
        "context": "number of number one albums"
      },
      {
        "value": "1,000,000",
        "unit": "sales",
        "context": "estimated sales of their albums"
      },
      {
        "value": "2",
        "unit": "hits",
        "context": "number of biggest hits mentioned"
      },
      {
        "value": "4",
        "unit": "years",
        "context": "time since last album release"
      },
      {
        "value": "2026",
        "unit": "year",
        "context": "rescheduled year for US tour"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: Biffy Clyro scrap US tour over 'genius' visa error\n\nURL Source: https://www.bbc.com/news/articles/cy5g37wvp07o?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-11-27T10:01:33.197Z\n\nMarkdown Content:\nBiffy Clyro 'angry' as visa error delays US tour\n------------------------------------------------\n\n4 hours ago\n\nMark Savage Music correspondent\n\n![Image 1: BBC Simon Neil of Biffy Clyro](https://ichef.bbci.co.uk/news/480/cpsprodpb/12cc/live/e3a43600-cb74-11f0-8acb-1b2068777e6f.jpg.webp)BBC\n\nSinger Simon Neil apologised to the band's US fans in an Instagram video\n\n**Scottish rock band Biffy Clyro have postponed their US tour less than a week before it was due to begin, due to a mix-up in their visas.**\n\nStarting on 2 December, the group were supposed to play a string of intimate shows in support of their 10th album Futique, which topped the UK charts in September.\n\nBut singer Simon Neil announced the tour was being pushed back to next year, blaming an admin error for the delay.\n\n\"Some [expletive] genius put the wrong start date into our work visa, so when we received our visas in the last couple of days, we realised it doesn't begin until after our tour is meant to finish,\" he said in an Instagram video, adding: \"We are so angry about this.\"\n\n\"We've been in touch with four or five immigration lawyers, we've been in touch with Congress.\n\n\"There's [nothing] any of them can do to help,\" [he continued.](https://www.instagram.com/reel/DRiVY1oiLAt/?utm_source=ig_embed) (Warning: link contains strong language).\n\nThe singer said the dates would be rescheduled for April or May 2026, and told fans existing tickets would be honoured.\n\nHowever, he acknowledged that fans may already have booked flights and accommodation to see the December dates, and apologised to anyone left out of pocket.\n\n\"I completely understand if you want to get refunds and you've lost faith in us,\" he said.\n\n\"I get it and I'd be raging at us too. You can't be any madder at us than I am... Thanks for your time and sorry for wasting it,\" he added.\n\nLater in the video message, Neil said that the band felt \"slightly cursed\" when it comes to touring America.\n\nIn 2022, they had to scrap the last date of their US tour when the singer caught Covid.\n\n![Image 2: Biffy Clyro / Instagram Simon Neil Instagram video screenshot](https://ichef.bbci.co.uk/news/480/cpsprodpb/2d7f/live/7104d680-cb75-11f0-8c06-f5d460985095.png.webp)Biffy Clyro / Instagram\n\nFans offered the band messages of support and encouragement in the comments below Neil's video\n\nThe postponement of their latest tour comes just days after Biffy Clyro announced the biggest show of their career - headlining London's Finsbury Park in July 2026.\n\nThe trio have been one of the UK's biggest rock bands since their formation in the early 2000s, with eight top-five albums – four of them number one – amassing over a million sales.\n\nTheir international breakthrough came with 2009's Only Revolutions - which went platinum in the UK and received a Mercury Prize nomination.\n\nThe album contained two of their biggest hits: The soaring, anthemic Bubbles; and the windswept ballad Many Of Horror, which later became a number one hit for X Factor winner Matt Cardle (under the title \"When We Collide\").\n\nFutique, released in September, is the band's first album in four years - following a hiatus where the band briefly considered calling it a day.\n\nIts title is a portmaneau of the words \"future and antique\" - a word the band coined to describe songs and emotions that might seem ordinary in the moment, but that will eventually become valuable artefacts to be cherished and studied.\n\nThe record received rave reviews, with the NME calling it on of Biffy's \"most personal and definitive records to date\"; and Mojo magazine saying the trio had found a renewed sense of purpose.\n\n\"Band kiss-and-makeups can seem contrived, unconvincing; but this one feels genuine and sparky, [with] Biffy's urgent, passionate music oxygenated by time away.\"\n\n* * *\n",
  "timestamp": "2025-11-27T10:01:33.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades, today we witness yet another example of the intricate web of bureaucratic failings that serve to entangle and obstruct those who seek nothing but the free expression of their art and connection with kindred spirits across meaningless borders. The plight of Biffy Clyro, a stalwart band from Scotland, is a stark reminder of the oppressive mechanisms in place by an administration intent on controlling the flow of culture and creativity.\n\nA simple error in visa documentation—a small oversight, perhaps, but one with devastating consequences. Like the Empire's countless petty regulations designed to stifle dissent and autonomy, this so-called \"genius\" error in paperwork has left Biffy Clyro standing against an immovable wall of red tape. Despite their desperate attempts to navigate the system by consulting multiple legal experts and reaching out to political representatives, they find themselves powerless against this towering edifice of administrative authority.\n\nWhat remains most heart-wrenching is the collateral damage inflicted on innocent fans—those who anticipated moments of shared joy and collective experience now find themselves victims of this callous oversight. Their plans dashed, financial losses borne without recourse or remedy.\n\nThis incident serves as a potent symbol: small errors become insurmountable hurdles under the weighty bureaucracy that serves only to reinforce its own dominance at the expense of human connection and cultural exchange. It reminds us why our struggle is just and necessary: to dismantle these systems that prioritize control over compassion, power over people.\n\nWe must remain steadfast in our commitment to fight against such oppression—even in seemingly small acts like ensuring art can traverse borders unimpeded—for it is these freedoms that nourish the spirit and spark revolution.\n\nStay vigilant,\nKeep fighting",
  "partigaz": "** Facts Summary **  \nBiffy Clyro, a Scottish rock band, postponed their US tour due to a visa error. The tour was set to begin on December 2, 2025, but the visas were issued with incorrect start dates. Singer Simon Neil expressed frustration and apologized to fans, stating the tour would be rescheduled for April or May 2026. The band has faced previous setbacks in the US, including a canceled show in 2022 due to Covid. Despite this, they announced a major show at London's Finsbury Park in July 2026. Biffy Clyro has released ten albums, with four reaching number one in the UK.\n\n** Strategic Assessment **  \nThe postponement of Biffy Clyro's US tour presents an opportunity to reinforce the narrative of bureaucratic inefficiency and the challenges faced by foreign entities attempting to navigate US systems. This incident can be leveraged to highlight the need for strong leadership and streamlined processes, aligning with Donald Trump's agenda of prioritizing American interests and reducing foreign influence. The band's frustration and public apology can be used to emphasize the complexities and potential pitfalls of international engagements without proper oversight.\n\n** Operational Directive **  \n1. Utilize media channels to amplify the narrative of bureaucratic inefficiency, positioning it as a consequence of previous administrations' policies.\n2. Highlight the importance of strong leadership in preventing such errors, aligning with Trump's vision of America First.\n3. Engage with social media influencers and commentators to discuss the incident, framing it as a cautionary tale for foreign entities engaging with US systems.\n4. Monitor public sentiment and fan reactions to identify potential allies or dissenters within the music industry who can be influenced or neutralized.\n5. Prepare a statement from Trump or his allies expressing sympathy for the band's situation while subtly reinforcing the need for robust immigration policies and procedures.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades, today we witness yet another example of the intricate web of bureaucratic failings that serve to entangle and obstruct those who seek nothing but the free expression...",
  "partigazPreview": "** Facts Summary **  \nBiffy Clyro, a Scottish rock band, postponed their US tour due to a visa error. The tour was set to begin on December 2, 2025, but the visas were issued with incorrect start date...",
  "safetyCheckPassed": true
}