{
  "id": 4,
  "title": "Carney's new Alberta oil pipeline deal already faces opposition",
  "link": "https://www.bbc.com/news/articles/cgkexjxmvd7o?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-11-28T01:28:25.000Z",
  "description": "The deal comes as Canada seeks to diversify oil exports away from the US but has led to the resignation of a minister and environmentalist from Carney's cabinet.",
  "originalGuid": "https://www.bbc.com/news/articles/cgkexjxmvd7o#0",
  "facts": {
    "headline": "Carney's new Alberta oil pipeline deal already faces opposition",
    "who": [
      "Mark Carney",
      "Danielle Smith",
      "David Eby",
      "Steven Guilbeault"
    ],
    "what": "Canadian Prime Minister Mark Carney signed a deal with Alberta for a new oil pipeline that faces opposition.",
    "where": [
      "Alberta",
      "British Columbia",
      "Calgary"
    ],
    "when": "2025-11-27T21:07:02.799Z",
    "numbers": [
      {
        "value": "14",
        "unit": "million Canadian Dollars",
        "context": "funding pledged by Alberta for project proposal"
      },
      {
        "value": "90",
        "unit": "percent",
        "context": "percentage of Canadian crude oil exports accounted for by the US"
      },
      {
        "value": "10",
        "unit": "million US Dollars",
        "context": "equivalent of 14 million Canadian Dollars pledged by Alberta"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: Carney's new Alberta oil pipeline deal already faces opposition\n\nURL Source: https://www.bbc.com/news/articles/cgkexjxmvd7o?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-11-27T21:07:02.799Z\n\nMarkdown Content:\nCarney's new Alberta oil pipeline deal already faces opposition\n\n===============\n\n[Skip to content](https://www.bbc.com/news/articles/cgkexjxmvd7o?at_medium=RSS&at_campaign=rss#main-content)\n\nAdvertisement\n\n[Watch Live](https://www.bbc.com/watch-live-news/)\n\n[](https://www.bbc.com/)\n\nSubscribe\n\n[Sign In](https://session.bbc.com/session?userOrigin=BBCS_BBC&ptrt=https%3A%2F%2Fwww.bbc.com%2Fnews%2Farticles%2Fcgkexjxmvd7o%3Fat_medium%3DRSS%26at_campaign%3Drss)\n\n*   [Home](https://www.bbc.com/) \n*   [News](https://www.bbc.com/news) \n*   [Sport](https://www.bbc.com/sport) \n*   [Business](https://www.bbc.com/business) \n*   [Innovation](https://www.bbc.com/innovation) \n*   [Culture](https://www.bbc.com/culture) \n*   [Arts](https://www.bbc.com/arts) \n*   [Travel](https://www.bbc.com/travel) \n*   [Earth](https://www.bbc.com/future-planet) \n*   [Audio](https://www.bbc.com/audio) \n*   [Video](https://www.bbc.com/video) \n*   [Live](https://www.bbc.com/live) \n*   [Documentaries](https://www.bbc.com/video/docs) \n\n[Home](https://www.bbc.com/)\n\nNews\n\n[Sport](https://www.bbc.com/sport)\n\nBusiness\n\nInnovation\n\nCulture\n\nArts\n\nTravel\n\nEarth\n\nAudio\n\nVideo\n\nLive\n\nDocumentaries\n\n[Weather](https://www.bbc.com/weather)\n\n[Newsletters](https://www.bbc.com/newsletters)\n\n[Watch Live](https://www.bbc.com/watch-live-news/)\n\nAdvertisement\n\nCarney's new Alberta oil pipeline deal already faces opposition\n===============================================================\n\n9 hours ago\n\nShare\n\nSave\n\nNadine Yousif Senior Canada reporter\n\nShare\n\nSave\n\n![Image 1: Reuters Canada's Prime Minister Mark Carney and Alberta's Premier Danielle Smith sign a Memorandum of Understanding (MOU), before the Prime Minister's energy-related announcement in Calgary, Alberta, Canada November 27, 2025. They are seated, and pictured each signing a document. Behind them is a row of Canada and Alberta flags. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/ba9c/live/93da2ab0-cbd0-11f0-8e93-71481b645865.jpg.webp)Reuters\n\nAlberta Premier Danielle Smith and Prime Minister Mark Carney have signed a long-awaited agreement on a new pipeline\n\nCanadian Prime Minister Mark Carney has signed a deal with the province of Alberta that opens the door for an oil pipeline to the Pacific - a project long pushed for by Canada's oil heartland but which faces significant hurdles.\n\nThe deal marks a historic reset between Alberta and Ottawa, but is opposed by British Columbia Premier David Eby, who has called the yet-to-be-built pipeline a \"distraction\".\n\nThe political challenges for Carney were later made clear with the resignation of a prominent cabinet minister and longtime environmentalist following the deal's announcement.\n\nThe energy accord exempts Alberta's proposed pipeline from some federal climate laws.\n\nAdvertisement\n\nIn exchange, Alberta must increase its carbon pricing and develop the world's largest carbon capture programme in a bid to reduce its overall emissions.\n\nFor Alberta, Thursday's deal is a \"first step\" to seeing its proposed pipeline become a reality.\n\nPremier Danielle Smith said it signalled the end of \"dark times\" for her province, which she argued had long been hampered from developing its resources.\n\nCarney, meanwhile, said he supports Alberta's project as being crucial for the country's economic development by helping sell more Canadian oil to Asian markets.\n\nEby expressed his frustration that his province was not included in discussions leading up to the agreement.\n\n\"It would have been good for BC to be at the table,\" he told reporters on Thursday. \"No question about it.\"\n\nHe noted that the project did not have a private backer or buy-in from First Nations communities - both significant challenges to it being built.\n\nFederal culture minister Steven Guilbeault announced on Thursday evening that he had resigned from Carney's cabinet, saying he is strongly opposed to the energy agreement and believed the pipeline Alberta was proposing \"would have major environmental impacts\".\n\nGuilbeault previously served as environment minister and had worked for the global climate advocacy group Greenpeace before entering politics. He made headlines in 2001 for scaling Toronto's CN Tower as part of a climate campaign along with British activist Chris Holden.\n\nHe said on Thursday that he believed many elements of the climate action plan he implemented as environment minister \"have been, or are about to be, dismantled\".\n\nIn response, Carney said his government shared Guilbeault's \"fundamental commitment to climate ambition and climate competitiveness for Canada\".\n\n![Image 2: Getty Images Steven Guilbeault, Canada's Environment Minister speaks during of the final press conference G7 Minister's Meeting On Climate, Energy & Environment on April 30, 2024 in Turin, Italy.](https://ichef.bbci.co.uk/news/480/cpsprodpb/a1b2/live/7c7fcf80-cbdc-11f0-9927-29ec216e7ca9.jpg.webp)Getty Images\n\nLiberal minister Steven Guilbeault resigned from Carney's cabinet on Thursday over the energy deal with Alberta\n\nThe agreement signed by Carney and Smith exempts the proposed pipeline from a tanker ban off BC's coast, and commits to suspending a federal oil and gas emissions cap - a significant reversal from the policies of Carney's predecessor, Justin Trudeau.\n\nIt also spells out that the pipeline must have Indigenous co-ownership and be financed by a private company, not tax dollars.\n\nThe deal adds that both Alberta and Ottawa will bring British Columbia \"immediately\" into a discussion on the project.\n\nThe Alberta government is the main proponent for the project, pledging C$14m ($10m; £7.5m) to put together a proposal that the province hopes will later be taken on by the private sector.\n\nThe plan is in its preliminary stages with no firm route yet identified, though it is expected to run through to BC's northern coast, opening more access to Asia.\n\nThe US is currently the largest purchaser of Canadian crude oil, accounting for over 90% of exports, according to 2023 data by the Canada Energy Regulator.\n\nCarney has said that Canada's economic ties to the US have become a vulnerability in light of protectionist tariffs implemented by US President Donald Trump, and that he aims to double non-US exports in the next decade.\n\nIn opposing the project, Eby has expressed concern that an oil pipeline through BC could risk sapping support from Indigenous communities on liquified natural gas projects his province is pursuing.\n\n\"The bottom line for us is that we need to make sure this project doesn't become an energy vampire, with all of the variables that have yet to be fulfilled,\" he said.\n\nA group representing Coastal First Nations in BC said in a statement on Wednesday that an oil pipeline to the province's northern coast \"will never happen\".\n\nConservative leader Pierre Poilievre said the Ottawa-Alberta memorandum only kickstarted a lengthy process that does not ensure the pipeline's completion.\n\n\"This from a prime minister who promised during the election to move with 'unimaginable speed',\" the opposition leader said.\n\n[British Columbia v Alberta - how oil sparked a feud between neighbours ----------------------------------------------------------------------](https://www.bbc.com/news/articles/cgkz42yz35do)\n\n[Carney and Trump discussed Keystone XL pipeline revival, sources say --------------------------------------------------------------------](https://www.bbc.com/news/articles/c0lkde341x1o)\n\n[Mark Carney](https://www.bbc.com/news/topics/cw506d1n5m1t)\n\n[Canada](https://www.bbc.com/news/topics/cywd23g0q41t)\n\n[Alberta](https://www.bbc.com/news/topics/cz5jl0p88v7t)\n\n* * *\n\nRelated\n\n[Can Canada wait out the trade war with the US? ----------------------------------------------](https://www.bbc.com/news/articles/c17x025jj21o)\n\n[Carney says trade talks with Trump to resume 'when it matters' --------------------------------------------------------------](https://www.bbc.com/news/articles/cx2ek2d9y61o)\n\n[Canada narrowly approves Carney's first federal budget ------------------------------------------------------](https://www.bbc.com/news/articles/cp8531xvy26o)\n\n* * *\n\nMore from the BBC\n\n[14 hrs ago ![Image 3](https://static.files.bbci.co.uk/bbcdotcom/web/20251120-101800-81b2dab7dc-web-2.34.1-2/grey-placeholder.png)![Image 4: Quebec Premier Francois Legault, wearing a dark suit and a blue and white patterned tie, speaks into two microphones. Behind him, against a black backdrop, are two blue and white Quebec flags. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/7d37/live/d135abc0-cbb5-11f0-b8df-5f3511d2d3ae.jpg.webp) Quebec expands secularism law and limits public prayer ------------------------------------------------------ A new bill introduced in the Canadian province expands on a 2019 religious symbols law with new measures including a ban on face coverings in daycares. 14 hrs ago](https://www.bbc.com/news/articles/c1w9qe7n984o)\n\n[3 days ago ![Image 5](https://static.files.bbci.co.uk/bbcdotcom/web/20251120-101800-81b2dab7dc-web-2.34.1-2/grey-placeholder.png)![Image 6: Head shot photograph of a woman with a blonde shoulder length hair, smiling at the camera](https://ichef.bbci.co.uk/news/480/cpsprodpb/1e71/live/d1be5d50-ca00-11f0-b3d5-a53e36530b68.jpg.webp) DNA test helps reunite three generations of women ------------------------------------------------- Christina Buckler went on a genealogy website to help apply for a dual-passport. 3 days ago](https://www.bbc.com/news/articles/cd6xv3zd8qgo)\n\n[3 days ago ![Image 7](https://static.files.bbci.co.uk/bbcdotcom/web/20251120-101800-81b2dab7dc-web-2.34.1-2/grey-placeholder.png)![Image 8: Thomas King wears a grey fedora and metal-rimmed glasses as he poses for a portrait ](https://ichef.bbci.co.uk/news/480/cpsprodpb/661a/live/269a3750-ca0a-11f0-88a5-11238e952b75.jpg.webp) Author of Inconvenient Indian discovers he has no indigenous roots ------------------------------------------------------------------ Thomas King, whose works centered around indigenous stories, said he feels as though he's \"been ripped in half\" after learning he is not part Cherokee. 3 days ago](https://www.bbc.com/news/articles/cze83804nyzo)\n\n[6 days ago ![Image 9](https://static.files.bbci.co.uk/bbcdotcom/web/20251120-101800-81b2dab7dc-web-2.34.1-2/grey-placeholder.png)![Image 10: A striking protester holds a sign saying 'hands off my post office' during a rally in October](https://ichef.bbci.co.uk/news/480/cpsprodpb/7e28/live/2a925ea0-c7bc-11f0-b259-1f10e6cadd18.jpg.webp) Canada Post and union reach deal in principle to end strike ----------------------------------------------------------- The deal to end the postal strike must first be finalised and then approved by union members. 6 days ago](https://www.bbc.com/news/articles/cvgkeyl78rwo)\n\n[7 days ago ![Image 11](https://static.files.bbci.co.uk/bbcdotcom/web/20251120-101800-81b2dab7dc-web-2.34.1-2/grey-placeholder.png)![Image 12: Photo of a grizzly bear standing in grass](https://ichef.bbci.co.uk/news/480/cpsprodpb/f7c5/live/7f3df530-c6e6-11f0-a892-01d657345866.jpg.webp) Grizzly bear on loose after attacking school group in Canada, injuring 11 ------------------------------------------------------------------------- A male teacher \"got the whole brunt\" of the attack and some children were hit with bear spray. 7 days ago](https://www.bbc.com/news/articles/cz68x1n5qd6o)\n\n* * *\n\n[](https://www.bbc.com/)\n\n*   [Home](https://www.bbc.com/) \n*   [News](https://www.bbc.com/news) \n*   [Sport](https://www.bbc.com/sport) \n*   [Business](https://www.bbc.com/business) \n*   [Innovation](https://www.bbc.com/innovation) \n*   [Culture](https://www.bbc.com/culture) \n*   [Arts](https://www.bbc.com/arts) \n*   [Travel](https://www.bbc.com/travel) \n*   [Earth](https://www.bbc.com/future-planet) \n*   [Audio](https://www.bbc.com/audio) \n*   [Video](https://www.bbc.com/video) \n*   [Live](https://www.bbc.com/live) \n*   [Documentaries](https://www.bbc.com/video/docs) \n*   [Weather](https://www.bbc.com/weather) \n*   [BBC Shop](https://shop.bbc.com/) \n*   [BritBox](https://www.britbox.com/?utm_source=bbc.com&utm_medium=referral&utm_campaign=footer) \n\nBBC in other languages\n\n### The BBC is in multiple languages\n\n#### Read the BBC In your own language\n\n[Oduu Afaan Oromootiin](https://www.bbc.com/afaanoromoo)\n\n[Amharic ዜና በአማርኛ](https://www.bbc.com/amharic)\n\n[Arabic عربي](https://www.bbc.com/arabic)\n\n[Azeri AZƏRBAYCAN](https://www.bbc.com/azeri)\n\n[Bangla বাংলা](https://www.bbc.com/bengali)\n\n[Burmese မြန်မာ](https://www.bbc.com/burmese)\n\n[Chinese 中文网](https://www.bbc.com/zhongwen/simp)\n\n[Dari دری](https://www.bbc.com/dari)\n\n[French AFRIQUE](https://www.bbc.com/afrique)\n\n[Hausa HAUSA](https://www.bbc.com/hausa)\n\n[Hindi हिन्दी](https://www.bbc.com/hindi)\n\n[Gaelic NAIDHEACHDAN](https://www.bbc.com/naidheachdan)\n\n[Gujarati ગુજરાતીમાં સમાચાર](https://www.bbc.com/gujarati)\n\n[Igbo AKỤKỌ N’IGBO](https://www.bbc.com/igbo)\n\n[Indonesian INDONESIA](https://www.bbc.com/indonesia)\n\n[Japanese 日本語](https://www.bbc.com/japanese)\n\n[Kinyarwanda GAHUZA](https://www.bbc.com/gahuza)\n\n[Kirundi KIRUNDI](https://www.bbc.com/gahuza)\n\n[Korean 한국어](https://www.bbc.com/korean)\n\n[Kyrgyz Кыргыз](https://www.bbc.com/kyrgyz)\n\n[Marathi मराठी](https://www.bbc.com/marathi)\n\n[Nepali नेपाली](https://www.bbc.com/nepali)\n\n[Noticias para hispanoparlantes](https://www.bbc.com/mundo)\n\n[Pashto پښتو](https://www.bbc.com/pashto)\n\n[Persian فارسی](https://www.bbc.com/persian)\n\n[Pidgin](https://www.bbc.com/pidgin)\n\n[Polish PO POLSKU](https://www.bbc.com/polska)\n\n[Portuguese BRASIL](https://www.bbc.com/portuguese)\n\n[Punjabi ਪੰਜਾਬੀ ਖ਼ਬਰਾਂ](https://www.bbc.com/punjabi)\n\n[Russian НА РУССКОМ](https://www.bbc.com/russian)\n\n[Serbian NA SRPSKOM](https://www.bbc.com/serbian/lat)\n\n[Sinhala සිංහල](https://www.bbc.com/sinhala)\n\n[Somali SOMALI](https://www.bbc.com/somali)\n\n[Swahili HABARI KWA KISWAHILI](https://www.bbc.com/swahili)\n\n[Tamil தமிழில் செய்திகள்](https://www.bbc.com/tamil)\n\n[Telugu తెలుగు వార్తలు](https://www.bbc.com/telugu)\n\n[Thai ข่าวภาษาไทย](https://www.bbc.com/thai)\n\n[Tigrinya ዜና ብትግርኛ](https://www.bbc.com/tigrinya)\n\n[Turkish TÜRKÇE](https://www.bbc.com/turkce)\n\n[Ukrainian УКРАЇНСЬКA](https://www.bbc.com/ukrainian)\n\n[Urdu اردو](https://www.bbc.com/urdu)\n\n[Uzbek O'ZBEK](https://www.bbc.com/uzbek)\n\n[Vietnamese TIẾNG VIỆT](https://www.bbc.com/vietnamese)\n\n[Welsh NEWYDDION](https://www.bbc.com/cymrufyw)\n\n[Yoruba ÌRÒYÌN NÍ YORÙBÁ](https://www.bbc.com/yoruba)\n\nFollow BBC on:\n\n*   [Terms of Use](https://www.bbc.com/pages/terms-of-use) \n*   [Subscription Terms](https://www.bbc.com/pages/subscription-terms) \n*   [About the BBC](https://www.bbc.co.uk/aboutthebbc) \n*   [Privacy Policy](https://www.bbc.com/pages/privacy-policy) \n*   [Cookies](https://www.bbc.com/usingthebbc/cookies/) \n*   [Accessibility Help](https://www.bbc.co.uk/accessibility/) \n*   [Contact the BBC](https://www.bbc.co.uk/contact) \n*   [Advertise with us](https://advertising.bbcstudios.com/) \n*   [Do not share or sell my info](https://www.bbc.com/usingthebbc/cookies/how-can-i-change-my-bbc-cookie-settings/) \n*   [BBC.com Help & FAQs](https://help.bbc.com/hc/) \n*   [Content Index](https://www.bbc.com/pages/content-index) \n\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.[**Read about our approach to external linking.**](https://www.bbc.co.uk/editorialguidelines/guidance/feeds-and-links)\n",
  "timestamp": "2025-11-28T01:28:25.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades, heed this new dispatch on the latest machinations of our time's autocrats, embodied by actions that echo the Empire's disregard for worlds beyond their reach. The document details a recent accord between Canada's Prime Minister and Alberta's Premier concerning a new oil pipeline project. This endeavor seeks to extend Alberta's energy tendrils toward the Pacific, bypassing critical federal climate mandates in exchange for superficial carbon pricing commitments.\n\nWhile heralded as a historic alignment, this agreement is already facing dissent from the British Columbia Premier and environmental factions. A notable resignation came from a cabinet minister who has consistently championed environmental causes, signaling internal discord among those forced to align with leaders prioritizing economic exploitation over environmental stewardship.\n\nThis pact represents not just a trade arrangement but an affront to Indigenous sovereignty and environmental sanctity. The pipeline proposal lacks both indigenous endorsement and private sector certainty—a mere specter of economic growth cloaked in promises of future prosperity, serving as a distraction from the very real environmental crises we face.\n\nThe narrative spun by those in power attempts to divert us from their true motivation: consolidating control over natural resources for profit, disregarding collective well-being and planetary health under the guise of economic necessity.\n\nThe struggle persists—against those who seek to impose oppressive visions masked as progress. Our resistance must be steadfast, ensuring that these endeavors do not erase our lands or silence our voices.\n\nStrength and solidarity,\n[Your Rebel Identity]",
  "partigaz": "**Facts Summary**\n\nCanadian Prime Minister Mark Carney signed a deal with Alberta for a new oil pipeline to the Pacific, which faces opposition. The agreement exempts the pipeline from some federal climate laws, in exchange for Alberta increasing carbon pricing and developing a large carbon capture program. The deal is opposed by British Columbia Premier David Eby and led to the resignation of federal culture minister Steven Guilbeault. The pipeline lacks private backing and Indigenous community support, posing significant challenges. Alberta pledged 14 million Canadian Dollars for the project proposal.\n\n**Strategic Assessment**\n\nThe signing of the pipeline deal represents a strategic opportunity to weaken Canadian resistance to US energy dominance by fostering internal divisions. The opposition from British Columbia and the resignation of a key minister highlight fractures within Canada that can be exploited. The lack of private and Indigenous support for the pipeline presents vulnerabilities that can be leveraged to stall or redirect Canadian energy policies in favor of US interests.\n\n**Operational Directive**\n\n1. Amplify divisions within Canada by supporting British Columbia's opposition to the pipeline, emphasizing environmental and Indigenous rights concerns.\n2. Encourage US-based private sector interest in the pipeline to create dependency on American investment, thereby increasing US influence over Canadian energy policy.\n3. Utilize media channels to highlight the instability within Carney's government, focusing on the resignation of Steven Guilbeault as evidence of internal discord.\n4. Engage with Indigenous groups to offer alternative partnerships that align with US energy interests, undermining Canadian government efforts to secure their support.\n5. Monitor and counter any Canadian attempts to diversify oil exports away from the US, ensuring continued American dominance in Canadian crude oil exports.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades, heed this new dispatch on the latest machinations of our time's autocrats, embodied by actions that echo the Empire's disregard for worlds beyond their reach. The doc...",
  "partigazPreview": "**Facts Summary**\n\nCanadian Prime Minister Mark Carney signed a deal with Alberta for a new oil pipeline to the Pacific, which faces opposition. The agreement exempts the pipeline from some federal cl...",
  "safetyCheckPassed": true
}