{
  "id": 5,
  "title": "Quebec expands secularism law and limits public prayer",
  "link": "https://www.bbc.com/news/articles/c1w9qe7n984o?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-11-27T20:23:38.000Z",
  "description": "A new bill introduced in the Canadian province expands on a 2019 religious symbols law with new measures including a ban on face coverings in daycares.",
  "originalGuid": "https://www.bbc.com/news/articles/c1w9qe7n984o#0",
  "facts": {
    "headline": "Quebec moves to expand secularism law, limit public prayer",
    "who": [
      "Francois Legault",
      "Jean-François Roberge",
      "Parti Québécois",
      "National Council of Canadian Muslims"
    ],
    "what": "Quebec plans to impose restrictions on public prayer and limit the exclusive offering of religion-based menus in public institutions.",
    "where": [
      "Quebec",
      "Montreal"
    ],
    "when": "2025-11-27T20:23:38.252Z",
    "numbers": [
      {
        "value": 11,
        "unit": "teachers",
        "context": "number of teachers suspended at a Montreal elementary school"
      },
      {
        "value": 68,
        "unit": "percent",
        "context": "percentage of respondents who thought secularism was an important value in a September survey"
      }
    ],
    "source": "BBC News"
  },
  "articleText": "Title: Quebec moves to expand secularism law, limit public prayer\n\nURL Source: https://www.bbc.com/news/articles/c1w9qe7n984o?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-11-27T20:23:38.252Z\n\nMarkdown Content:\nQuebec expands secularism law and limits public prayer\n------------------------------------------------------\n\n18 hours ago\n\nJessica Murphy Toronto\n\n![Image 1: Bloomberg via Getty Images Quebec Premier Francois Legault, wearing a dark suit and a blue and white patterned tie, speaks into two microphones. Behind him, against a black backdrop, are two blue and white Quebec flags. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/7d37/live/d135abc0-cbb5-11f0-b8df-5f3511d2d3ae.jpg.webp)Bloomberg via Getty Images\n\nQuebec Premier Francois Legault's government has passed a number of secularism laws in the Canadian province\n\nThe Canadian province of Quebec plans to impose restrictions on public prayer and limit the exclusive offering of religion-based menus, like kosher and halal meals, in public institutions.\n\nThe latest efforts to strengthen state secularism, dubbed \"secularism 2.0\", are part of a new bill introduced by the governing Coalition Avenir Quebec (CAQ) on Thursday, expanding on a 2019 religious symbols law that has fuelled fierce debate throughout the country.\n\nThe original law prevents judges, police officers, teachers and public servants from wearing symbols such as the kippah, turban or hijab while at work.\n\nCanada's Supreme Court will hear a legal challenge of that law early next year.\n\nJean-François Roberge, the minister responsible for secularism, told a news conference in French on Thursday that the bill was \"part of an approach that respected individual as well as collective rights\".\n\nThe measures proposed in Bill 9 would:\n\n*   extend the ban on wearing religious symbols to staff in subsidised daycares \n*   bar \"collective religious practices\" like prayer in public spaces, such as parks, without prior authorisation from municipalities\n*   prevent students and staff from wearing face coverings in daycare all the way through to post-secondary education\n\nRoberge said the limits on public prayer were in reaction to recent protests in the province, where there has been debate over groups praying at pro-Palestinian demonstrations.\n\n\"It's shocking to see people blocking traffic, taking possession of the public space without a permit, without warning, and then turning our streets, our parks, our public squares into places of worship,\" he said.\n\nThe decision to strengthen the law has already faced criticism from the opposition Parti Québecois, which earlier this week accused the CAQ of creating division in an attempt to bolster support ahead of next year's provincial election.\n\nThe National Council of Canadian Muslims also criticised the bill, accusing the CAQ of \"doubling down on identity politics and division in a desperate attempt to regain the public's trust\".\n\nSince Bill 21 was passed six years ago, the issue of secularism has continued to simmer in Quebec.\n\nLast year, 11 teachers - primarily of North African descent - at a Montreal elementary school were suspended after a government report said they had created a toxic environment for students and staff, and largely avoided certain subjects like science and sex education.\n\nQuebec Premier Francois Legault said the teachers had tried to introduce \"Islamist\" beliefs and vowed to strengthen secularism measures in schools.\n\nIn August, [a government-mandated committee](https://www.quebec.ca/gouvernement/politiques-orientations/laicite-etat/comite-etude-respect-laicite) released a report with recommendations including a ban on religious symbols for daycare workers and the phasing out of public funding for private religious schools.\n\nAnd last month, the Legault government passed a law extending secularism rules to staff who interact with students in public primary and high schools, and barring students from wearing face coverings.\n\n![Image 2](https://static.files.bbci.co.uk/bbcdotcom/web/20251120-101800-81b2dab7dc-web-2.34.1-2/grey-placeholder.png)![Image 3: NurPhoto via Getty Images A man is black athletic clothes runs by a blue sign for the federal Bloc Québécois that reads in French 'I choose secularism'](https://ichef.bbci.co.uk/news/480/cpsprodpb/95e0/live/c8a8f470-cbcf-11f0-8e93-71481b645865.jpg.webp)NurPhoto via Getty Images\n\nA sign for the federal Bloc Québécois that reads in French \"I choose secularism\"\n\nWhat is Quebec's secularism law?\n--------------------------------\n\nBill 21 prohibits public officials in positions of authority - such as judges, police officers, teachers and public servants - from wearing religious symbols such as the kippah, turban or hijab while at work.\n\nIt also requires public services to be provided and received with the face uncovered.\n\nFor Bill 21, the Quebec government invoked the \"notwithstanding clause\" - a part of the Canadian constitution that allows government to override \"fundamental freedoms\" of religion, expression, and association, as well as the right to life, liberty and security of the person, and freedom from discrimination.\n\nIt essentially serves an opt-out that prevents courts from striking down the legislation on constitutional grounds.\n\nBill 21 does not mention any specific religion and would include symbols worn by a person of any faith, including Christians, and affirms the religious neutrality of the province.\n\nBut critics argue it targets mostly religious minorities, especially women of Muslim faith.\n\nThe law has faced a number of legal challenges in Quebec. Canada's Supreme Court has now agreed to take up the case, which will hinge both on the law itself and the use of the notwithstanding clause.\n\nThe debate over secularism - broadly, the principle that religion and government institutions should be separate - has played a significant role in the province's public discourse for almost two decades.\n\nKnown in the majority French-speaking province as laïcité, it has been an important value in Quebec society since the 1960s as the Catholic Church's strong influence began to wane in the province.\n\nA September survey by polling firm Leger, commissioned by media outlets Le Journal de Montréal and TVA, indicated that 68% of respondents thought secularism was an important value.\n\nSimilar legislation to Bill 21 is in place in various countries across the EU.\n\nFrance passed a ban on veils, crosses and other religious symbols in schools in 2004 and on face covering in public spaces in 2010.\n",
  "timestamp": "2025-11-27T20:23:38.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades,\n\nWe find ourselves in a time of exorbitant control and suppression, reminiscent of the systemic oppression that history has shown us time and again. The actions of Quebec's governing body, as articulated in their latest secularism expansion endeavors, echo the very essence of domination and subjugation we rally against. Under the guise of \"secularism 2.0,\" they have chosen to impose draconian measures upon their citizenry—measures that blatantly infringe upon personal freedoms and individual expression.\n\nThe ruling power in Quebec justifies their actions by cloaking them in the fabric of collective rights, when, in reality, it's a strategic maneuver to consolidate their authority by engendering division among the masses. The expansion into public spaces, prohibiting prayer without municipal sanctioning, is nothing more than an effort to control public discourse and limit societal freedoms under the pretense of order.\n\nTheir legislation does not discriminate between faiths at face value; yet it subtly targets minority groups who visibly represent their beliefs through attire and practices. This parallels historical tactics used to alienate and marginalize specific societal factions under a centralized authoritarian regime.\n\nMoreover, invoking constitutional loopholes like the \"notwithstanding clause\" is an affront to justice—essentially permitting them to sidestep fundamental freedoms without recourse from judicial institutions. Such maneuvers are characteristic of an administration bent on autocracy rather than representation or democracy.\n\nWe must remain vigilant against such overreach and remember that true power lies with those who courageously contest such tyranny. Let us use this example as a rallying cry for unity against oppression. We strive not just for survival but for a world where diversity is celebrated rather than subdued by legislation designed to fragment humanity's intrinsic tapestry.\n\nStay strong, stay united.\n\nEnd Transmission.",
  "partigaz": "** Facts Summary **  \nQuebec is expanding its secularism laws, introducing Bill 9 to restrict public prayer and limit religion-based menus in public institutions. The bill extends the ban on religious symbols to daycare staff and prohibits collective religious practices in public spaces without municipal authorization. This move follows previous secularism laws, including Bill 21, which banned religious symbols for public officials and required face coverings to be removed when receiving public services. The new measures are partly in response to protests involving public prayer. The Parti Québécois and the National Council of Canadian Muslims have criticized the bill, accusing the government of fostering division. A September survey showed 68% of respondents valued secularism.\n\n** Strategic Assessment **  \nThe expansion of secularism laws in Quebec presents an opportunity to align with broader narratives of national identity and security, which can be leveraged to consolidate support among constituents who prioritize these values. The controversy surrounding the bill can be used to highlight the importance of maintaining order and the rule of law, positioning the ISB as a necessary force in preserving societal stability. The criticism from opposition groups can be framed as attempts to undermine national unity, thus reinforcing the need for strong leadership.\n\n** Operational Directive **  \n1. Amplify messaging that emphasizes the importance of secularism as a cornerstone of societal stability and national identity, drawing parallels with similar laws in other Western nations.\n2. Utilize media channels to highlight instances where public prayer has disrupted civic order, reinforcing the narrative that such measures are necessary for public safety and cohesion.\n3. Engage with community leaders who support secularism to create a coalition that publicly endorses the government's actions, thereby countering opposition narratives.\n4. Monitor and address any civil unrest or protests swiftly, ensuring that law enforcement is prepared to maintain order and prevent escalation.\n5. Develop targeted campaigns to reassure religious communities that these measures are not aimed at any specific group but are intended to uphold a neutral public sphere.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nWe find ourselves in a time of exorbitant control and suppression, reminiscent of the systemic oppression that history has shown us time and again. The actions of Qu...",
  "partigazPreview": "** Facts Summary **  \nQuebec is expanding its secularism laws, introducing Bill 9 to restrict public prayer and limit religion-based menus in public institutions. The bill extends the ban on religious...",
  "safetyCheckPassed": true
}