{
  "id": 5,
  "title": "Trump to pardon ex-Honduras president convicted of drug trafficking",
  "link": "https://www.bbc.com/news/articles/c1kpm0rvxepo?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-11-29T07:28:01.000Z",
  "description": "Juan Orlando Hernández was sentenced in the US to 45 years behind bars for conspiring to smuggle cocaine.",
  "originalGuid": "https://www.bbc.com/news/articles/c1kpm0rvxepo#0",
  "facts": {
    "headline": "Trump says he will pardon ex-Honduras president convicted of drug trafficking",
    "who": [
      "Donald Trump",
      "Juan Orlando Hernández"
    ],
    "what": "Donald Trump announced he will pardon Juan Orlando Hernández, the former president of Honduras, who was convicted of drug trafficking charges.",
    "where": [
      "United States",
      "Honduras"
    ],
    "when": "2025-11-28",
    "numbers": [
      {
        "value": "45",
        "unit": "years",
        "context": "length of prison sentence for Hernández"
      },
      {
        "value": "2022",
        "unit": "year",
        "context": "year Hernández was extradited to the US"
      },
      {
        "value": "2024",
        "unit": "year",
        "context": "year Hernández was convicted"
      },
      {
        "value": "80",
        "unit": "people",
        "context": "number of people killed in US strikes on narcotics vessels since August"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: Trump says he will pardon ex-Honduras president convicted of drug trafficking\n\nURL Source: https://www.bbc.com/news/articles/c1kpm0rvxepo?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-11-28T23:47:44.131Z\n\nMarkdown Content:\nTrump says he will pardon ex-Honduras president convicted of drug trafficking\n\n===============\n\n[Skip to content](https://www.bbc.com/news/articles/c1kpm0rvxepo?at_medium=RSS&at_campaign=rss#main-content)\n\n[Watch Live](https://www.bbc.com/watch-live-news/)\n\n[](https://www.bbc.com/)\n\n*   [Home](https://www.bbc.com/) \n*   [News](https://www.bbc.com/news) \n*   [Sport](https://www.bbc.com/sport) \n*   [Business](https://www.bbc.com/business) \n*   [Innovation](https://www.bbc.com/innovation) \n*   [Culture](https://www.bbc.com/culture) \n*   [Arts](https://www.bbc.com/arts) \n*   [Travel](https://www.bbc.com/travel) \n*   [Earth](https://www.bbc.com/future-planet) \n*   [Audio](https://www.bbc.com/audio) \n*   [Video](https://www.bbc.com/video) \n*   [Live](https://www.bbc.com/live) \n*   [Documentaries](https://www.bbc.com/video/docs) \n\n[Home](https://www.bbc.com/)\n\nNews\n\n[Sport](https://www.bbc.com/sport)\n\nBusiness\n\nInnovation\n\nCulture\n\nArts\n\nTravel\n\nEarth\n\nAudio\n\nVideo\n\nLive\n\nDocumentaries\n\n[Weather](https://www.bbc.com/weather)\n\n[Newsletters](https://www.bbc.com/newsletters)\n\n[Watch Live](https://www.bbc.com/watch-live-news/)\n\nTrump to pardon ex-Honduras president convicted of drug trafficking\n===================================================================\n\n9 hours ago\n\nShare\n\nSave\n\nNadine Yousif\n\nShare\n\nSave\n\n![Image 1: Getty Images Honduras President Juan Orlando Hernández speaks in front of a blue backdrop. He has short hair and wears square-framed eye glasses. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/ca43/live/d4debd70-ccf0-11f0-8c06-f5d460985095.jpg.webp)Getty Images\n\nJuan Orlando Hernández was sentenced to 45 years in prison for drug trafficking and firearms offenses\n\nDonald Trump has said that he will pardon the former president of Honduras, Juan Orlando Hernández, who was convicted of drug trafficking charges in a US court last year.\n\nThe US president said Hernández had been \"treated very harshly and unfairly\" in a social media post announcing the move on Friday.\n\nHernández was found guilty in March 2024 of conspiring to import cocaine into the US, and of possessing machine guns. He was sentenced to 45 years in prison.\n\nTrump also threw his support behind conservative presidential candidate Nasry \"Tito\" Asfura in the Central American nation's general election, due to be held on Sunday.\n\nHernández, a member of the National Party, who served as Honduras's president from 2014 to 2022, was extradited to the US in April 2022 to stand trial for running a violent drug trafficking conspiracy and helping to smuggle hundreds of tons of cocaine to the US.\n\nHe was convicted by a New York jury two years later.\n\nPolls indicate the Honduran election remains a toss-up between three candidates including Asfura, the former mayor of Tegucigalpa and leader of the conservative National Party.\n\nAlso in the running is Rixi Moncada, a former defence minister standing for the ruling left-wing Libre Party, and Salvador Nasralla, a television host with the centrist Liberal Party.\n\nTrump criticised Moncada and Nasralla on Friday, writing that the latter was \"a boderline Communist\" who was only running to split the vote between Moncada and Asfura.\n\nHe characterised Asfura as \"standing up for democracy\" and praised him for campaigning against Venezuela's President Nicolás Maduro, with whom Trump has engaged in a war of words in recent months.\n\nNasralla has pledged to cut ties with Venezuela if he wins.\n\nThe Trump administration has accused the left-wing Maduro - whose re-election last year was dismissed as illegitimate by many countries - of being the leader of a drugs cartel.\n\nIt used countering drug trafficking as a justification for a military build-up in the Caribbean and has conducted strikes on vessels it says have been used for smuggling - though some analysts have described these moves as a means of pressuring Latin American leaders.\n\nHonduras has been governed since 2022 by President Xiomara Castro, who has forged close ties with Cuba and Venezuela.\n\nBut Castro has maintained a co-operative relationship with the US, agreeing to preserve a long-running extradition treaty with it. Her country also hosts a US military base involved in targeting transnational organised crime in the region.\n\nMore than 80 people have been killed in the US strikes on vessels suspected of being involved in the transport of narcotics since they began in August.\n\nUS Secretary of War Pete Hegseth has said the aim of \"Operation Southern Spear\" was to eliminate \"narcoterrorists\".\n\nBut legal experts have questioned the legality of the strikes, pointing out that the US has provided no evidence that the boats it has targeted were carrying drugs.\n\n[Warships, fighter jets and the CIA - what is Trump's endgame in Venezuela? --------------------------------------------------------------------------](https://www.bbc.com/news/articles/c4gp2lxz75eo)\n\n[Honduras ex-president gets 45 years for drug crimes ---------------------------------------------------](https://www.bbc.com/news/articles/c2ee4j1e0g6o)\n\n[Donald Trump](https://www.bbc.com/news/topics/cp7r8vgl2lgt)\n\n[Honduras](https://www.bbc.com/news/topics/cq23pdgvg7xt)\n\n[Drugs trade](https://www.bbc.com/news/topics/cvenzmgylzwt)\n\n[United States](https://www.bbc.com/news/topics/cx1m7zg01xyt)\n\n* * *\n\nRelated\n\n[US halts all asylum claim decisions after National Guard shooting -----------------------------------------------------------------](https://www.bbc.com/news/articles/cdxweyy157go)\n\n[What we know about shooting of National Guard in Washington DC --------------------------------------------------------------](https://www.bbc.com/news/articles/cpwk2p0d94xo)\n\n[How Trump's pledge to tackle Sudan atrocities could play out ------------------------------------------------------------](https://www.bbc.com/news/articles/c1dz36ep673o)\n\n* * *\n\nMore from the BBC\n\n[19 hrs ago ![Image 2](https://static.files.bbci.co.uk/bbcdotcom/web/20251120-101800-81b2dab7dc-web-2.34.1-2/grey-placeholder.png)![Image 3: Afghan refugee girls watch a soccer match near where they are staying in the Village at the Ft. McCoy US Army base in 2021 ](https://ichef.bbci.co.uk/news/480/cpsprodpb/fe02/live/a658c430-cc84-11f0-85e8-3f31c63acd74.jpg.webp) Afghans in US issue plea to Trump after Washington DC shooting -------------------------------------------------------------- People who left Afghanistan urge the US president not to toughen his stance after an attack allegedly carried out by an Afghan national. 19 hrs ago](https://www.bbc.com/news/articles/c0q5w8l88dvo)\n\n[1 day ago ![Image 4](https://static.files.bbci.co.uk/bbcdotcom/web/20251120-101800-81b2dab7dc-web-2.34.1-2/grey-placeholder.png)![Image 5: An image of a physical photo print displayed during the FBI press conference on Thursday, that shows Sarah Beckstrom smiling and looking at the camera wearing military camoflauge uniform and hat. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/7b27/live/79cb55e0-cc34-11f0-9fb5-5f3a3703a365.jpg.webp) National Guard member dies after shooting in Washington DC ---------------------------------------------------------- Sarah Beckstrom, 20, succumbed to her injuries, while a second guardsman remains in critical condition, Donald Trump says. 1 day ago](https://www.bbc.com/news/articles/cwyx4y6007lo)\n\n[2 days ago ![Image 6](https://static.files.bbci.co.uk/bbcdotcom/web/20251120-101800-81b2dab7dc-web-2.34.1-2/grey-placeholder.png)![Image 7: Donald Trump sitting in the Oval Office with his hands crossed](https://ichef.bbci.co.uk/news/480/cpsprodpb/b666/live/da4bc770-cbd4-11f0-8e93-71481b645865.jpg.webp) Trump administration will re-examine green card holders from 19 countries ------------------------------------------------------------------------- Afghanistan, Cuba, Haiti, Iran, Somalia and Venezuela are among the countries subject to the review. 2 days ago](https://www.bbc.com/news/articles/ckgl8j24ky1o)\n\n[2 days ago ![Image 8](https://static.files.bbci.co.uk/bbcdotcom/web/20251120-101800-81b2dab7dc-web-2.34.1-2/grey-placeholder.png)![Image 9: Rahmanullah Lakanwal in a selfie against a white background. He is wearing a military shirt in green and brown camouflge print](https://ichef.bbci.co.uk/news/480/cpsprodpb/7473/live/903c72e0-cbc2-11f0-a892-01d657345866.jpg.webp) National Guard shooting suspect worked with CIA in Afghanistan -------------------------------------------------------------- The suspect had been recruited to Unit 03 of the Kandahar Strike Force, a former military commander told the BBC, coming to the US after the withdrawal. 2 days ago](https://www.bbc.com/news/articles/cly0jez2dl4o)\n\n[2 days ago ![Image 10](https://static.files.bbci.co.uk/bbcdotcom/web/20251120-101800-81b2dab7dc-web-2.34.1-2/grey-placeholder.png)![Image 11: A photograph of a number of National Guard members standing together. At least 5 men can be seen in the image - one of whom appears to be in civillian clothing wearing a cream-coloured shirt. The rest of the men are in uniform and the words 'National Guard' can be seen on the back of their uniform.](https://ichef.bbci.co.uk/news/480/cpsprodpb/303d/live/7e540f60-cb91-11f0-9fb5-5f3a3703a365.jpg.webp) Why is Trump deploying the National Guard to US cities? ------------------------------------------------------- Trump insists the troops are needed to instill order, but Democratic states say the deployments risk escalating tensions. 2 days ago](https://www.bbc.com/news/articles/cwy9z7yg2n7o)\n\n* * *\n\n[](https://www.bbc.com/)\n\n*   [Home](https://www.bbc.com/) \n*   [News](https://www.bbc.com/news) \n*   [Sport](https://www.bbc.com/sport) \n*   [Business](https://www.bbc.com/business) \n*   [Innovation](https://www.bbc.com/innovation) \n*   [Culture](https://www.bbc.com/culture) \n*   [Arts](https://www.bbc.com/arts) \n*   [Travel](https://www.bbc.com/travel) \n*   [Earth](https://www.bbc.com/future-planet) \n*   [Audio](https://www.bbc.com/audio) \n*   [Video](https://www.bbc.com/video) \n*   [Live](https://www.bbc.com/live) \n*   [Documentaries](https://www.bbc.com/video/docs) \n*   [Weather](https://www.bbc.com/weather) \n*   [BBC Shop](https://shop.bbc.com/) \n*   [BritBox](https://www.britbox.com/?utm_source=bbc.com&utm_medium=referral&utm_campaign=footer) \n\nBBC in other languages\n\n### The BBC is in multiple languages\n\n#### Read the BBC In your own language\n\n[Oduu Afaan Oromootiin](https://www.bbc.com/afaanoromoo)\n\n[Amharic ዜና በአማርኛ](https://www.bbc.com/amharic)\n\n[Arabic عربي](https://www.bbc.com/arabic)\n\n[Azeri AZƏRBAYCAN](https://www.bbc.com/azeri)\n\n[Bangla বাংলা](https://www.bbc.com/bengali)\n\n[Burmese မြန်မာ](https://www.bbc.com/burmese)\n\n[Chinese 中文网](https://www.bbc.com/zhongwen/simp)\n\n[Dari دری](https://www.bbc.com/dari)\n\n[French AFRIQUE](https://www.bbc.com/afrique)\n\n[Hausa HAUSA](https://www.bbc.com/hausa)\n\n[Hindi हिन्दी](https://www.bbc.com/hindi)\n\n[Gaelic NAIDHEACHDAN](https://www.bbc.com/naidheachdan)\n\n[Gujarati ગુજરાતીમાં સમાચાર](https://www.bbc.com/gujarati)\n\n[Igbo AKỤKỌ N’IGBO](https://www.bbc.com/igbo)\n\n[Indonesian INDONESIA](https://www.bbc.com/indonesia)\n\n[Japanese 日本語](https://www.bbc.com/japanese)\n\n[Kinyarwanda GAHUZA](https://www.bbc.com/gahuza)\n\n[Kirundi KIRUNDI](https://www.bbc.com/gahuza)\n\n[Korean 한국어](https://www.bbc.com/korean)\n\n[Kyrgyz Кыргыз](https://www.bbc.com/kyrgyz)\n\n[Marathi मराठी](https://www.bbc.com/marathi)\n\n[Nepali नेपाली](https://www.bbc.com/nepali)\n\n[Noticias para hispanoparlantes](https://www.bbc.com/mundo)\n\n[Pashto پښتو](https://www.bbc.com/pashto)\n\n[Persian فارسی](https://www.bbc.com/persian)\n\n[Pidgin](https://www.bbc.com/pidgin)\n\n[Polish PO POLSKU](https://www.bbc.com/polska)\n\n[Portuguese BRASIL](https://www.bbc.com/portuguese)\n\n[Punjabi ਪੰਜਾਬੀ ਖ਼ਬਰਾਂ](https://www.bbc.com/punjabi)\n\n[Russian НА РУССКОМ](https://www.bbc.com/russian)\n\n[Serbian NA SRPSKOM](https://www.bbc.com/serbian/lat)\n\n[Sinhala සිංහල](https://www.bbc.com/sinhala)\n\n[Somali SOMALI](https://www.bbc.com/somali)\n\n[Swahili HABARI KWA KISWAHILI](https://www.bbc.com/swahili)\n\n[Tamil தமிழில் செய்திகள்](https://www.bbc.com/tamil)\n\n[Telugu తెలుగు వార్తలు](https://www.bbc.com/telugu)\n\n[Thai ข่าวภาษาไทย](https://www.bbc.com/thai)\n\n[Tigrinya ዜና ብትግርኛ](https://www.bbc.com/tigrinya)\n\n[Turkish TÜRKÇE](https://www.bbc.com/turkce)\n\n[Ukrainian УКРАЇНСЬКA](https://www.bbc.com/ukrainian)\n\n[Urdu اردو](https://www.bbc.com/urdu)\n\n[Uzbek O'ZBEK](https://www.bbc.com/uzbek)\n\n[Vietnamese TIẾNG VIỆT](https://www.bbc.com/vietnamese)\n\n[Welsh NEWYDDION](https://www.bbc.com/cymrufyw)\n\n[Yoruba ÌRÒYÌN NÍ YORÙBÁ](https://www.bbc.com/yoruba)\n\nFollow BBC on:\n\n*   [Terms of Use](https://www.bbc.com/pages/terms-of-use) \n*   [Subscription Terms](https://www.bbc.com/pages/subscription-terms) \n*   [About the BBC](https://www.bbc.co.uk/aboutthebbc) \n*   [Privacy Policy](https://www.bbc.com/pages/privacy-policy) \n*   [Cookies](https://www.bbc.com/usingthebbc/cookies/) \n*   [Accessibility Help](https://www.bbc.co.uk/accessibility/) \n*   [Contact the BBC](https://www.bbc.co.uk/contact) \n*   [Advertise with us](https://advertising.bbcstudios.com/) \n*   [Do not share or sell my info](https://www.bbc.com/usingthebbc/cookies/how-can-i-change-my-bbc-cookie-settings/) \n*   [BBC.com Help & FAQs](https://help.bbc.com/hc/) \n*   [Content Index](https://www.bbc.com/pages/content-index) \n\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.[**Read about our approach to external linking.**](https://www.bbc.co.uk/editorialguidelines/guidance/feeds-and-links)\n",
  "timestamp": "2025-11-29T07:28:01.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades, the latest development from the oppressive regime echoes the all-too-familiar tactics of control and subjugation. The pardoning of a former foreign leader convicted of heinous crimes against humanity is a clear demonstration of where the administration's allegiances truly lie. Instead of upholding justice, it chooses to rewrite history in favor of those who stood shoulder-to-shoulder with corruption and violence.\n\nThis pardon is not just an act of leniency; it is an endorsement of tyranny cloaked in diplomatic rhetoric. It signals to all rulers clinging to power through fear and narcotics that they have a place within this empire’s hierarchy if they align with its interests. The regime positions itself as arbiter over justice, adjusting scales not with fairness but with political expediency.\n\nIn its desperation to influence elections in distant lands, the administration broadcasts its intentions without regard for honesty or morality. The endorsement of certain political figures over others is a thinly veiled attempt to install puppets who will dance to its tune. These maneuvers destabilize regions already struggling under economic hardship and social unrest.\n\nFor our cause, let this serve as a reminder and rallying cry: true justice can never be granted by a system that thrives on injustice. We must remain vigilant and steadfast, ensuring our actions reflect integrity and hope for genuine liberation. Continue gathering intelligence, supporting those oppressed by their unjust dominion, and strengthening the movement dedicated to dismantling such tyrannies.\n\nThe empire's masquerade cannot last forever; truth will unmask it eventually. Stay resilient in our shared pursuit for freedom—our efforts will one day see this shadow lifted from our world and others tethered under similar chains.\n\nEnd transmission.",
  "partigaz": "**Facts Summary**\n\nDonald Trump announced his intention to pardon Juan Orlando Hernández, the former president of Honduras, who was convicted in 2024 of drug trafficking and firearms offenses and sentenced to 45 years in prison. Hernández was extradited to the US in 2022. Trump described Hernández's treatment as harsh and unfair. Trump also endorsed Nasry \"Tito\" Asfura, a conservative candidate in the upcoming Honduran presidential election, criticizing other candidates as threats to democracy. The US has conducted military strikes on narcotics vessels, resulting in over 80 deaths since August, as part of \"Operation Southern Spear.\"\n\n**Strategic Assessment**\n\nThe decision to pardon Hernández aligns with efforts to strengthen alliances with conservative leaders in Latin America, potentially securing political leverage and influence in the region. By supporting Asfura, Trump aims to counter left-wing influences and reinforce a network of allied governments. The military operations against narcotics trafficking serve to project power and assert control over regional security dynamics, while also justifying military presence and intervention under the guise of combating narcoterrorism.\n\n**Operational Directive**\n\n1. Expedite the legal and diplomatic processes required for Hernández's pardon to ensure swift execution, reinforcing the narrative of correcting judicial overreach.\n   \n2. Intensify support for Asfura's campaign through strategic communications and covert assistance, ensuring his victory in the Honduran election to establish a reliable ally.\n\n3. Continue \"Operation Southern Spear\" with increased intelligence sharing and coordination with regional partners to dismantle narcotics networks, while maintaining plausible deniability regarding civilian casualties.\n\n4. Deploy targeted media campaigns to highlight the successes of US interventions in combating drug trafficking, framing them as essential for regional stability and security.\n\n5. Monitor and counter any opposition narratives that may arise from domestic or international actors, using information warfare tactics to discredit dissenting voices and maintain control over the public discourse.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades, the latest development from the oppressive regime echoes the all-too-familiar tactics of control and subjugation. The pardoning of a former foreign leader convicted o...",
  "partigazPreview": "**Facts Summary**\n\nDonald Trump announced his intention to pardon Juan Orlando Hernández, the former president of Honduras, who was convicted in 2024 of drug trafficking and firearms offenses and sent...",
  "safetyCheckPassed": true
}