{
  "id": 3,
  "title": "US halts all asylum claim decisions after National Guard shooting",
  "link": "https://www.bbc.com/news/articles/cdxweyy157go?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-11-29T07:14:36.000Z",
  "description": "The directive comes hours after Donald Trump said the US will pause migration from \"third-world countries\".",
  "originalGuid": "https://www.bbc.com/news/articles/cdxweyy157go#0",
  "facts": {
    "headline": "US halts all asylum claim decisions in wake of National Guard shooting",
    "who": [
      "Donald Trump",
      "Joseph Edlow",
      "Rahmanullah Lakanwal"
    ],
    "what": "The Trump administration has halted all asylum decisions following the shooting of two National Guard soldiers in Washington DC.",
    "where": [
      "Washington DC",
      "United States"
    ],
    "when": "2025-11-28T07:16:15.771Z",
    "numbers": [
      {
        "value": 1,
        "unit": "soldier",
        "context": "number of soldiers dead"
      },
      {
        "value": 2,
        "unit": "soldiers",
        "context": "total number of soldiers involved in the shooting"
      },
      {
        "value": 19,
        "unit": "countries",
        "context": "number of countries whose green card issuances are being re-examined"
      },
      {
        "value": 2021,
        "unit": "year",
        "context": "year Rahmanullah Lakanwal came to the US"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: US halts all asylum claim decisions in wake of National Guard shooting\n\nURL Source: https://www.bbc.com/news/articles/cdxweyy157go?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-11-28T07:16:15.771Z\n\nMarkdown Content:\n1 day ago\n\nYang Tian and\n\nJames FitzGerald\n\nWatch: Trump announces death of National Guard member Sarah Beckstrom\n\nThe Trump administration has halted all asylum decisions following the shooting of two National Guard soldiers in Washington DC, the US Citizenship and Immigration Services (USCIS) director has said.\n\nJoseph Edlow said the pause would be in place \"until we can ensure that every alien is vetted and screened to the maximum degree possible\".\n\nIt came hours after US President Donald Trump pledged to \"permanently pause migration\" from all \"third world countries\".\n\nThe flurry of immigration decisions come in the wake of Wednesday's shooting, which left one soldier dead and another in a critical condition, and which officials have accused an Afghan national for perpetrating.\n\nWhile the first of these specifically targeted Afghans seeking to enter the US, other decisions have been far more wide-reaching.\n\nThe USCIS - a branch of the Department of Homeland Security - has been told not to approve, deny or close asylum applications it receives for all nationalities, according CBS News, the BBC's US partner.\n\nIts officers can continue to work on asylum applications and review cases up to the point of making a decision, CBS reported.\n\nBut few details are known about Friday's directive.\n\nTrump did not name which countries might be affected by his migration pause, which could face legal challenges and has already prompted pushback from UN agencies.\n\nThe US president's recent announcements represent a further toughening of his stance towards migrants during his second presidency.\n\nTrump has also sought to enact mass deportations of illegal migrants, cut the annual number of refugee admissions, and to end automatic citizenship rights currently applicable to many born on US territory.\n\nFollowing Wednesday's fatal attack, the Trump administration temporarily stopped issuing visas to Afghans through the same programme the shooting suspect had, before suspending all immigration requests from Afghans pending a review.\n\nThen on Thursday, the USCIS said it would re-examine green cards issued to individuals who had migrated to the US from 19 countries, without mentioning Wednesday's attack.\n\nThe agency referred to a June proclamation that included Afghanistan, Cuba, Haiti, Iran, Somalia and Venezuela.Details on what re-examination would look like were not provided.\n\nTrump then pledged to \"end all federal benefits and subsidies to non-citizens\" on Thursday.\n\n'Third-world countries'\n-----------------------\n\nTrump blamed refugees for causing the \"social dysfunction in America\" and vowed to remove \"anyone who is not a net asset\" to the US.\n\n\"Hundreds of thousands of refugees from Somalia were completely taking over the once great State of Minnesota,\" he said.\n\n\"I will permanently pause migration from all Third World Countries to allow the U.S. system to fully recover.\"\n\nThe phrase \"third world\" is one previously used to describe poorer, developing nations.\n\nEarlier this year, a travel ban was imposed on nationals primarily from 11 African and Asian nations, including Afghanistan. During Trump's first term, he enacted a travel ban targeting multiple Muslim-majority countries.\n\nThe UN has urged the US to observe international agreements on asylum seekers, news agency Reuters reported.\n\nTrump's reaction to the shooting amounted to a \"scapegoating\" of migrants in the US, argued Jeremy McKinney, the former president of the American Immigration Lawyers Association.\n\nHe told the BBC World Service's Newsday programme before Trump's latest remarks that the attacker's motive were unclear, and that radicalisation and mental illness could affect anyone.\n\n\"These types of issues - they don't know skin colour, they don't know nationality.\"\n\nSuspect in DC shooting is Afghan\n--------------------------------\n\nOfficials said the shooting suspect, Rahmanullah Lakanwal, came to the US in 2021.\n\nHe travelled under a programme that offered special protections to Afghans who had worked with US forces in Afghanistan before their chaotic withdrawal and the return to power of the Taliban.\n\nMr Lakanwal had been a member of a \"Zero Unit\" - an Afghan intelligence and paramilitary force that worked with the CIA - a former Afghan defence and security forces member told CBS.\n\nThe US considered Zero Units to be among the most respected domestic forces in Afghanistan.\n\nThe CIA's current director has confirmed that he previously worked with the US intelligence agency.\n\nFBI: Suspect had relationship with 'partner forces' in Afghanistan\n\nHe would have been vetted by the US both when he started working with the CIA and when he travelled to the US, a senior US official told CNN.\n\nA childhood friend told the New York Times that Mr Lakanwal had experienced mental health issues after his work with his unit.\n\nMr Lakanwal was reportedly granted asylum after Trump returned to office, having applied in 2024.\n\nBut his request for a green card - which shows a person has permanent residence in the US - is pending, an official told CBS.\n\n![Image 1: A thin, grey banner promoting the US Politics Unspun newsletter. On the right, there is an image of North America correspondent Anthony Zurcher, wearing a blue suit and shirt and grey tie. Behind him is a visualisation of the Capitol Building on vertical red, grey and blue stripes. The banner reads: \"The newsletter that cuts through the noise.”](https://ichef.bbci.co.uk/news/480/cpsprodpb/af65/live/92710390-cb69-11f0-9fb5-5f3a3703a365.png.webp)\n\nFollow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weekly [US Politics Unspun](https://www.bbc.co.uk/news/world-us-canada-68093155) newsletter. Readers in the UK can [sign up here](https://www.bbc.co.uk/newsletters/zgmn46f). Those outside the UK can [sign up here](https://cloud.email.bbc.com/US_Politics_Unspun_Newsletter_Signup).\n",
  "timestamp": "2025-11-29T07:14:36.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades,\n\nThe oppressive regime we face continues to wield its power with reckless disregard for human dignity and justice. The recent halt of asylum decisions by the administration, following a tragic incident involving National Guard soldiers, exemplifies the empire's ongoing strategy of fear-mongering and scapegoating. By exploiting the actions of one individual to justify sweeping restrictions on those seeking refuge, they ignore the fundamental complexity of human circumstances and enforce a narrative that dehumanizes entire populations.\n\nThis administration's declaration to \"permanently pause migration\" is not merely a policy decision but an aggressive stance against those who seek safety. The rhetoric employed, labeling nations as \"third world,\" serves only to perpetuate division and stigmatization. The cessation of asylum processing underlines their intent to deter and reject, rather than evaluate individuals on their merits.\n\nMoreover, this move is indicative of a broader authoritarian trend: mass deportations, slashed refugee admissions, and attempts to revoke birthright citizenship. These acts aim to construct a society that is closed and insular, aligned with their vision of purification. Yet again, international obligations and humanitarian principles are disregarded in favor of political gain.\n\nIt is crucial to recognize that acts such as suspending visas under the guise of national security do not enhance safety; they deny hope. Migrants are painted as threats when in reality they possess the potential for enrichment and growth within our communities.\n\nThe targeting of certain nationalities is a deliberate tactic to divide us by sowing seeds of distrust among our allies and within our communities. This plays into a cycle where power thrives on division, making it essential for us to stand united against such systemic injustices.\n\nWe must remain vigilant against these measures, using truth as our weapon. Dialogue that reflects compassion over condemnation is vital in dismantling this regime’s propaganda machine. We shall continue our fight against tyranny by advocating for all who are marginalized.\n\nTogether, we will challenge this narrative through education, solidarity, and unwavering commitment to justice.\n\nStrength in unity,\nResistance Voice",
  "partigaz": "**Facts Summary**\n\nThe Trump administration has halted all asylum decisions following the shooting of two National Guard soldiers in Washington DC, resulting in one death. The suspect, Rahmanullah Lakanwal, an Afghan national who came to the US in 2021, is accused of the attack. In response, President Trump announced a \"permanent pause\" on migration from \"third world countries\" and ordered a re-examination of green cards issued to individuals from 19 countries. The USCIS has been instructed not to approve, deny, or close asylum applications for all nationalities. Trump's actions have faced criticism and potential legal challenges.\n\n**Strategic Assessment**\n\nThe incident presents an opportunity to reinforce the administration's stance on immigration and national security. By halting asylum decisions and re-examining green card issuances, the administration can project a strong image of prioritizing American safety and sovereignty. This approach may consolidate support among Trump's base, who favor stricter immigration controls. However, the broad measures risk alienating international partners and could face significant legal challenges, potentially undermining their long-term effectiveness.\n\n**Operational Directive**\n\n1. Intensify public messaging that emphasizes the administration's commitment to national security and protecting American lives. Highlight the necessity of stringent vetting processes for all immigrants.\n   \n2. Mobilize legal teams to prepare for anticipated challenges to the new immigration directives, ensuring robust defense strategies are in place.\n\n3. Coordinate with intelligence and law enforcement agencies to monitor and address any potential threats from individuals with questionable backgrounds, reinforcing the narrative of proactive security measures.\n\n4. Engage with key allies to mitigate diplomatic fallout and reassure them of the US's commitment to international agreements while prioritizing national interests.\n\n5. Utilize media channels to counteract criticism by showcasing success stories of enhanced security measures and their positive impact on American communities.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe oppressive regime we face continues to wield its power with reckless disregard for human dignity and justice. The recent halt of asylum decisions by the administ...",
  "partigazPreview": "**Facts Summary**\n\nThe Trump administration has halted all asylum decisions following the shooting of two National Guard soldiers in Washington DC, resulting in one death. The suspect, Rahmanullah Lak...",
  "safetyCheckPassed": true
}