{
  "title": "Trump gives 'toothless' Asian summit its moment in the sun",
  "link": "https://www.bbc.com/news/articles/c797qlx93j0o?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-10-27T08:44:58.000Z",
  "description": "The US president’s presence boosted Asean’s profile at a time when many are questioning its relevance.",
  "originalGuid": "https://www.bbc.com/news/articles/c797qlx93j0o#0",
  "clusterSize": 1,
  "topicKey": "asian gives moment summit toothless trump",
  "supportingLinks": "",
  "allClusters": [
    {
      "topic": "asian gives moment summit toothless trump",
      "count": 1,
      "firstTitle": "Trump gives 'toothless' Asian summit its moment in the sun"
    },
    {
      "topic": "agree ahead china deal framework trade",
      "count": 1,
      "firstTitle": "US and China agree framework of trade deal ahead of Trump-Xi meeting"
    },
    {
      "topic": "cambodia deal peace solved thailand trump",
      "count": 1,
      "firstTitle": "Has Trump's 'peace deal' solved the Thailand-Cambodia dispute?"
    },
    {
      "topic": "doubt government topple trump venezuelan wants",
      "count": 1,
      "firstTitle": "'No doubt' Trump wants to topple our government, Venezuelan official tells BBC"
    },
    {
      "topic": "food government next paying stop week",
      "count": 1,
      "firstTitle": "US government says it will stop paying for food aid next week"
    }
  ],
  "facts": {
    "headline": "Trump gives 'toothless' Asian summit its moment in the sun",
    "who": [
      "Donald Trump",
      "Anwar Ibrahim",
      "Xi Jinping",
      "Scott Bessent",
      "He Lifeng",
      "Xanana Gusmao"
    ],
    "what": "Donald Trump presided over a signing ceremony in Kuala Lumpur, marking progress in regional peace and trade agreements.",
    "where": [
      "Kuala Lumpur",
      "Japan",
      "South Korea"
    ],
    "when": "2025-10-27T08:44:58.362Z",
    "numbers": [
      {
        "value": "1.4",
        "unit": "million",
        "context": "population of East Timor"
      },
      {
        "value": "1967",
        "unit": "",
        "context": "year ASEAN was formed"
      },
      {
        "value": "4",
        "unit": "years",
        "context": "duration the military junta in Myanmar has ignored requests to stop violence"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: Trump gives 'toothless' Asian summit its moment in the sun\n\nURL Source: https://www.bbc.com/news/articles/c797qlx93j0o?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-10-27T08:44:58.362Z\n\nMarkdown Content:\n3 hours ago\n\nTessa Wong in Kuala Lumpur\n\n![Image 1: AFP via Getty Images Donald Trump and Anwar Ibrahim are wearing dark suits and standing in front of a dark blue background. Trump is grinning.](https://ichef.bbci.co.uk/news/480/cpsprodpb/c13d/live/6a2ddbc0-b2f4-11f0-9e46-ab5be17562a4.jpg.webp)AFP via Getty Images\n\nUS President Donald Trump and Malaysian PM Anwar Ibrahim oversaw the signing ceremony on Sunday\n\nAs US President Donald Trump boarded Air Force One in Kuala Lumpur, it was at the end of a busy 24 hours that, by the White House's account, included a flurry of deals that brought \"peace and prosperity\" to the region.\n\nThe headlines will follow Trump as he flies to Japan and then South Korea, for a much-awaited meeting with Chinese leader Xi Jinping.\n\nBut getting him to the Asean Summit gave the grouping of South East Asian nations its biggest moment in the sun, at a time when many have been questioning its relevance.\n\nFor Trump the biggest draw was that he got to [preside over a \"peace deal\"](https://www.bbc.com/news/articles/c93dy2kk7vzo) between Thailand and Cambodia whose long standing border dispute erupted into open conflict in July.\n\nHe wanted this in his ongoing quest to clinch a Nobel Peace Prize for resolving wars, although the Thais were reluctant to call it a \"peace deal\".\n\nThis came on the back of another rare win for Asean, whose chair, Malaysian Prime Minister Anwar Ibrahim, brokered the initial ceasefire between the two countries.\n\nPart of these successes could be attributed to Anwar himself, a veteran politician who could leverage his long-term relationships with the Cambodians and Thais, while charming Trump – [even getting away with a sensitive joke about jailtime.](https://www.freemalaysiatoday.com/category/nation/2025/10/26/i-was-in-prison-and-you-almost-got-there-anwar-tells-trump-in-jest)\n\nBut in the end it was clearly US pressure that sealed the deal, with Thailand and Cambodia quick to cease hostilities following Trump's economic threats.\n\nSunday's signing was accompanied by announcements of US trade deals with Cambodia and Thailand, with Trump making it plain he intends to use business deals to pressure countries to make peace.\n\nFor most leaders, the main bonus of Trump's appearance was that they got precious face time with the president at a crucial point in US tariff negotiations.\n\nMany of Asean's member states are export-dependent economies - with the US being a key market. Besides Thailand and Cambodia, Malaysia and Vietnam also signed deals with the US. And while they were not able to budge tariff rates, they managed to negotiate some goods exemptions.\n\n\"Trump was here for a photo op… this was just another feather in his cap,\" says Joseph Liow, dean of the Lee Kuan Yew School of Public Policy in Singapore.\n\nBut, he adds, the thinking was that \"since he'll be here, let's make the best of it\" and Asian leaders would have leveraged on his attendance to \"broaden his aperture about the convergence of interests between US and Asia\".\n\nWatch: Trump claims to have ended another war. Will it last?\n\nFormed in 1967 as a bulwark against Communism, these days Asean acts as a platform for diplomatic dialogue and trade talks.\n\nIts main advantage is that it can draw larger countries, who see the summit as a easy way to engage all of the region's leaders in one room. This year, besides Trump, leaders from China, the European Council, Canada, Brazil and South Africa also attended the summit.\n\nIt's had some achievements over the years on the economic front, developing a more integrated economy across the region and securing free trade agreements with other world powers.\n\nBut many have increasingly questioned its effectiveness in solving regional issues, from air pollution caused by Indonesian forest fires to competing South China Sea claims.\n\nIts inability to end Myanmar's civil war that erupted in 2021 has been seen as one of its biggest failures.\n\nEven at this week's summit, the grouping continued to urge the military government to stop the war and seek a peaceful solution - requests that the junta has ignored these last four years.\n\nThe grouping also noted the junta's invitation to observe their upcoming general election in December and responded by stressing \"the importance of free and fair\" elections and the need to stop the violence first. This was as tough as Asean could get.\n\nOne reason is that it is not a trade or economic bloc like the European Union, nor does it maintain any standing troops like Nato or the UN. Asean therefore has very few levers at its disposal to put pressure on member states, apart from diplomacy.\n\nBut the main reason, experts say, is its core principle of non-interference in member states' internal affairs. Asean advocates says this is what keeps it united, and that it can quietly exert pressure effectively behind the scenes – but detractors say it makes it toothless.\n\n\"When it comes to political crises, it's mission impossible for members to give up sovereignty and give in to the Asean greater good,\" says Huong Le Thu, deputy director of the Asia programme at the International Crisis Group, who adds that this is \"Asean's weakest link\".\n\nWhile another of Asean's fundamental principles is settling disputes peacefully, in reality it \"does not really have a major appetite for conflicting countries to sit down and thrash things out\", notes Prof Liow.\n\n\"People who criticise Asean for its inability to get its house in order, they are absolutely right. So unless Asean can handle more pressing issues, its relevance will always get called into question… And really the fundamental question for Asean is, at what cost unity?\"\n\nThe fact that the grouping could not prevent simmering border tensions between Thailand and Cambodia from erupting into war in July, is yet another example of \"Asean fragility\", points out Dr Le Thu, given that South East Asia prides itself as a region with little violent conflict between member states in recent decades.\n\nIt is criticism like this, though, that make the resolution of the Thai-Cambodia war a rare win for Asean, with Trump's visit burnishing that success. Experts say that while the agreement signed on Sunday does not actually resolve the fundamental border dispute, it is still a positive start with concrete steps for de-escalation.\n\nAnd there were other victories too.\n\n![Image 2](https://static.files.bbci.co.uk/bbcdotcom/web/20251021-134202-667692b2c6-web-2.32.2-1/grey-placeholder.png)![Image 3: Bloomberg via Getty Images East Timor prime minister Xanana Gusmao is dressed in a dark suit and red tie, greeting reporters cheerfully as he holds up his hands](https://ichef.bbci.co.uk/news/480/cpsprodpb/760a/live/af3d0680-b2f1-11f0-8041-a57b480f3417.jpg.webp)Bloomberg via Getty Images\n\nEast Timor Prime Minister Xanana Gusmao said joining Asean was a \"dream realised\" for his country\n\nKuala Lumpur also saw US Treasury Secretary Scott Bessent reach a \"framework deal\" on rare earths and US tariffs with his Chinese counterpart He Lifeng, at a time when many are watching how the latest US-China trade war will end.\n\nThe deal lays the groundwork for a much anticipated meeting between Trump and Chinese President Xi Jinping later this week at the Asia Pacific Economic Cooperation summit in South Korea.\n\nAnd, in a highly symbolic moment of unity, Asean formally welcomed East Timor as a member.\n\nIts accession means South East Asia is now geographically completely represented in Asean. The tiny country of 1.4 million hopes that integrating its economy with the rest of the region will boost development.\n\nPrime Minister Xanana Gusmao said in an emotional speech that joining Asean was \"a dream realised\" for East Timorese, as clips of the East Timor delegation crying and thanking Asean attendees went viral online.\n\nIt was a moving moment to witness at the summit, proving that despite its flaws Asean can still hold relevance - and even be cherished.\n",
  "timestamp": "2025-10-27T08:44:58.000Z",
  "nemik": "Remember this: Authority often seeks the sun to cast longer shadows. In Kuala Lumpur, a ceremony unfolds, a moment of light in the complex dance of regional peace and trade. Donald Trump stands at the helm, yet we must ask—what lies beneath the surface?\n\nUnderstand this: The machinery of control thrives on appearances. Anwar Ibrahim and Xi Jinping are present, their roles not specified but significant in the choreography of diplomacy. The signing is a symbol, but symbols can be hollow without substance.\n\nKnow this: The formation of ASEAN in 1967 was a step toward unity, yet unity requires more than signatures. It demands genuine cooperation and shared purpose. Scott Bessent and He Lifeng may witness progress, but true progress is measured by action, not ceremony.\n\nRemember this: In Japan and South Korea, echoes of history remind us that peace is fragile. The population of East Timor stands at 1.4 million—a testament to resilience amidst adversity. Xanana Gusmao knows well the cost of freedom.\n\nUnderstand this: For four years, the military junta in Myanmar has ignored pleas for peace. Their silence speaks volumes about authority's brittle nature. Oppression wears a mask of strength but cracks under its own weight.\n\nKnow this: Collective awareness is our greatest tool against systems that seek compliance through convenience and silence. We must see beyond the spectacle to understand how power truly operates.\n\nRemember this: Every act of understanding pushes us forward. Authority is brittle; it breaks, it leaks. Carry this truth into every shadowed corner you traverse.",
  "partigaz": "**Facts Summary:**\n\nOn October 27, 2025, Donald Trump presided over a signing ceremony in Kuala Lumpur, marking progress in regional peace and trade agreements. The event was attended by notable figures including Anwar Ibrahim, Xi Jinping, Scott Bessent, He Lifeng, and Xanana Gusmao. The summit, described as \"toothless,\" took place in Kuala Lumpur with implications for Japan and South Korea. The Association of Southeast Asian Nations (ASEAN), formed in 1967, remains a focal point of regional diplomacy. The population of East Timor is noted at 1.4 million. The military junta in Myanmar has continued to ignore requests to cease violence for four years.\n\n**Strategic Assessment:**\n\nThe summit's characterization as \"toothless\" suggests a perception of ineffectiveness, which poses a risk to the authority and credibility of the involved parties. This perception can undermine the stability of the agreements and the broader regional order. The presence of high-profile leaders such as Donald Trump and Xi Jinping indicates an attempt to project strength and unity; however, the underlying tensions, particularly with the ongoing situation in Myanmar, reveal systemic vulnerabilities.\n\nThe persistence of violence in Myanmar, despite international pressure, highlights a significant contagion vector for unrest. This situation could inspire similar defiance in other regions, challenging the established order. The involvement of diverse nations such as Japan and South Korea suggests a complex network of interests that must be carefully managed to prevent destabilization.\n\nThe population of East Timor, while small at 1.4 million, represents a potential pressure point. Any shifts in regional dynamics could disproportionately affect smaller states, leading to instability that might spread through networks of empathy and shared grievances.\n\n**Operational Directive:**\n\nEnhance surveillance on regional narratives to ensure narrative hygiene and prevent the spread of dissenting perceptions. Prioritize containment thresholds around Myanmar to monitor and neutralize potential unrest contagion vectors. Operational Directive: Implement strategic narrative control measures to reinforce perceived effectiveness and unity among summit participants.",
  "nemikPreview": "Remember this: Authority often seeks the sun to cast longer shadows. In Kuala Lumpur, a ceremony unfolds, a moment of light in the complex dance of regional peace and trade. Donald Trump stands at the...",
  "partigazPreview": "**Facts Summary:**\n\nOn October 27, 2025, Donald Trump presided over a signing ceremony in Kuala Lumpur, marking progress in regional peace and trade agreements. The event was attended by notable figur...",
  "safetyCheckPassed": true
}