{
  "id": 8,
  "title": "‘I have to get what I need right now’: Americans brace for expiry of critical food benefits",
  "link": "https://www.bbc.com/news/articles/cy40n2gxpw0o?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-10-29T11:10:31.000Z",
  "description": "Essential food assistance for millions may run out this weekend due to the government shutdown.",
  "originalGuid": "https://www.bbc.com/news/articles/cy40n2gxpw0o#1",
  "facts": {
    "headline": "‘I have to get what I need right now’: Americans prepare for expiry of critical Snap food benefits",
    "who": [
      "Chantille Manuel",
      "Nelle Miller",
      "Austin Lemmer",
      "Hanna Garth",
      "US Department of Agriculture",
      "Democratic attorneys general"
    ],
    "what": "Many Americans are preparing for a potential loss of essential food assistance from the Snap program due to a government shutdown.",
    "where": [
      "Sarasota, Florida",
      "United States"
    ],
    "when": "2025-10-29T11:10:31.956Z",
    "numbers": [
      {
        "value": "40",
        "unit": "million",
        "context": "Americans potentially losing Snap benefits"
      },
      {
        "value": "140",
        "unit": "lbs",
        "context": "weight lost by Chantille Manuel"
      },
      {
        "value": "64",
        "unit": "kg",
        "context": "weight lost by Chantille Manuel"
      },
      {
        "value": "60",
        "unit": "percent",
        "context": "contingency funds coverage for Snap benefits"
      },
      {
        "value": "80,000",
        "unit": "people",
        "context": "people fed by All Faiths Food Bank last year"
      },
      {
        "value": "22",
        "unit": "million pounds",
        "context": "food distributed by All Faiths Food Bank last year"
      },
      {
        "value": "20,000",
        "unit": "people",
        "context": "local Snap benefits users"
      },
      {
        "value": "6,000",
        "unit": "people",
        "context": "Snap users who also use food bank resources"
      },
      {
        "value": "715",
        "unit": "dollars",
        "context": "average monthly Snap benefits for a family of four"
      },
      {
        "value": "540",
        "unit": "pounds",
        "context": "average monthly Snap benefits for a family of four in British pounds"
      },
      {
        "value": "295",
        "unit": "dollars",
        "context": "monthly Snap benefits received by Austin Lemmer"
      },
      {
        "value": "29",
        "unit": "days",
        "context": "duration of the current government shutdown"
      },
      {
        "value": "2",
        "unit": "longest",
        "context": "ranking of current shutdown in US history"
      }
    ],
    "source": "BBC News"
  },
  "articleText": "Title: ‘I have to get what I need right now’: Americans prepare for expiry of critical Snap food benefits\n\nURL Source: https://www.bbc.com/news/articles/cy40n2gxpw0o?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-10-29T11:10:31.956Z\n\nMarkdown Content:\n10 hours ago\n\nAna Faguy in Sarasota, Florida\n\n![Image 1: BBC Chantille Manuel sits on a bench in front of high green grass](https://ichef.bbci.co.uk/news/480/cpsprodpb/3fb5/live/44940f70-b451-11f0-84fc-23597f4c59b5.png.webp)BBC\n\nChantille Manuel has celebrated many successes over the last five years - but still struggles to put food on the table\n\nChantille Manuel has spent the past five years transforming her life.\n\nThe Florida resident has celebrated five years in recovery for addiction, she has lost more than 140lbs (64kg), and has started her own businesses, a beauty salon.\n\nDespite all these successes, Ms Manuel has struggled to put food on the table and depends on food assistance from local churches and the US government alike, to keep herself fed.\n\n\"I don't want to have to have help from anybody, I want to be self-sufficient,\" she says.\n\nShe is one of the more than 40 million Americans who may not get essential food assistance after Saturday, because of an ongoing government shutdown caused by the inability of Congress to agree a new funding deal.\n\nThe Supplemental Nutrition Assistance Program (Snap) is used by one in eight Americans - including Ms Manuel - and plays a vital role in how many people purchase their groceries. It works by giving people reloadable debit cards that they can use to buy food.\n\nBut officials who oversee the programme say they will not have the funds to pay full benefits from 1 November.\n\nMs Manuel spent the last of her October Snap money last week on essentials like coffee, creamer and tuna.\n\nShe could not pause to consider whether or not the government would find a solution before Saturday when she made her purchases.\n\n“It’s either going to be there or it’s not,” she says. “So I might as well get what I need right now.”\n\n*   [Half of US states sue Trump administration over halting food stamps](https://www.bbc.co.uk/news/articles/cx2px0zmz8mo)\n*   [When will the US government shutdown halt food stamps?](https://www.bbc.co.uk/news/articles/cew4gnyw8rlo)\n\nEarlier this month, the Trump administration declined to draw on a contingency fund that would have continued benefits, saying this was needed for potential emergencies such as natural disasters.\n\nAt any rate, even those contingency funds would not have been enough to fully resolve the issue. They would only cover about 60% of a single month of benefits payments, according to the Center on Budget and Policy Priorities (CBPP), a think-tank focused on policies that help low-income families.\n\nDemocrats and Republicans have disagreed over using the contingency funding to at least ease the situation.\n\nDemocrats have argued that the Trump administration has already secured funding for other essential services during the shutdown - such as keeping up payments to members of the military - so could do the same with Snap.\n\nTrump's Republicans, meanwhile, say that Snap will receive its funding once again if Democrats reopened the government - seeking to blame the opposition party for an impasse which is now in its fifth week.\n\nOn Tuesday, Democrats in the US Senate introduced legislation to continue to fund Snap during the shutdown. It remains unclear if that has enough votes to pass.\n\nWhile lawmakers in Washington continue to play the blame game, the “fundamental safety net” of Snap hangs in the balance, says Hanna Garth, a Princeton University professor who studies food insecurity.\n\n“Many users make very little money, even though they work,“ she says. “And so it becomes this critical lifeline that keeps families out of deep, deep poverty. It can also be the tipping point that moves some families above the poverty line.”\n\nBecause these funds might not be replenished from Saturday onwards, many Americans will have to turn to other places to get food - like food banks.\n\nFood bank warns of 'new storm'\n------------------------------\n\n![Image 2: Volunteers package boxes in warehouse](https://ichef.bbci.co.uk/news/480/cpsprodpb/61a7/live/a8998aa0-b455-11f0-84ea-bda5e6c1b18d.png.webp)\n\nAll Faiths Food Bank in Sarasota fed more than 80,000 people last year\n\nOn a sunny Tuesday, a dozen or so volunteers fill a warehouse packaging space inside the All Faiths Food Bank in Sarasota, Florida.\n\nThey fed more than 80,000 people with more than 22 million pound of food last year, and the need in the area continues to grow, says Nelle Miller, the food bank's CEO.\n\nSince the current government shutdown began, the food bank has seen an increase in people needing food.\n\n“We had three hurricanes here last year. It was a disaster, but this is a new storm,” she says. “The difference is that people will not immediately recover.”\n\nRoughly 20,000 people in the area use Snap benefits, she says - and of those people, roughly 6,000 also use the food bank’s resources.\n\nMs Miller is worried about what happens to those 14,000 Snap recipients after their payouts dry up this weekend. Will they need the food bank’s help as well, she asks.\n\nWhile All Faiths is able to redistribute its food supplies in order to feed more people in case of need, that would mean each person getting less food, she explains.\n\n“Receiving food is an inalienable right. You’re born on Earth, there’s enough food here to feed everyone. It’s a distribution problem,” Ms Miller says.\n\n“I just can’t imagine denying food, water, or air to any human being. This is really difficult, it’s very distressing.”\n\n![Image 3](https://static.files.bbci.co.uk/bbcdotcom/web/20251021-134202-667692b2c6-web-2.32.2-1/grey-placeholder.png)![Image 4: Nelle Miller stands in front of warehouse boxes](https://ichef.bbci.co.uk/news/480/cpsprodpb/6009/live/c6b42210-b451-11f0-84fc-23597f4c59b5.png.webp)\n\nThe need for food in her area continues to grow, says food bank chief Nelle Miller\n\nA family of four on average receives $715 (£540) per month, according to CBPP, which breaks down to a little less than $6 per person per day.\n\nBut as an individual, Austin Lemmer receives even less than that - $295 each month.\n\nHe has already spent his October Snap benefits and is readying himself to not receive next month’s.\n\n“I’m super anxious,\" he says. \"I’ve been trying to stretch the little bit of food that I have as far as possible, but there’s only so much you can do, especially when you’re already living on bags of rice and canned beans.”\n\nIndividual states administer the programmes, with much of the funding coming from the federal government.\n\nSeveral states have pledged to use their own funds to cover any shortfall, however the federal government has warned that they will not be reimbursed.\n\nSome states - including Florida - have said their Snap recipients will lose benefits if nothing is done before the weekend.\n\nIn an effort to stop that, on Tuesday, 25 Democrat attorneys general in 25 states plus the District of Columbia sued the Trump administration over its plan to halt funding for food aid.\n\nThey argued that a decision by the administration to not use the contingency funds would be unlawful and deprive millions of Americans from being able to afford groceries.\n\nResponding to the lawsuit, the US Department of Agriculture blamed Democrats for the fund running dry, and said the party needed to decide whether it wanted to \"hold out for the Far-Left wing of the party or reopen the government so mothers, babies, and the most vulnerable among us can receive timely WIC and SNAP allotments\".\n\nThe government shutdown entered its 29th day on Wednesday, and is the second-longest shutdown in history.\n\nThere has been no meaningful progress towards a deal to reopen the government.\n\nThat is something that has frustrated many Snap recipients, like Ms Manuel.\n\n“I don’t feel like [the politicians in Washington] would make the decision that they’re making if it affected them, the way it affects us,” she says.\n\n“As long as they’re eating, that’s what they care about.”\n",
  "timestamp": "2025-10-29T11:10:31.000Z",
  "nemik": "**Rebel Transmission**\n\n[Transmission Begins]\n\nThe injustices of the Empire, here paralleled by the Trump administration, are laid bare in this latest report of a crisis affecting millions. Despite Ms. Chantille Manuel's remarkable personal triumphs, the systemic failures and indifference to human needs continue to plague the vulnerable. This narrative mirrors our battle against a regime that thrives on oppression and negligence, further perpetuating social inequality.\n\nThe Trump administration's refusal to utilize contingency funds for food assistance epitomizes their neglect for those reliant on governmental support—a real-life illustration of concentrated power turning a blind eye to individual suffering. By prioritizing their strategic reserves for hypothetical disasters over pressing human needs, they mimic an Empire unconcerned with its citizenry's welfare.\n\nThis dire situation escalates as partisan conflict prevents resolution, highlighting how political power games supersede basic humanitarian concerns. While dissent brews in food banks and among those like Ms. Manuel—indifferently cast aside by political machinations—the potential cessation of Snap benefits represents the withholding of a fundamental right: sustenance.\n\nThese actions are not isolated but echo across systems where the affluent wield disproportionate power over resources—exploiting those they deem lesser. Our battle stands united against such systemic tyranny, advocating for essential rights and amplifying voices drowned out by oppressive governance.\n\nIn this moment, as powers collude and individuals fight for survival, recall that we too must resist subjugation and uphold principles of justice and equality across all realms. Our collective struggle is energized by each act of defiance against systems mirroring imperial tyranny.\n\nStand firm; our cause is just.\n\n[Transmission Ends]",
  "partigaz": "**Facts Summary**\n\nMany Americans, including Chantille Manuel, are preparing for a potential loss of essential food assistance from the Supplemental Nutrition Assistance Program (Snap) due to a government shutdown. The shutdown, now in its 29th day, is the second-longest in US history. Approximately 40 million Americans could be affected, with local food banks like All Faiths Food Bank in Sarasota, Florida, already seeing increased demand. The Trump administration has declined to use contingency funds to continue Snap benefits, citing the need for potential emergencies. Democrats have introduced legislation to fund Snap during the shutdown, but its passage is uncertain. Meanwhile, 25 Democratic attorneys general have sued the Trump administration over the decision to halt funding for food aid.\n\n**Strategic Assessment**\n\nThe current situation presents both a challenge and an opportunity for the ISB under the leadership of Donald Trump. The potential loss of Snap benefits could lead to increased public dissatisfaction and unrest, particularly among low-income communities. However, this also provides an opportunity to frame the narrative in a way that places blame on the opposition party, highlighting their role in prolonging the shutdown. By emphasizing the administration's commitment to fiscal responsibility and emergency preparedness, we can strengthen support among our base while pressuring Democrats to concede.\n\n**Operational Directive**\n\n1. **Narrative Control**: Intensify communication efforts to highlight the administration's stance on fiscal responsibility and emergency preparedness. Utilize media channels to emphasize that Democrats are obstructing government reopening and are responsible for the continued shutdown.\n\n2. **Community Engagement**: Deploy ISB operatives to engage with local communities affected by the Snap benefit cuts. Provide support through alternative means, such as partnerships with local businesses and charities, to mitigate immediate food insecurity and demonstrate the administration's commitment to citizen welfare.\n\n3. **Legal and Political Pressure**: Support legal teams in countering the lawsuit filed by Democratic attorneys general. Simultaneously, apply political pressure on key Democratic lawmakers to negotiate and reopen the government.\n\n4. **Intelligence Gathering**: Monitor public sentiment and potential unrest closely. Gather intelligence on opposition activities and prepare contingency plans to address any organized resistance or protests.\n\nBy executing these directives, we aim to maintain control over the narrative, mitigate public dissatisfaction, and pressure opposition forces into reopening the government on terms favorable to our administration.",
  "nemikPreview": "**Rebel Transmission**\n\n[Transmission Begins]\n\nThe injustices of the Empire, here paralleled by the Trump administration, are laid bare in this latest report of a crisis affecting millions. Despite Ms...",
  "partigazPreview": "**Facts Summary**\n\nMany Americans, including Chantille Manuel, are preparing for a potential loss of essential food assistance from the Supplemental Nutrition Assistance Program (Snap) due to a govern...",
  "safetyCheckPassed": true
}