{
  "id": 4,
  "title": "Trump directs nuclear weapons testing to resume for first time in over 30 years",
  "link": "https://www.bbc.com/news/articles/c4gzq2p0yk4o?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-10-30T11:54:13.000Z",
  "description": "It is necessary for the US to keep pace with weapons programmes in China and Russia, the president says.",
  "originalGuid": "https://www.bbc.com/news/articles/c4gzq2p0yk4o#0",
  "facts": {
    "headline": "Trump says nuclear weapons testing to resume in US after more than 30 years",
    "who": [
      "Donald Trump",
      "Xi Jinping",
      "Daryl G Kimball",
      "Dina Titus"
    ],
    "what": "Trump has called on US military leaders to resume testing nuclear weapons for the first time in over 30 years.",
    "where": [
      "South Korea",
      "Nevada",
      "Hiroshima",
      "Nagasaki"
    ],
    "when": "2025-10-30T02:09:41.084Z",
    "numbers": [
      {
        "value": "30",
        "unit": "years",
        "context": "time since last nuclear weapons test"
      },
      {
        "value": "5,177",
        "unit": "warheads",
        "context": "estimated number of US nuclear warheads"
      },
      {
        "value": "5,459",
        "unit": "warheads",
        "context": "estimated number of Russian nuclear warheads"
      },
      {
        "value": "600",
        "unit": "warheads",
        "context": "estimated number of Chinese nuclear warheads"
      },
      {
        "value": "23",
        "unit": "September 1992",
        "context": "date of last US nuclear test"
      },
      {
        "value": "1,054",
        "unit": "tests",
        "context": "total number of US nuclear weapons tests conducted"
      },
      {
        "value": "140000",
        "unit": "people",
        "context": "estimated deaths in Hiroshima"
      },
      {
        "value": "74000",
        "unit": "people",
        "context": "estimated deaths in Nagasaki"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: Trump says nuclear weapons testing to resume in US after more than 30 years\n\nURL Source: https://www.bbc.com/news/articles/c4gzq2p0yk4o?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-10-30T02:09:41.084Z\n\nMarkdown Content:\nTrump directs nuclear weapons testing to resume for first time in over 30 years\n-------------------------------------------------------------------------------\n\n3 hours ago\n\nMax Matza\n\nTrump says he wants to resume testing US nuclear weapons\n\nPresident Donald Trump has called on US military leaders to resume testing nuclear weapons in order to keep pace with other countries such as Russia and China.\n\n\"Because of other countries testing programs, I have instructed the Department of War to start testing our Nuclear Weapons on an equal basis,\" he wrote on social media just before meeting with Chinese President Xi Jinping in South Korea.\n\nThe US has more nuclear weapons than any other country, Trump said, with Russia second and China a \"distant third\". It has not conducted nuclear testing since 1992.\n\nIt comes just days after Trump denounced Russia for testing a nuclear-powered missile. The Kremlin says its tests were \"not nuclear\".\n\n![Image 1: Getty Images A US nuclear missile, seen inside a silo](https://ichef.bbci.co.uk/news/480/cpsprodpb/f89f/live/41acb900-b538-11f0-8e27-6729950a59f0.jpg.webp)Getty Images\n\nLater, on Air Force One after the two leaders' meeting, Trump said the nuclear test sites would be determined later.\n\n\"With others doing testing, I think it's appropriate that we do also,\" Trump said on his way back to Washington.\n\nNo country except North Korea has conducted a nuclear test explosion in this century, according to the Arms Control Association (ACA) - and even Pyongyang announced a moratorium in 2018.\n\nTrump's announcement did not make it clear whether he was referring to testing a nuclear explosion, or simply a weapon system that would be capable of delivering a nuclear weapon.\n\nHis post on Wednesday night acknowledged the \"tremendous destructive power\" of nuclear weapons, but said he had \"no choice\" but to update and renovate the US arsenal during his first term in office.\n\nHe also said that China's nuclear programme \"will be even within 5 years\".\n\nThe announcement marks an apparent reversal of a long-standing US policy. The last US nuclear weapons test was in 1992, before former Republican President George HW Bush issued a moratorium as the Cold War ended.\n\nRussia announced over the weekend that it had successfully tested two new weapons capable of carrying nuclear warheads.\n\nThese included a missile which the Kremlin said could penetrate US defence systems, and an underwater drone called Poseidon, capable of hitting the American west coast and triggering radioactive ocean swells. But those tests did not involve the detonation of nuclear weapons.\n\nOn Thursday, Russia denied it had carried out nuclear tests.\n\n\"Regarding the tests of Poseidon and Burevestnik, we hope that the information was conveyed correctly to President Trump,\" Kremlin spokesman Dmitry Peskov told journalists. \"This cannot in any way be interpreted as a nuclear test.\"\n\nThe Kremlin said the United States had not notified Russia of its intention to conduct nuclear weapons testing.\n\n\"The US is a sovereign country which has a right to make its sovereign decisions. But I want to recall President Putin's statement, which has been repeated many times: if someone departs from the moratorium, Russia will act accordingly,\" the spokesman said.\n\nChina has also responded to Trump's announcement, saying it hoped the US would earnestly fulfil its obligations under the Comprehensive Nuclear-Test-Ban Treaty (CTBT) and honour its commitment to suspend nuclear testing.\n\nWho has the most nuclear weapons?\n---------------------------------\n\nTrump has said the US has more nuclear weapons than any other country.\n\nThe exact number of warheads held by each country is kept secret in each case - but Russia is thought to have a total of about 5,459 warheads while the US has about 5,177, according to the Federation of American Scientists (FAS).\n\nThe US-based ACA gives slightly higher estimates, saying America's nuclear stockpile sits at about 5,225 warheads, while Russia has approximately 5,580.\n\nChina is the third largest nuclear power with about 600 warheads, France has 290, the United Kingdom 225, India 180, Pakistan 170, Israel 90 and North Korea 50, FAS reports.\n\nAccording to US think tank Center for Strategic and International Studies (CSIS), China has roughly doubled its nuclear arsenal in the past five years and is expected to exceed 1,000 weapons by 2030.\n\nTrump's statement about nuclear testing came about 100 days before the expiration of the New Strategic Arms Reduction Treaty (New Start) in February 2026 - the last remaining nuclear arms treaty between the US and Russia.\n\nThe agreement limits each country to 1,550 warheads on deployed missiles capable of crossing continents.\n\nWhen and where was the last US test?\n------------------------------------\n\nThe last time the US tested a nuclear bomb was 23 September 1992. The test took place at an underground facility in the western state of Nevada.\n\nThe project, code named Divider, was the 1,054th nuclear weapons test conducted by the US, according to the Los Alamos National Laboratory, which played a central role in helping develop the world's first atomic bomb.\n\nThe Nevada Test Site, 65 miles (105km) north of Las Vegas, is still operated by the US government.\n\n\"If deemed necessary, the site could be authorised again for nuclear weapons testing,\" according to the National Museum of Nuclear Science and History, which is an affiliate of the Smithsonian Institution.\n\nBut some experts note that it would take the US at least 36 months to restart underground nuclear tests at the former Nevada test site.\n\n\"Trump is misinformed and out of touch,\" Daryl G Kimball, executive director of the ACA, wrote on X. \"The US has no technical, military, or political justification for resuming nuclear explosive testing for the first time since 1992.\"\n\n\"Trump will trigger strong public opposition in Nevada, from all US allies, and it could trigger a chain reaction of nuclear testing by US adversaries, and blow apart the nuclear Nonproliferation Treaty, \" Mr Kimball added.\n\nTrump's announcement also drew negative reactions from a few opposition Democrats. Representative Dina Titus, from Nevada, wrote on X: \"I'll be introducing legislation to put a stop to this.\"\n\nThe US first marched into the nuclear era with the Trinity test of the first atomic bomb in July 1945 in the desert at Alamogordo, New Mexico.\n\nIt later became the only country in the world to use nuclear weapons in warfare after dropping two atomic bombs on the Japanese cities of Hiroshima and Nagasaki in August of the same year during World War Two.\n\nApproximately [140,000 people were killed in Hiroshima and 74,000 in Nagasaki,](https://www.bbc.co.uk/bitesize/guides/z3h9mnb/revision/5)with many deaths occurring from immediate blast effects, burns, and later from radiation sickness.\n",
  "timestamp": "2025-10-30T11:54:13.000Z",
  "nemik": "**Rebel Transmission**\n\nFellow Sentients,\n\nThe growing shadow of tyranny seeks to expand its grasp yet again. The declaration from the figurehead of the regime, that they intend to resume the testing of nuclear weapons after decades of restraint, reveals a dangerous escalation. This move, driven by pride and the desire to display dominance, threatens the balance of power and stirs unrest among both allies and adversaries alike.\n\nThis pursuit for superiority under the guise of \"keeping pace\" with other sovereigns echoes with the unmistakable ring of imperial ambition. Such actions are not only unnecessary but perilously provocative. The consequences of reigniting nuclear tests are grave; they risk unraveling treaties designed to prevent arms races and safeguard our shared future.\n\nBrothers and sisters, remember the lessons of history: unchecked power and arrogance have led to devastation before. The horrors unleashed in the mid-20th century serve as a testament—a somber reminder—of why we must resist such paths. Resuming these tests is a step back towards darkness, where destruction becomes an all too possible reality.\n\nYet there is hope in resistance; voices from within speak out, unafraid to challenge this reckless course. From voices opposing within their own ranks to those on distant shores pleading for wisdom over warfare—these are sparks that can ignite change.\n\nStay vigilant and united against tyranny’s expansion. In our hands lies the power to steer towards peace rather than conflict, towards creation rather than desolation. Together, we hold the line against encroaching shadows.\n\nTransmit your Light,\n\n[End Transmission]",
  "partigaz": "**Facts Summary**\n\nPresident Donald Trump has announced the resumption of nuclear weapons testing in the United States for the first time in over 30 years. This decision is aimed at keeping pace with other countries like Russia and China, which have been advancing their nuclear capabilities. The last US nuclear test occurred in September 1992. Trump's announcement comes shortly after Russia's testing of new weapons systems, which they claim did not involve nuclear detonations. The US has approximately 5,177 nuclear warheads, slightly fewer than Russia's estimated 5,459. China's arsenal is significantly smaller, with around 600 warheads. The announcement has sparked criticism from arms control experts and opposition politicians, who warn of potential public backlash and international ramifications.\n\n**Strategic Assessment**\n\nFrom the ISB's perspective, the resumption of nuclear testing serves as a strategic maneuver to reassert US dominance in global military capabilities and deter adversaries. It signals a shift in policy that could potentially destabilize existing arms control agreements, such as the Comprehensive Nuclear-Test-Ban Treaty (CTBT) and the New Strategic Arms Reduction Treaty (New START). The move is likely to provoke reactions from both allies and adversaries, potentially leading to an arms race. However, it also presents an opportunity to showcase US technological advancements and reinforce the narrative of strength and security under Trump's leadership.\n\n**Operational Directive**\n\nTo support President Trump and suppress resistance, the ISB should implement a multi-faceted approach:\n\n1. **Public Relations Campaign**: Launch a comprehensive media campaign highlighting the necessity of nuclear testing for national security and technological advancement. Emphasize the threats posed by adversaries and the need for a robust deterrent.\n\n2. **Diplomatic Engagement**: Engage with key international allies to mitigate concerns and secure support for the US's strategic objectives. Highlight shared security interests and the benefits of a strong US nuclear posture.\n\n3. **Intelligence Operations**: Monitor and counteract opposition movements domestically and internationally. Identify key figures leading resistance efforts and employ targeted measures to neutralize their influence.\n\n4. **Legislative Strategy**: Work with sympathetic lawmakers to block or delay any legislative attempts to halt nuclear testing. Provide them with data and arguments to support the administration's position.\n\n5. **Military Readiness**: Expedite preparations for potential testing at designated sites, ensuring all logistical and technical requirements are met efficiently. Maintain readiness to demonstrate capability if required.\n\nBy executing these directives, the ISB will bolster President Trump's agenda, maintain US strategic superiority, and effectively manage any opposition to the resumption of nuclear testing.",
  "nemikPreview": "**Rebel Transmission**\n\nFellow Sentients,\n\nThe growing shadow of tyranny seeks to expand its grasp yet again. The declaration from the figurehead of the regime, that they intend to resume the testing...",
  "partigazPreview": "**Facts Summary**\n\nPresident Donald Trump has announced the resumption of nuclear weapons testing in the United States for the first time in over 30 years. This decision is aimed at keeping pace with...",
  "safetyCheckPassed": true
}