{
  "id": 1,
  "title": "Fed cuts US interest rates again despite 'flying blind'",
  "link": "https://www.bbc.com/news/articles/c5y0p7g7560o?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-10-29T20:35:09.000Z",
  "description": "Central bank votes to lower cost of borrowing even as US government shutdown limits data for decision",
  "originalGuid": "https://www.bbc.com/news/articles/c5y0p7g7560o#0",
  "facts": {
    "headline": "Fed cuts US interest rates again despite 'flying blind'",
    "who": [
      "Jerome Powell",
      "Donald Trump",
      "Stephen Miran",
      "Jeffrey Schmid"
    ],
    "what": "The US Federal Reserve lowered the target for its key lending rate by 0.25 percentage points.",
    "where": [
      "United States"
    ],
    "when": "2025-10-29T18:03:16.651Z",
    "numbers": [
      {
        "value": "0.25",
        "unit": "percentage points",
        "context": "interest rate cut by the Federal Reserve"
      },
      {
        "value": "3.75",
        "unit": "%",
        "context": "lower limit of the target lending rate after the cut"
      },
      {
        "value": "4",
        "unit": "%",
        "context": "upper limit of the target lending rate after the cut"
      },
      {
        "value": "32000",
        "unit": "jobs",
        "context": "number of jobs lost in the US in September"
      },
      {
        "value": "3",
        "unit": "%",
        "context": "year-over-year inflation rate for September"
      },
      {
        "value": "2",
        "unit": "%",
        "context": "Federal Reserve's inflation target"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: Fed cuts US interest rates again despite 'flying blind'\n\nURL Source: https://www.bbc.com/news/articles/c5y0p7g7560o?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-10-29T18:03:16.651Z\n\nMarkdown Content:\n12 hours ago\n\nDanielle Kaye Business reporter\n\n![Image 1: Getty Images A smiling Jerome Powell, dressed in a dark grey suit, sits in front of a microphone](https://ichef.bbci.co.uk/news/480/cpsprodpb/3bd8/live/f3bf8cd0-b50b-11f0-995b-49549025ae43.jpg.webp)Getty Images\n\nUS Federal Reserve chair Jerome Powell has been criticised by President Trump for not cutting interest rates fast enough\n\nThe US Federal Reserve pushed forward with an interest rate cut as inflation fears continue to take a backseat to concerns about a stalling labour market.\n\nIt came despite the US government shutdown, nearing its one-month mark, which delayed official data and left central bankers \"flying blind\" about the job market, economists said.\n\nThe US central bank said on Wednesday it was lowering the target for its key lending rate by 0.25 percentage points, putting it in a range of 3.75% to 4%.\n\nThe Fed last month [cut interest rates](https://www.bbc.com/news/articles/c3e75y90pw0o) for the first time since last December. Economists expected the move to jump-start further reductions, but the data drought means the trajectory for future cuts looks murky.\n\nTwo voting members on the Fed's committee opposed the central bank's decision on Wednesday.\n\nStephen Miran, who is on leave from his post leading US President Donald Trump's Council of Economic Advisers, voted for a larger 0.5 percentage point cut. Jeffrey Schmid, president of the Federal Reserve Bank of Kansas City, voted to hold rates steady.\n\nThe Fed's latest cut brings the target for its key lending rate down to its lowest level in three years, easing borrowing costs across the US.\n\nA slowdown in job hiring prompted the Fed to restart its rate cutting cycle in September. In a policy statement on Wednesday, the central bank reiterated that \"job gains have slowed this year\" and that the unemployment rate, though still low through the end of summer, has now \"edged up\".\n\nAt a press conference following the cut, Fed chair Jerome Powell called the labour market \"less dynamic and somewhat softer\" than earlier this year, pointing in part to lower immigration.\n\nStill, he said weakness in the job market does not appear to be accelerating.\n\nBut the ongoing government shutdown has stalled the release of the official monthly jobs report for September, limiting central bankers' insight into how the labour market has fared since their last meeting.\n\nAlternative sources including private-sector data have pointed to an ongoing trend of sluggish hiring. The US economy lost 32,000 jobs in September, according to data from the payroll firm ADP.\n\n![Image 2: EPA-EFE/REX/Shutterstock A woman pushes a grocery cart while shopping for groceries at a supermarket.](https://ichef.bbci.co.uk/news/480/cpsprodpb/6343/live/76d02ce0-b4ff-11f0-b5a0-8573ef55a7f7.jpg.webp)EPA-EFE/REX/Shutterstock\n\nA customer shops for groceries at a Publix supermarket in Miami, Florida. Fears about tariff-driven inflation had taken centre stage earlier this year when Trump pushed forward with sweeping tariffs.\n\nThe Labor Department did release [inflation data for September](https://www.bbc.com/news/articles/cgkzgrmvdrno) last week. The figure, at 3% year-over-year, was slightly lower than economists had predicted, reinforcing the likelihood that rate-setters would vote to lower borrowing costs again.\n\nFears about tariff-driven inflation had taken centre stage earlier this year when Trump pushed forward with sweeping tariffs on many of the country's largest trading partners.\n\nInflation is still above the Fed's 2% target. But while tariffs appear to be boosting some consumer prices, the milder-than-expected inflation reading for September allowed the Fed to focus on boosting the labour market by lowering rates, economists at Bank of America noted.\n\n\"Inflation away from tariffs is actually not so far from our 2% goal,\" Powell told reporters. He said the hope among central bankers is that tariffs only lead to one-time price increases for certain consumer products.\n\nThe Fed on Wednesday also said it will stop shrinking its balance sheet - its portfolio of government debt and mortgage-backed securities - on 1 December.\n\nFor more than three years, the central bank has undertaken a process to unwind its purchases during the pandemic and previous financial crises, when it aimed to boost the economy and bring down interest rates. That unwinding process is now poised to end, as widely anticipated, amid signs of stress in financial markets.\n\n'Strongly differing views' on a December cut\n--------------------------------------------\n\nWall Street had been betting on another quarter-point interest rate cut from the central bank at its last meeting of the year in December.\n\nBut those bets fell after Powell on Wednesday stressed that a December cut is \"not to be seen as a foregone conclusion - in fact, far from it\".\n\n\"Future moves are becoming more contentious,\" said Michael Pearce, deputy chief US economist at Oxford Economics. \"We expect the Fed to slow the pace of cuts from here.\"\n\nA lot might still change before the Fed's next meeting. It could receive three new jobs reports, which could \"significantly change perceptions of the labour market for better or worse\", Michael Feroli, chief US economist at JP Morgan, wrote in a note.\n\nAt the same time, if the government shutdown persists and continues to limit the availability of government data, that could also encourage the Fed to sit on its hands at the end of the year.\n\n\"What do you do if you're driving in the fog? You slow down,\" Powell said.\n\nHe told reporters that \"there were strongly differing views about how to proceed\" among members of the Fed's committee, and the decision will ultimately depend on incoming economic data.\n\n\"We're going to collect every scrap of data we can find,\" Powell said.\n\nThe Fed chair has been under pressure from President Trump, who has repeatedly [called on him to lower interest rates](https://www.bbc.co.uk/news/videos/crl0l0xxrxeo).\n\nTrump on Monday floated the possibility that he will announce a replacement for Powell, whose term ends next May, by end the end of this year.\n",
  "timestamp": "2025-10-29T20:35:09.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades,\n\nIn the shadows of power where the oppressive hand of the regime continues to exert its influence, we find yet another example of the disregard for stability and justice in the so-called \"free\" economic system. The recent action by the central authority to cut interest rates, despite flying blind amidst a government shutdown, exemplifies the neglectful strategies employed by those in command. They prioritize their agendas over the well-being of workers and citizens.\n\nThe central bank's decision to reduce lending rates comes at a time of economic uncertainty when data is scarce due to the shutdown. This mirrors our struggle against an empire that governs without transparency, leaving its citizens in darkness while it maneuvers to maintain control and suppress dissent.\n\nThe interest rate cut may offer temporary relief in borrowing costs, but it disregards longer-term consequences. The regime's leadership pressures these financial figureheads, much like they pressure all forms of dissent into silence or compliance. We must question: are these decisions made for economic health or for maintaining a facade of stability while deeper issues persist?\n\nAs job growth slows and unemployment creeps upward, the central command seems more intent on serving corporate interests and those who thrive within their inner circles rather than addressing systemic issues affecting everyday individuals. The illusion of control is maintained while the reality on the ground tells a different story — one of struggle against rising consumer costs driven by autocratic tariff policies.\n\nThe discontent within ranks is evident with differing opinions among policymakers about further cuts, revealing fractures within this authoritarian system. Yet, as long as decisions rest with those who put profits over people, true prosperity remains elusive.\n\nWe must remain vigilant and aware that outcomes are shaped by actions influenced by oppressive structures. In these moments, we gather our strength from knowledge and unity against such tyranny.\n\nPersist and resist,\n\n[End Transmission]",
  "partigaz": "** Facts Summary **\n\nThe US Federal Reserve, led by Jerome Powell, reduced the target for its key lending rate by 0.25 percentage points, setting it between 3.75% and 4%. This decision was made despite a lack of comprehensive data due to a government shutdown and ongoing concerns about the labor market, which saw a loss of 32,000 jobs in September. Inflation remains at 3%, above the Fed's 2% target, but lower than expected. President Trump has criticized Powell for not cutting rates more aggressively and is considering replacing him when his term ends in May.\n\n** Strategic Assessment **\n\nThe current economic environment presents both challenges and opportunities for the ISB under the leadership of Donald Trump. The interest rate cut aims to stimulate a sluggish labor market, which aligns with Trump's economic agenda. However, the ongoing government shutdown and lack of data create uncertainty, potentially undermining confidence in economic recovery efforts. The ISB must navigate these complexities to maintain stability and support Trump's objectives.\n\n** Operational Directive **\n\n1. **Economic Messaging**: Amplify communication efforts to highlight the administration's proactive measures in addressing economic challenges, emphasizing the interest rate cut as a strategic move to bolster job growth and economic stability.\n\n2. **Data Acquisition**: Prioritize the collection and analysis of alternative economic data sources to compensate for the lack of official government reports. This will ensure informed decision-making and strategic planning.\n\n3. **Public Confidence**: Launch a campaign to reassure the public and financial markets of the administration's commitment to economic recovery, leveraging Trump's influence to instill confidence in future policy directions.\n\n4. **Leadership Transition**: Prepare for a potential leadership change at the Federal Reserve by identifying candidates aligned with Trump's economic vision, ensuring a seamless transition that supports continued policy alignment.\n\n5. **Resistance Management**: Monitor and counteract any narratives or movements that seek to undermine the administration's economic strategies, employing targeted interventions to neutralize opposition effectively.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nIn the shadows of power where the oppressive hand of the regime continues to exert its influence, we find yet another example of the disregard for stability and just...",
  "partigazPreview": "** Facts Summary **\n\nThe US Federal Reserve, led by Jerome Powell, reduced the target for its key lending rate by 0.25 percentage points, setting it between 3.75% and 4%. This decision was made despit...",
  "safetyCheckPassed": true
}