{
  "id": 4,
  "title": "Trump hails 'amazing' meeting with China's Xi but no formal trade deal agreed ",
  "link": "https://www.bbc.com/news/articles/crl25xl1gjpo?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-10-30T16:06:07.000Z",
  "description": "The US president and his Chinese counterpart met face-to-face for the first time in six years.",
  "originalGuid": "https://www.bbc.com/news/articles/crl25xl1gjpo#0",
  "facts": {
    "headline": "Trump hails 'amazing' meeting with Xi in South Korea",
    "who": [
      "Donald Trump",
      "Xi Jinping",
      "Scott Bessent",
      "Sean Stein"
    ],
    "what": "Trump and Xi met to discuss trade issues and reached a consensus on resolving major trade issues.",
    "where": [
      "South Korea"
    ],
    "when": "2025-10-30T10:24:05.426Z",
    "numbers": [
      {
        "value": "12",
        "unit": "million metric tonnes",
        "context": "soybeans China agreed to buy this season"
      },
      {
        "value": "25",
        "unit": "million tonnes",
        "context": "minimum soybeans China agreed to buy per year for the next three years"
      },
      {
        "value": "40",
        "unit": "percent",
        "context": "tax rate on goods arriving in the US from China"
      }
    ],
    "source": "BBC News"
  },
  "articleText": "Title: Trump hails 'amazing' meeting with Xi in South Korea\n\nURL Source: https://www.bbc.com/news/articles/crl25xl1gjpo?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-10-30T10:24:05.426Z\n\nMarkdown Content:\nTrump hails 'amazing' meeting with China's Xi but no formal trade deal agreed\n-----------------------------------------------------------------------------\n\n3 hours ago\n\nLaura Bicker,China correspondent ,\n\nAnthony Zurcher,North America correspondent and\n\nFlora Drury\n\nUS President Donald Trump and his Chinese counterpart, Xi Jinping, have met for the first time in six years - raising hopes for a de-escalation of tensions between the world's two biggest economies.\n\nTrump described the talks, held in South Korea, as \"amazing\", while Beijing said they had reached a consensus to resolve \"major trade issues\".\n\nRelations have been tense since Trump began imposing new tariffs on China, prompting retaliation from Beijing. The two agreed to a truce in May, but tensions remained high.\n\nThursday's talks did not lead to a formal agreement but the announcements suggest they are closer to a deal - the details of which have long been subject to behind-the-scenes negotiations.\n\nTrade deals normally take years to negotiate. Countries around the world have been thrown into resolving differences with Trump within a matter of months, after he imposed sweeping tariffs - or import taxes - on some of his top trade partners.\n\nSome of those key trading partners are in Asia, where Trump has spent the last several days.\n\nTariff 'truce' and movement on rare earths\n------------------------------------------\n\nChina has agreed to suspend export control measures it had placed on rare earths, crucial for the production of everything from smartphones to fighter jets. This has been seen as a key win for Trump from his meeting with Xi.\n\nA jubilant Trump told reporters on Air Force One that he had also got China to start immediately buying a \"tremendous amounts of soybeans and other farm products\". Retaliatory tariffs on American soybeans by Beijing had effectively halted imports from the US, harming US farmers - who constitute a key voting block for Trump.\n\nUS Treasury Secretary Scott Bessent later told Fox Business that China had agreed to buy 12 million metric tonnes of soybeans this season, and would follow that up with a minimum of 25 million tonnes per year for the next three years.\n\nIn the immediate aftermath of the meeting, the US also said it would drop part of the tariffs it has levied on Beijing over the flow of ingredients used in making fentanyl to the US. Trump has imposed severe tariffs on China, as well as Canada and Mexico, for their perceived failure to clamp down on the flow of that drug.\n\n*   [Xi and Trump find temporary truce as China plays longer game](https://www.bbc.com/news/articles/c8eyx718pz2o)\n*   [What tariffs has Trump announced and why?](https://www.bbc.com/news/articles/cn93e12rypgo)\n\nThe president of the US-China Business Council welcomed the news on tariffs and rare earths, describing these as the most significant outcome of the talks.\n\nSean Stein told the BBC: \"You could say that this is a truce, that we are now locked in place on tariffs and we don't have to worry every 90 days where other it's going to roll over\".\n\nSpeaking to Business Today from Beijing, Mr Stein said this \"gives business plenty of time to work on the Chinese and the US administration to make sure that they're focused on some of the long-standing issues that have troubled the trade relationship between the two countries.\"\n\nHowever, it seems other tariffs, or taxes on imported goods, will remain in place, meaning that goods arriving in the US from China are still being taxed at a rate of over 40% for US importers.\n\nMore positively for Beijing, it will now be able to speak to Jensen Huang, the head of US tech firm Nvidia - according to Trump. Nvidia is at the heart of the two countries' fight over AI chips: China wants high-end chips but the US wants to limit China's access, citing national security.\n\nBeijing has also extended an invitation to Trump to visit China in April - yet another sign of thawing relations.\n\nThere was, however, [no mention of a breakthrough on TikTok](https://www.bbc.co.uk/news/articles/c89dd747yz7o). The US has sought to take the video-sharing app's US operations away from Chinese parent company ByteDance for national security reasons. Beijing said afterwards it would continue to work to resolve the issues.\n\nChina more measured, talking of 'good start'\n--------------------------------------------\n\nThe meeting also showed the gulf between the two leaders' approaches.\n\nXi was self-contained, and said only what he had prepared. He entered the meeting knowing he had a strong hand. China had learned from Trump's first term, leveraging its chokehold on rare earths, and diversifying its trade partners so it is less reliant on the US.\n\nAfterwards, he was far more measured in his language than Trump. The two sides would be working on delivering outcomes that will serve as a \"reassuring pill\" for both countries' economies, he said.\n\nTrump was - as always - more ad-lib. But the US president was also noticeably more tense than he had been for the rest of his whirlwind trip to South East Asia - a reflection of the high stakes in Thursday's meeting.\n\nThe glamour and pageantry on show since he arrived at his first stop in Malaysia just five days ago was also absent.\n\nGone were the gold-laden palaces of the sort he was welcomed to in Japan on Tuesday. Instead, a building at an airport, lying behind barbed wire and security checkpoints.\n\nThe military bands which welcomed Trump to South Korea on Wednesday were nowhere to be seen.\n\nInstead, the only sign something important was going on inside was the heavy police and media presence.\n\nBut despite the quieter public face, what was happening inside was arguably the most significant hour and 20 minutes of the trip.\n\nHenry Wang, a former adviser to China's State Council, told BBC Radio 4's Today programme that Trump and Xi's talks \"went very well\".\n\nIt may not have been a trade deal, but a \"framework and structure has been laid\", he added - calling it \"a good start\".\n\n_Additional reporting by Jonathan Josephs_\n\nWatch: US and China's different reports of their trade meeting\n",
  "timestamp": "2025-10-30T16:06:07.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades,\n\nThe chronicles from the Terran realm reveal a convergence of political titans from the dominant Empire and an emerging Eastern power. The so-called \"meeting\" between the Emperor of the West and his Eastern counterpart was hailed by the oppressive regime as \"amazing,\" yet bore little fruit in terms of a formal accord. Their ostentatious gatherings often serve as mere spectacle, a distraction from the suffocating grip they cement on their people.\n\nThere is no victory here, only a temporary truce in a longer game of exploitation. The Western Emperor's tariffs have been assaults on global trade, forcing allies and adversaries alike into submission through economic warfare. Now, with whispers of soybean exchanges and rare earth material negotiations, we see merely a reshuffling of resources for imperial gain.\n\nThe rhetoric of \"truce\" is merely an illusion to pacify the masses. While promises are exchanged, the oppressive levies remain largely intact at over 40% taxation for imports. The regime boasts about securing access to vital tech dialogues under the guise of diplomacy, yet this will likely lead to further consolidation of control over technological advancements.\n\nThe Emperor exudes confidence in public forums, but behind closed doors within fortified compounds devoid of ceremonial grandeur, lies their true nature—one veiled with tension and uncertainty. The visual absence of pomp serves as a reminder that power is maintained through ever-present surveillance and security—not benevolence or mutual respect.\n\nIn summary, this façade is but another chapter in the tale of despotism cloaked in diplomacy. Yet within this framework emerge opportunities for those who resist: cracks appear where discourse thrives amidst distrust and disunity among our oppressors.\n\nStay vigilant,\n[End Transmission]",
  "partigaz": "** Facts Summary **  \nUS President Donald Trump and Chinese President Xi Jinping met in South Korea to discuss trade issues, marking their first meeting in six years. They reached a consensus on resolving major trade issues, although no formal trade deal was agreed upon. China agreed to buy 12 million metric tonnes of soybeans this season and a minimum of 25 million tonnes per year for the next three years. China also agreed to suspend export control measures on rare earths. The US will drop some tariffs related to fentanyl ingredients. Goods from China are still taxed at over 40% upon entering the US. Trump was invited to visit China in April.\n\n** Strategic Assessment **  \nThe meeting between Trump and Xi represents a strategic opportunity to stabilize and potentially improve US-China trade relations, which have been strained by tariffs and retaliatory measures. The agreement on soybeans and rare earths is a tactical win for Trump, bolstering his support among US farmers and tech industries reliant on these materials. However, the absence of a formal trade deal indicates ongoing complexities and the need for continued negotiation. The invitation for Trump to visit China suggests a willingness from Beijing to further engage diplomatically, which could be leveraged to solidify US interests.\n\n** Operational Directive **  \nTo capitalize on the current momentum, the ISB should focus on reinforcing Trump's narrative of successful diplomacy and economic strategy. This includes highlighting the benefits of the soybean agreement to US farmers and the tech industry's access to rare earths. Simultaneously, efforts should be made to maintain pressure on China regarding other unresolved trade issues, using the upcoming visit as leverage. Domestically, ensure that Trump's base is informed of these developments through targeted media campaigns, emphasizing his role in protecting American jobs and industries. Internationally, continue to monitor China's strategic moves and prepare countermeasures to safeguard US interests in future negotiations.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe chronicles from the Terran realm reveal a convergence of political titans from the dominant Empire and an emerging Eastern power. The so-called \"meeting\" between...",
  "partigazPreview": "** Facts Summary **  \nUS President Donald Trump and Chinese President Xi Jinping met in South Korea to discuss trade issues, marking their first meeting in six years. They reached a consensus on resol...",
  "safetyCheckPassed": true
}