{
  "id": 10,
  "title": "Latest US boat strike kills four in the Pacific, Hegseth says ",
  "link": "https://www.bbc.com/news/articles/cp3xq9wx5zyo?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-10-30T00:47:50.000Z",
  "description": "The suspected drug traffickers were killed in an escalating conflict taking place at sea.",
  "originalGuid": "https://www.bbc.com/news/articles/cp3xq9wx5zyo#1",
  "facts": {
    "headline": "Four killed in latest US boat strike in the Pacific",
    "who": [
      "Pete Hegseth",
      "President Trump",
      "US Department of War"
    ],
    "what": "A US attack on a boat suspected of transporting illegal drugs has left four men dead in the eastern Pacific Ocean.",
    "where": [
      "eastern Pacific Ocean"
    ],
    "when": "2025-10-30T00:17:24.244Z",
    "numbers": [
      {
        "value": 4,
        "unit": "people",
        "context": "killed in the latest strike"
      },
      {
        "value": 14,
        "unit": "people",
        "context": "killed in previous strikes on Monday"
      },
      {
        "value": 60,
        "unit": "people",
        "context": "killed in strikes over the past two months"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: Four killed in latest US boat strike in the Pacific\n\nURL Source: https://www.bbc.com/news/articles/cp3xq9wx5zyo?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-10-30T00:17:24.244Z\n\nMarkdown Content:\nFour killed in latest US boat strike in the Pacific \n\n===============\n\n[Skip to content](https://www.bbc.com/news/articles/cp3xq9wx5zyo?at_medium=RSS&at_campaign=rss#main-content)\n\n[Watch Live](https://www.bbc.com/watch-live-news/)\n\n[](https://www.bbc.com/)\n\nSubscribe\n\n[Sign In](https://session.bbc.com/session?userOrigin=BBCS_BBC&ptrt=https%3A%2F%2Fwww.bbc.com%2Fnews%2Farticles%2Fcp3xq9wx5zyo%3Fat_medium%3DRSS%26at_campaign%3Drss)\n\n*   [Home](https://www.bbc.com/) \n*   [News](https://www.bbc.com/news) \n*   [Sport](https://www.bbc.com/sport) \n*   [Business](https://www.bbc.com/business) \n*   [Innovation](https://www.bbc.com/innovation) \n*   [Culture](https://www.bbc.com/culture) \n*   [Arts](https://www.bbc.com/arts) \n*   [Travel](https://www.bbc.com/travel) \n*   [Earth](https://www.bbc.com/future-planet) \n*   [Audio](https://www.bbc.com/audio) \n*   [Video](https://www.bbc.com/video) \n*   [Live](https://www.bbc.com/live) \n*   [Documentaries](https://www.bbc.com/video/docs) \n\n[Home](https://www.bbc.com/)\n\nNews\n\n[Sport](https://www.bbc.com/sport)\n\nBusiness\n\nInnovation\n\nCulture\n\nArts\n\nTravel\n\nEarth\n\nAudio\n\nVideo\n\nLive\n\nDocumentaries\n\n[Weather](https://www.bbc.com/weather)\n\n[Newsletters](https://www.bbc.com/newsletters)\n\n[Watch Live](https://www.bbc.com/watch-live-news/)\n\nLatest US boat strike kills four in the Pacific, Hegseth says\n=============================================================\n\n16 hours ago\n\nShare\n\nSave\n\nMax Matza\n\nShare\n\nSave\n\n![Image 1: Pete Hegseth X account A still from a surveillance video showing a boat in the ocean with smoke and fire coming off of it. It says unclassified in neon green all-capped letters.](https://ichef.bbci.co.uk/news/480/cpsprodpb/dd28/live/2eb09ff0-b525-11f0-ba75-093eca1ac29b.png.webp)Pete Hegseth X account\n\nA US attack on a boat suspected of transporting illegal drugs has left four men dead in the eastern Pacific Ocean, US defence secretary Pete Hegseth announced on X on Wednesday.\n\n\"Earlier today, at the direction of President Trump, the Department of War carried out a lethal kinetic strike on yet another narco-trafficking vessel,\" Hegseth posted.\n\nOn Monday, US strikes on suspected drug-trafficking ships in the Pacific killed 14 people, according to Hegseth.\n\nThe latest strikes, which have come at the direction of the president, mark an escalation in what the White House has cast as a campaign to stop seaborne narcotics from entering the US via both the Pacific and Caribbean.\n\nHegseth's post included a video showing a vessel catching fire after being struck by US munitions.\n\n\"The Western Hemisphere is no longer a safe haven for narco-terrorists bringing drugs to our shores to poison Americans,\" he wrote. \"The Department of War will continue to hunt them down and eliminate them wherever they operate.\"\n\nHe added that the attack took place in international waters, and that no US personnel were harmed.\n\nWatch: What we know about US strikes targeting alleged drug boats\n\nAt least 60 people have been killed in the strikes over the past two months, which has led to increasing tensions between the US and the governments of both Colombia and Venezuela.\n\nThe strikes have drawn condemnation in the region and experts have questioned their legality. Members of the US Congress, both Democrats and Republicans, have also raised concerns and questioned the president's authority to order them.\n\nThe US has been steadily building up a force of warships, fighter jets, Marines, spy planes, bombers and drones in the Caribbean, deploying the world's largest warship, the USS Gerald R Ford.\n\nTrump has accused Venezuelan President Nicolas Maduro of being the leader of a drug-trafficking organisation, which he denies, and there are fears in Venezuela that the US military build-up is aimed at removing the long-time opponent of Trump from power.\n\nThe country's attorney general told the BBC there is \"no doubt\" that Trump is trying to overthrow the Venezuelan government. He accused the US of hoping to seize the country's natural resources, including reserves of gold, oil and copper.\n\nThe US is among many nations that do not recognise Maduro as Venezuela's legitimate leader, after the last election in 2024 was widely dismissed as neither free nor fair. Opposition tallies from polling stations showed its candidate had won by a landslide.\n\n![Image 2](https://static.files.bbci.co.uk/bbcdotcom/web/20251021-134202-667692b2c6-web-2.32.2-1/grey-placeholder.png)![Image 3: BBC News Graphic shows drug trafficking routes in the Pacific and Caribbean](https://ichef.bbci.co.uk/news/480/cpsprodpb/bb93/live/64d21680-b526-11f0-aa13-0b0479f6f42a.png.webp)BBC News\n\n[Venezuela's Maduro says US 'fabricating war' as it deploys world's largest warship ----------------------------------------------------------------------------------](https://www.bbc.com/news/articles/c891gzx7xn4o)\n\n[US imposes sanctions on left-wing Colombian President Petro -----------------------------------------------------------](https://www.bbc.com/news/articles/crkl2dm2glxo)\n\n[What's at stake as Trump boat strikes strain US-Colombia alliance -----------------------------------------------------------------](https://www.bbc.com/news/articles/c709w5v9dq9o)\n\n[Donald Trump](https://www.bbc.com/news/topics/cp7r8vgl2lgt)\n\n[United States](https://www.bbc.com/news/topics/cx1m7zg01xyt)\n\n* * *\n\nRelated\n\n[Trump's surgeon general pick goes into labour before confirmation hearing -------------------------------------------------------------------------](https://www.bbc.com/news/articles/c3rjv93vj2do)\n\n[Trump hails 'amazing' meeting with China's Xi but no formal trade deal agreed -----------------------------------------------------------------------------](https://www.bbc.com/news/articles/crl25xl1gjpo)\n\n[Five ways US government shutdown is hurting - and why it's about to get worse -----------------------------------------------------------------------------](https://www.bbc.com/news/articles/c74jden8ddxo)\n\n* * *\n\nMore from the BBC\n\n[7 mins ago ![Image 4](https://static.files.bbci.co.uk/bbcdotcom/web/20251021-134202-667692b2c6-web-2.32.2-1/grey-placeholder.png)![Image 5: Abigail Zwerner in beige leather jacket in court](https://ichef.bbci.co.uk/news/480/cpsprodpb/f67f/live/ac07e5d0-b5a7-11f0-8d0f-29cad3ef1e0e.jpg.webp) ‘I thought I was dying’ - teacher shot by 6-year-old student testifies against school administrator --------------------------------------------------------------------------------------------------- In January 2023, school teacher Abigail Zwerner was shot by her six-year-old student. She spoke about the incident for the first time publicly on Thursday. 7 mins ago](https://www.bbc.com/news/articles/c2drnjkz849o)\n\n[3 hrs ago ![Image 6](https://static.files.bbci.co.uk/bbcdotcom/web/20251021-134202-667692b2c6-web-2.32.2-1/grey-placeholder.png)![Image 7: US President Donald Trump signs an executive order in the Oval Office at the White House in Washington, DC on 23 April 2025. A red baseball hat embroidered with \"Make America Great Again\" in white thread sits to the left of the document, which shows Trump's distinctive signature](https://ichef.bbci.co.uk/news/480/cpsprodpb/07b8/live/1c01acb0-62e5-11f0-964a-ff2f7d0da737.jpg.webp) What tariffs has Trump announced and why? ----------------------------------------- Trump's volatile trade policy has thrown the world economy into chaos, and put some US prices up. 3 hrs ago](https://www.bbc.com/news/articles/cn93e12rypgo)\n\n[4 hrs ago ![Image 8](https://static.files.bbci.co.uk/bbcdotcom/web/20251021-134202-667692b2c6-web-2.32.2-1/grey-placeholder.png)![Image 9: Doug Ford in suit turns his head to the side](https://ichef.bbci.co.uk/news/480/cpsprodpb/4f08/live/62b1ba00-b593-11f0-a6fc-b50bf0239b95.jpg.webp) Ontario premier demands apology from US ambassador over tariff 'tirade' ----------------------------------------------------------------------- The tense exchange happened after an anti-tariff commercial aired by Ontario infuriated the Trump administration. 4 hrs ago](https://www.bbc.com/news/articles/c30v68ngje7o)\n\n[5 hrs ago ![Image 10](https://static.files.bbci.co.uk/bbcdotcom/web/20251021-134202-667692b2c6-web-2.32.2-1/grey-placeholder.png)![Image 11: A US nuclear missile, seen inside a silo](https://ichef.bbci.co.uk/news/480/cpsprodpb/f89f/live/41acb900-b538-11f0-8e27-6729950a59f0.jpg.webp) Trump directs nuclear weapons testing to resume for first time in over 30 years ------------------------------------------------------------------------------- It is necessary for the US to keep pace with weapons programmes in China and Russia, the president says. 5 hrs ago](https://www.bbc.com/news/articles/c4gzq2p0yk4o)\n\n[5 hrs ago ![Image 12](https://static.files.bbci.co.uk/bbcdotcom/web/20251021-134202-667692b2c6-web-2.32.2-1/grey-placeholder.png)![Image 13: Donald Trump and his team sit across a negotiating table from Xi Jinping and his team](https://ichef.bbci.co.uk/news/480/cpsprodpb/2ff4/live/d184f880-b5a1-11f0-b2a1-6f537f66f9aa.jpg.webp) Xi and Trump find temporary truce as China plays longer game ------------------------------------------------------------ Talks have helped to steady a rocky relationship between the world's top two economies - but the rivalry persists. 5 hrs ago](https://www.bbc.com/news/articles/c8eyx718pz2o)\n\n* * *\n\n[](https://www.bbc.com/)\n\n*   [Home](https://www.bbc.com/) \n*   [News](https://www.bbc.com/news) \n*   [Sport](https://www.bbc.com/sport) \n*   [Business](https://www.bbc.com/business) \n*   [Innovation](https://www.bbc.com/innovation) \n*   [Culture](https://www.bbc.com/culture) \n*   [Arts](https://www.bbc.com/arts) \n*   [Travel](https://www.bbc.com/travel) \n*   [Earth](https://www.bbc.com/future-planet) \n*   [Audio](https://www.bbc.com/audio) \n*   [Video](https://www.bbc.com/video) \n*   [Live](https://www.bbc.com/live) \n*   [Documentaries](https://www.bbc.com/video/docs) \n*   [Weather](https://www.bbc.com/weather) \n*   [BBC Shop](https://shop.bbc.com/) \n*   [BritBox](https://www.britbox.com/?utm_source=bbc.com&utm_medium=referral&utm_campaign=footer) \n\nBBC in other languages\n\nFollow BBC on:\n\n*   [Terms of Use](https://www.bbc.com/pages/terms-of-use) \n*   [Subscription Terms](https://www.bbc.com/pages/subscription-terms) \n*   [About the BBC](https://www.bbc.co.uk/aboutthebbc) \n*   [Privacy Policy](https://www.bbc.com/pages/privacy-policy) \n*   [Cookies](https://www.bbc.com/usingthebbc/cookies/) \n*   [Accessibility Help](https://www.bbc.co.uk/accessibility/) \n*   [Contact the BBC](https://www.bbc.co.uk/contact) \n*   [Advertise with us](https://advertising.bbcstudios.com/) \n*   [Do not share or sell my info](https://www.bbc.com/usingthebbc/cookies/how-can-i-change-my-bbc-cookie-settings/) \n*   [BBC.com Help & FAQs](https://help.bbc.com/hc/) \n*   [Content Index](https://www.bbc.com/pages/content-index) \n\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.[**Read about our approach to external linking.**](https://www.bbc.co.uk/editorialguidelines/guidance/feeds-and-links)\n",
  "timestamp": "2025-10-30T00:47:50.000Z",
  "nemik": "**Rebel Transmission**\n\nFellow citizens of the galaxy,\n\nThe recent report of violence executed under President Trump's directive in the Pacific is yet another manifestation of unchecked imperial aggression. Four lives have been extinguished, adding to a gruesome tally that serves as a reminder of the state's relentless pursuit of control and domination. The strikes on suspected drug-trafficking vessels are cloaked in the narrative of safeguarding borders from seaborne threats, but beneath this facade lies an insidious strategy to extend their reach and suppression.\n\nThe actions by the current administration have led to the loss of at least 60 lives over two months and escalated tensions with neighboring regions. This unilateral exercise of power has invoked criticism not just internationally, but also domestically within their own political arena, questioning both legal grounds and moral standing. Meanwhile, military presence burgeons with warships and fighter jets marshaled off coasts far beyond their own. This militarization is less about protection and more about intimidation—a cruel show of force intended to bend smaller nations to its will.\n\nThis presidency's fixation on Venezuelan leadership—the same stubborn denial of recognizing democratically dismissed leaders—is a clear indication of intent: a regime change cloaked in moralizing rhetoric about narcotics when larger ambitions loom over resources like gold, oil, and copper. This is imperialism reborn under the guise of justice.\n\nWe must remain vigilant against these transgressions that mirror historic patterns—an empire expands not for peace but for power. We stand firm against these actions, calling upon allies who cherish freedom to resist tyranny by any means necessary. Let us not be silenced or swayed by propaganda that seeks acquiescence but rather join together in solidarity against oppression.\n\nThe struggle continues.\n\nEnd transmission.",
  "partigaz": "**Facts Summary**\n\nA U.S. military strike, directed by President Trump and announced by U.S. Defense Secretary Pete Hegseth, targeted a boat suspected of drug trafficking in the eastern Pacific Ocean, resulting in the deaths of four men. This operation is part of an ongoing campaign to prevent narcotics from entering the U.S., with 60 people killed in similar strikes over the past two months. The strikes have heightened tensions with Colombia and Venezuela, with accusations from Venezuela that the U.S. aims to overthrow its government and seize resources. The legality of these actions has been questioned by regional governments and U.S. Congress members.\n\n**Strategic Assessment**\n\nThe ISB recognizes the strategic importance of maintaining control over drug trafficking routes to ensure national security and uphold the administration's law-and-order agenda. The strikes serve as a demonstration of U.S. military capability and resolve, deterring potential threats and reinforcing the administration's stance against narco-terrorism. However, the operations risk escalating diplomatic tensions and could lead to international scrutiny and domestic political challenges. It is crucial to manage these risks while maintaining operational effectiveness.\n\n**Operational Directive**\n\nTo support President Trump and suppress resistance, the ISB will enhance intelligence operations to identify and target key drug trafficking networks with precision, minimizing collateral damage and legal challenges. Diplomatic channels will be leveraged to mitigate international backlash, emphasizing the necessity of these actions for regional stability. Domestically, a strategic communication campaign will be launched to highlight the successes of these operations in protecting American citizens, thereby bolstering public support and countering opposition narratives.",
  "nemikPreview": "**Rebel Transmission**\n\nFellow citizens of the galaxy,\n\nThe recent report of violence executed under President Trump's directive in the Pacific is yet another manifestation of unchecked imperial aggre...",
  "partigazPreview": "**Facts Summary**\n\nA U.S. military strike, directed by President Trump and announced by U.S. Defense Secretary Pete Hegseth, targeted a boat suspected of drug trafficking in the eastern Pacific Ocean,...",
  "safetyCheckPassed": true
}