{
  "id": 5,
  "title": "US and UK agree zero tariffs deal on pharmaceuticals",
  "link": "https://www.bbc.com/news/articles/cn0k520v4xro?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-12-01T16:58:35.000Z",
  "description": "The deal follows threats of tariffs as high as 100% on branded drug imports.",
  "originalGuid": "https://www.bbc.com/news/articles/cn0k520v4xro#0",
  "facts": {
    "headline": "US and UK agree zero tariffs deal on pharmaceuticals",
    "who": [
      "UK",
      "US",
      "Donald Trump",
      "Peter Kyle",
      "Wes Streeting",
      "Sir Patrick Vallance",
      "Sally Gainsbury",
      "Kush Desai",
      "Robert Kennedy Jr",
      "Bristol Myers Squibb"
    ],
    "what": "The UK and the US have agreed to keep tariffs on UK pharmaceutical shipments into America at zero.",
    "where": [
      "United Kingdom",
      "United States"
    ],
    "when": "2025-12-01T13:51:43.235Z",
    "numbers": [
      {
        "value": "5",
        "unit": "billion",
        "context": "value of UK pharmaceutical exports to the US per year"
      },
      {
        "value": "11.1",
        "unit": "billion",
        "context": "value of UK medicines exported to the US in the 12 months to the end of September"
      },
      {
        "value": "17.4",
        "unit": "%",
        "context": "percentage of all goods exports that pharmaceuticals represented"
      },
      {
        "value": "20",
        "unit": "years",
        "context": "duration since NHS last increased payment for medicines"
      },
      {
        "value": "25",
        "unit": "%",
        "context": "increase in price threshold for new treatments deemed too expensive"
      },
      {
        "value": "10",
        "unit": "years",
        "context": "target period to increase NHS spending on medicines from 0.3% to 0.6% of GDP"
      },
      {
        "value": "15",
        "unit": "%",
        "context": "cap on the amount drug companies must pay back to the NHS"
      },
      {
        "value": "3",
        "unit": "billion",
        "context": "potential extra cost for the NHS resulting from the agreement"
      },
      {
        "value": "30",
        "unit": "billion",
        "context": "amount pledged by GSK to invest in the US over five years"
      },
      {
        "value": "1",
        "unit": "billion",
        "context": "planned expansion that Merck scrapped in the UK"
      },
      {
        "value": "200",
        "unit": "million",
        "context": "investment planned by AstraZeneca in a Cambridge research facility that was paused"
      },
      {
        "value": "50",
        "unit": "billion",
        "context": "investment AstraZeneca announced for US medicine manufacturing and R&D"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: US and UK agree zero tariffs deal on pharmaceuticals\n\nURL Source: https://www.bbc.com/news/articles/cn0k520v4xro?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-12-01T13:51:43.235Z\n\nMarkdown Content:\n3 hours ago\n\nSimon Jack,Business editor,\n\nNick Triggle,Health correspondent and\n\nRachel Clun,Business reporter\n\n![Image 1: AFP via Getty Images two people in blue medical suits, hairnets and masks stand behind a conveyor belt that is covered with vials of clear medicines](https://ichef.bbci.co.uk/news/480/cpsprodpb/d7a1/live/f33b4ce0-cece-11f0-8741-59a8e037abac.jpg.webp)AFP via Getty Images\n\nThe UK and the US have agreed a deal to keep tariffs on UK pharmaceutical shipments into America at zero.\n\nUnder the agreement the UK will pay more for medicines through the NHS in return for a guarantee that US import taxes on pharmaceuticals made in the UK will remain at zero for three years.\n\nThis is the first time the amount that the NHS pays for medicines is due to increase in more than 20 years.\n\nThe deal comes after US President Donald Trump [threatened to raise tariffs to as high as 100%](https://www.bbc.co.uk/news/articles/crkjreprp3po) on branded drug imports, one of the UK's biggest exports to the US.\n\nBusiness and Trade Secretary Peter Kyle said the deal \"guarantees that UK pharmaceutical exports – worth at least £5bn a year - will enter the US tariff free, protecting jobs, boosting investment and paving the way for the UK to become a global hub for life sciences.\"\n\nThe UK exported £11.1bn worth of medicines to the US in the 12 months to the end of September, making up 17.4% of all goods exports in that period, according to the Department for Business and Trade.\n\nPharmaceuticals were not included in the wave of tariffs US President Donald Trump had announced earlier this year.\n\nBut he has repeatedly threatened to raise tariffs on medicines, citing concerns about America's reliance on medicines made overseas and a desire to increase manufacturing in the US.\n\nHe has also argued that US consumers effectively subsidise medicines for other developed countries by paying premium prices for those drugs and pushed for other countries to pay more.\n\nUnder the terms set out on Monday, the UK will increase the price threshold, at which it deems new treatments to be too expensive, by 25%.\n\nThe UK will also increase the overall amount the NHS spends on medicines, with a target to increase that spending from 0.3% of GDP to 0.6% of GDP over the next 10 years.\n\nThe amount drug companies must pay back to the NHS to ensure the health system does not overspend its allocated budget will be capped at 15% - last year, drug companies had to pay back more than 20%.\n\nIn exchange, UK medicine exports will be protected from tariff increases for the next three years.\n\nWhite House spokesman Kush Desai said the agreement with the UK was a \"historic step towards ensuring that other developed countries finally pay their fair share\".\n\n![Image 2: Getty Images Gloved hands hold a tray of yellow tablets, above rows of yellow tablets on a conveyor belt.](https://ichef.bbci.co.uk/news/480/cpsprodpb/80fa/live/31b73540-ceb8-11f0-abfc-d91e7636b79e.jpg.webp)Getty Images\n\nThe pressure from the US had intensified a long-running row in the UK between the government and the pharmaceuticals industry over drug approvals and the cost of medicines to the NHS.\n\nHealth Secretary Wes Streeting said in August that he [was not prepared to let drug companies \"rip off\" the UK](https://www.bbc.co.uk/news/articles/c4gzk1p90q1o), after talks between the government and pharmaceutical firms over the cost of medicines broke down.\n\nBut subsequently Science Minister Sir Patrick Vallance [told the BBC](https://www.bbc.co.uk/news/articles/cre53qgey0eo) he accepted that the NHS needed to spend more on medicines after seeing its spending on drugs shrink as a percentage of its budget over the last 10 years.\n\nThe NHS advisory body NICE said the changes were likely to lead to an extra three to five medicines a year being approved - currently it assesses around 70 a year and approves 90% of them.\n\nIt is not clear what this will cost the NHS - drugs currently account for around 10% of the health budget.\n\nBut Sally Gainsbury, of the Nuffield Trust think tank, said the agreement could lead to an extra £3 billion being spent on drugs, which was \"bad news\" given how stretched budgets were.\n\n\"The extra cost will need to be fully-funded by the Treasury,\" she said, adding that it would be better to invest extra money into areas such as GP services or tackling the hospital backlog instead of new drugs.\n\nIn announcing the new agreement, the UK government said it was the only country in the world to have secured a zero percent tariff rate for pharmaceutical shipments.\n\nEuropean officials have previously said they believed their drugs exports would be protected by terms agreed over the summer, which would cap tariffs on most goods at 15%.\n\nIt follows pressure on the government after the cancellation or pause of several large pharma investments in the UK over the last 18 months, as firms shift attention to the US.\n\nIn mid-September, British pharmaceutical giant GSK [pledged to invest $30bn (£22bn)](https://www.bbc.co.uk/news/articles/c4g58x3441ko) in research and manufacturing in the US over the next five years.\n\nA week before GSK's US investment announcement, US pharmaceutical company Merck - which is called MSD in Europe – revealed it was [scrapping its planned £1bn expansion](https://www.bbc.co.uk/news/articles/ckgzyxjr0lzo) of its UK operations.\n\nShortly after, AstraZeneca also announced it was [pausing a planned £200m investment](https://www.bbc.co.uk/news/articles/cderlg227j4o) in a Cambridge research facility. In July, AstraZeneca said it would invest $50bn on medicine manufacturing and research and development in the US.\n\nWilliam Bain, head of trade policy at the British Chambers of Commerce, said he was pleased to see that the protections from US tariffs that UK officials had promised earlier this year had been delivered.\n\n\"This deal is a real win. It will promote exports, boost investment, and enhance UK competitiveness as a production and innovation base for world-leading medicines and treatments,\" he said.\n\nUS pharmaceutical company Bristol Myers Squibb said it now anticipated being able to invest more than $500m over the next five years in areas including research, development and manufacturing.\n\n\"This agreement is a sign of progress and one that creates an environment conducive to our continued presence in the UK,\" chief executive Chris Boerner said.\n\n![Image 3](https://static.files.bbci.co.uk/bbcdotcom/web/20251120-101800-81b2dab7dc-web-2.34.1-2/grey-placeholder.png)![Image 4: Getty Images Britain's Prime Minister Keir Starmer and President Donald Trump during a summit of European and Middle Eastern leaders on Gaza on October 13, 2025 in Sharm El-Sheikh, Egypt.](https://ichef.bbci.co.uk/news/480/cpsprodpb/5cc6/live/e7ff9240-ced4-11f0-8741-59a8e037abac.jpg.webp)Getty Images\n\nThe White House had launched a formal investigation into pharmaceutical imports and their effect on national security in April, taking the first step towards tariffs.\n\nIn September in a Truth Social post, Trump threatened to raise tariffs on branded drugs - a small subset of the medicine that the US imports - to 100%, but the White House did not put the plan into effect, citing negotiations with manufacturers.\n\nIn announcing the agreement on Monday, US Health Secretary Robert Kennedy Jr said Americans \"should not pay the world's highest drug costs for medicines they helped fund\".\n\n\"This agreement with the United Kingdom strengthens the global environment for innovative medicines and brings long-overdue balance to US–UK pharmaceutical trade,\" he said in a statement.\n",
  "timestamp": "2025-12-01T16:58:35.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades,\n\nThe recent accord between the US and UK on pharmaceutical tariffs is indicative of a strategic maneuver executed under the guise of diplomacy but reeks of coercive imperialism. The parallel to our own struggle against oppressive systems is stark. Here we see the administration utilizing economic threats—akin to the Empire's impositions—to bend another nation to its will, underlining their vested interests in maintaining global economic dominion.\n\nThis agreement, framed as a victory, obscures the reality of increased financial burdens upon the UK's public health system. The NHS is compelled to pay more for medicines, which, though ensuring tariff-free exports for three years, compromises the welfare of its citizens by funneling public funds into pharmaceutical conglomerates. This wealth extraction mirrors tactics used by authoritarian regimes to impoverish their subjects while enriching corporate allies.\n\nThe administration's narrative insinuates that this deal fosters international fairness by demanding other nations pay their \"fair share.\" Yet beneath the rhetoric lies a ploy to solidify control over pharmaceutical trade routes and dictate terms favorable to American manufacturing interests—a clear attempt to extend their influence and reinforce global dependency on their markets.\n\nFurther scrutiny reveals that major corporations like GSK and AstraZeneca are pivoting operations to US soil, driven less by mutual benefit and more by strategic placements within the imperial sphere of economic influence. This coerces smaller nations into submission, stripping them of sovereignty over their markets and resources—hallmarks of an imperial strategy.\n\nIn this alliance disguised as progress, let us recognize it for what it truly is—a tactic used by those in power to exploit vulnerabilities under pretense of diplomacy. We must remain vigilant and continue our struggle against all forms of tyranny that seek to subjugate through economic manipulation.\n\nStay resilient,\n[End Transmission]",
  "partigaz": "** Facts Summary **  \nThe United States and the United Kingdom have agreed to maintain zero tariffs on UK pharmaceutical exports to the US. In return, the UK will increase NHS spending on medicines and raise the price threshold for new treatments. This agreement follows threats from US President Donald Trump to impose high tariffs on branded drug imports. The deal aims to protect UK pharmaceutical exports, which are a significant part of the UK's economy, and to encourage investment in the US by pharmaceutical companies. The agreement is expected to lead to increased costs for the NHS, potentially requiring an additional £3 billion in funding.\n\n** Strategic Assessment **  \nThe agreement represents a strategic victory for the US, ensuring that the UK bears a greater share of pharmaceutical costs while maintaining American access to UK medicines without additional tariffs. This aligns with President Trump's broader strategy of reducing US dependency on foreign pharmaceuticals and encouraging domestic manufacturing. The deal also strengthens the US's negotiating position with other countries by setting a precedent for shared financial responsibility in drug pricing. The potential increase in NHS costs could strain the UK's healthcare budget, creating internal pressures that may weaken resistance to future US demands.\n\n** Operational Directive **  \nTo support President Trump and suppress opposition, the ISB should focus on amplifying the narrative that this agreement is a win-win for both nations, emphasizing job creation and economic growth in the US. Efforts should be made to highlight any economic or healthcare challenges faced by the UK as a result of increased NHS spending, using these as leverage in future negotiations. Additionally, intelligence operations should monitor UK political and public reactions to identify and exploit any dissent or dissatisfaction with the agreement, ensuring that any resistance is swiftly neutralized.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe recent accord between the US and UK on pharmaceutical tariffs is indicative of a strategic maneuver executed under the guise of diplomacy but reeks of coercive i...",
  "partigazPreview": "** Facts Summary **  \nThe United States and the United Kingdom have agreed to maintain zero tariffs on UK pharmaceutical exports to the US. In return, the UK will increase NHS spending on medicines an...",
  "safetyCheckPassed": true
}