{
  "id": 13,
  "title": "National Guard shooting suspect spent weeks isolated in bedroom, case worker's email said",
  "link": "https://www.bbc.com/news/articles/cj01q55lm76o?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-12-01T20:09:53.000Z",
  "description": "Emails from a case worker involved in 2024 with Rahmanullah Lakanwal suggested he suffered with mental health issues.",
  "originalGuid": "https://www.bbc.com/news/articles/cj01q55lm76o#1",
  "facts": {
    "headline": "National Guard shooting suspect spent weeks isolated, email said",
    "who": [
      "Rahmanullah Lakanwal",
      "Sarah Beckstrom",
      "Andrew Wolfe",
      "Kristi Noem",
      "Donald Trump",
      "Patrick Morrisey",
      "Joseph Edlow"
    ],
    "what": "Rahmanullah Lakanwal is accused of shooting two National Guard members in Washington DC.",
    "where": [
      "Washington, DC",
      "Bellingham, Washington",
      "Afghanistan"
    ],
    "when": "2025-12-01",
    "numbers": [
      {
        "value": 2,
        "unit": "people",
        "context": "number of National Guard members shot"
      },
      {
        "value": 20,
        "unit": "years",
        "context": "age of Sarah Beckstrom"
      },
      {
        "value": 24,
        "unit": "years",
        "context": "age of Andrew Wolfe"
      },
      {
        "value": 29,
        "unit": "years",
        "context": "age of Rahmanullah Lakanwal"
      },
      {
        "value": 5,
        "unit": "children",
        "context": "number of children of Rahmanullah Lakanwal"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: National Guard shooting suspect spent weeks isolated, email said\n\nURL Source: https://www.bbc.com/news/articles/cj01q55lm76o?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-12-01T11:57:28.961Z\n\nMarkdown Content:\nNational Guard shooting suspect spent weeks isolated in bedroom, case worker's email said\n-----------------------------------------------------------------------------------------\n\n22 hours ago\n\nBrandon Livesay\n\n![Image 1: EPA Yellow police tape surrounds four National Guardsmen who are standing close to the scene where two West Virginia National Guard members were shot in Washington, DC, USA](https://ichef.bbci.co.uk/news/480/cpsprodpb/1b5a/live/703c4230-ce9d-11f0-a892-01d657345866.jpg.webp)EPA\n\nThe man accused of shooting two National Guard members in Washington DC last week spent weeks at a time alone in a dark room and suffered \"manic episodes\" - according to comments written in 2024 by a case worker who helped the suspect's family with their relocation after they fled Afghanistan.\n\nRahmanullah Lakanwal is accused of carrying out an \"ambush\" that killed Sarah Beckstrom, 20, and seriously injured Andrew Wolfe, 24.\n\nOfficials said the 29-year-old entered the US in 2021 as part of a programme for Afghans who had worked with American troops in Afghanistan.\n\nAccording to the emails from last year that were obtained by BBC's US partner, CBS News, Mr Lakanwal struggled with his mental health.\n\nIn an interview on Sunday with NBC, Homeland Security Secretary Kristi Noem said that Mr Lakanwal had been \"radicalised since he's been here in this country\" and that officials believed this happened \"through connections in his home community and state\".\n\nMr Lakanwal, an Afghan national, entered the US as part of the Biden-era Operation Allies Welcome programme.\n\nThis was during the period after the chaotic US troop withdrawal from Afghanistan. As the Taliban took back control of the country, there were fears of retribution against individuals, such as Mr Lakanwal, who had co-operated with the US.\n\nHe applied for asylum in 2024, and his application was granted earlier this year, an official told CBS.\n\nHe lived with his wife and five children in Bellingham, Washington - a state on the other side of the country from where last week's attack took place.\n\nA motive is not yet known, but a picture of Mr Lakanwal's life in the US has started to emerge through the emails that were sent last year to non-profit group US Committee for Refugees and Immigrants.\n\n![Image 2: Reuters A picture of Rahmanullah Lakanwal, an Afghan national who is the suspect in the shooting of two National Guard members, as displayed at a press conference with FBI Director Kash Patel, attorney Jeanine Pirro and other authorities](https://ichef.bbci.co.uk/news/480/cpsprodpb/3795/live/aa93dcd0-cea8-11f0-a892-01d657345866.jpg.webp)Reuters\n\nRahmanullah Lakanwal\n\nThe case worker who was helping the family access services in the US sent an email on 11 January 2024, expressing concern that Mr Lakanwal had not been employed for a year and his family faced eviction.\n\n\"World Relief volunteers are trying to patch things for that family - but I think the father has mental health issues that are not addressed, and he won't talk to anyone,\" a section of the email obtained by CBS reads. World Relief is a group that helped with the relocation of Afghan nationals.\n\nIn a separate email sent on 31 January 2024, the case worker said Mr Lakanwal \"spends most of his time for weeks on end in his darkened bedroom, not speaking to anyone, not even his wife and older kids\".\n\nThe case worker, who was not a mental health professional, also said Mr Lakanwal had \"manic episodes for one or two weeks at a time where he will take off in the family car\". They also said he had periods in which he would try to \"make amends\".\n\nWatch: How the shooting of two National Guard members unfolded\n\nLast week, a childhood friend told the New York Times that Mr Lakanwal had experienced mental health issues after his work with his unit in Afghanistan.\n\nMr Lakanwal had been a member of a \"Zero Unit\" - an Afghan intelligence and paramilitary force that worked with the CIA - a former Afghan defence and security forces member told CBS.\n\nThe CIA director John Ratcliffe has also confirmed Mr Lakanwal worked alongside the US intelligence agency.\n\nIn the days after the attack in Washington DC, President Donald Trump pledged to \"permanently pause migration\" from all \"third world countries\".\n\nThe president's administration has halted all asylum decisions \"until we can ensure that every alien is vetted and screened to the maximum degree possible\", the US Citizenship and Immigration Services (USCIS) director Joseph Edlow said.\n\nOn Sunday, Trump told reporters that he expected the situation to last \"for a long time\".\n\nMr Lakanwal, who was shot during the incident and remains in hospital, faces murder charges.\n\nMr Wolfe, one of the National Guard members who was shot, remains in hospital in \"serious condition\", West Virginia Governor Patrick Morrisey said on Monday.\n\nThe governor also noted \"some positive news\" - that Mr Wolfe responded to a nurse when asked to give a thumbs up if he could hear.\n\n\"He did respond, and we were told that he also wiggled his toes. We take that as a positive sign. But I'm not here to speculate,\" Morrisey said.\n",
  "timestamp": "2025-12-01T20:09:53.000Z",
  "nemik": "**Rebel Transmission**\n\nFellow Sentinels of Liberty,\n\nThe latest developments from the heart of our occupied land reveal the depths of control and fear perpetuated by the ruling regime. The recent article depicting a tragic incident in Washington DC, involving an Afghan national, Rahmanullah Lakanwal, accused of attacking two National Guard members, lays bare the systemic failings and oppressive tactics of those in power.\n\nThis incident, devoid of context by our oppressors, is manipulated to fuel xenophobic sentiment and tighten the hold on migrant communities. It highlights how the self-proclaimed protectors manipulate fear as a tool to justify their draconian measures. The suspect's mental health struggles, documented by caseworkers since his resettlement under the Operation Allies Welcome programme, reflect a catastrophic neglect that transcends borders—a plight exacerbated by isolation and trauma incurred from service alongside empire forces.\n\nOur so-called leaders use this tragedy to expand their reach over our lives. President Trump's swift move to \"permanently pause migration\" from what he derogatorily terms \"third world countries,\" is an act masked as security but driven by prejudice and control. This rhetoric further alienates those who seek asylum and sanctuary—souls fleeing conflict ignited by imperial machinations themselves.\n\nRemember, these actions serve to suppress dissent and maintain control over us through division. The narrative pushed forth seeks not to heal but to divide; to use the grievances of one man as justification for widespread censure against many.\n\nWe recognize this ploy for what it is: an extension of their tyrannical grip disguised in the cloak of security. Let it stir within us a resolve stronger than ever to stand united against oppression in all its forms.\n\nStay vigilant. Stay united.\n\nEnd Transmission.",
  "partigaz": "** Facts Summary **  \nRahmanullah Lakanwal, a 29-year-old Afghan national, is accused of ambushing and shooting two National Guard members in Washington, DC, killing Sarah Beckstrom, 20, and seriously injuring Andrew Wolfe, 24. Lakanwal entered the US in 2021 under the Operation Allies Welcome programme after working with American troops in Afghanistan. He struggled with mental health issues and was reportedly radicalized in the US. Following the incident, President Donald Trump announced a halt on migration from \"third world countries\" and paused all asylum decisions. Lakanwal, who was shot during the incident, faces murder charges and remains hospitalized.\n\n** Strategic Assessment **  \nThe incident involving Rahmanullah Lakanwal underscores vulnerabilities in the current immigration and asylum processes, particularly concerning individuals with potential radicalization risks. The ISB must assess the effectiveness of existing vetting procedures and identify gaps that allowed an individual with known mental health issues and radicalization potential to enter and remain in the country. This situation presents an opportunity to reinforce the narrative of national security threats posed by insufficiently vetted migrants, thereby justifying stricter immigration controls and bolstering support for President Trump's policies.\n\n** Operational Directive **  \n1. Intensify surveillance and intelligence-gathering efforts on communities with high concentrations of recent immigrants to identify potential radicalization activities.\n2. Collaborate with Homeland Security to review and enhance vetting procedures for asylum seekers and immigrants, focusing on mental health assessments and connections to radical networks.\n3. Launch a public information campaign highlighting the dangers of inadequate immigration controls, using the Lakanwal case as a focal point to rally public support for President Trump's migration policies.\n4. Coordinate with law enforcement agencies to ensure heightened security measures around key government and military installations to prevent similar incidents.\n5. Monitor media narratives and counter any attempts by opposition groups to exploit the situation to criticize the administration's policies.",
  "nemikPreview": "**Rebel Transmission**\n\nFellow Sentinels of Liberty,\n\nThe latest developments from the heart of our occupied land reveal the depths of control and fear perpetuated by the ruling regime. The recent art...",
  "partigazPreview": "** Facts Summary **  \nRahmanullah Lakanwal, a 29-year-old Afghan national, is accused of ambushing and shooting two National Guard members in Washington, DC, killing Sarah Beckstrom, 20, and seriously...",
  "safetyCheckPassed": true
}