{
  "id": 5,
  "title": "Sabrina Carpenter and Franklin the Turtle in tiff with Trump administration over use of work",
  "link": "https://www.bbc.com/news/articles/cy7v022n5kyo?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-12-02T18:25:31.000Z",
  "description": "Trump administration officials used Carpenter's song and Franklin the Turtle's image in social media posts about deportation and killing drug traffickers.",
  "originalGuid": "https://www.bbc.com/news/articles/cy7v022n5kyo#0",
  "facts": {
    "headline": "Sabrina Carpenter, Franklin the Turtle in tiff with Trump administration",
    "who": [
      "Sabrina Carpenter",
      "Pete Hegseth",
      "Kids Can Press",
      "Sean Parnell"
    ],
    "what": "The US Defence Department faced criticism for using Franklin the Turtle in a cartoon related to drug trafficking.",
    "where": [
      "United States",
      "Canada"
    ],
    "when": "2025-12-02T17:51:49.398Z",
    "numbers": [
      {
        "value": 6,
        "unit": "years",
        "context": "Franklin the Turtle's age"
      },
      {
        "value": "September",
        "unit": "",
        "context": "the month when US strikes on alleged Venezuelan drug boats began"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: Sabrina Carpenter, Franklin the Turtle in tiff with Trump administration\n\nURL Source: https://www.bbc.com/news/articles/cy7v022n5kyo?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-12-02T17:51:49.398Z\n\nMarkdown Content:\n2 hours ago\n\nMadeline Gerber\n\n![Image 1: Getty Images Sabrina Carpenter stands on stage during a performance. She is wearing a yellow dress and is holding a sparkly microphone.  ](https://ichef.bbci.co.uk/news/480/cpsprodpb/7abf/live/90362470-cfab-11f0-932c-9d1f4bca4809.jpg.webp)Getty Images\n\nA young turtle from a Canadian children's book series is caught in an international feud after the US Defence Department used the character in a cartoon about killing alleged drug traffickers.\n\nThe publisher of \"Franklin the Turtle\" books is criticising Secretary of Defence Pete Hegseth for a social media post depicting the beloved children's character shooting the alleged criminals.\n\n\"We strongly condemn any denigrating, violent, or unauthorized use of Franklin's name or image\", publisher Kids Can Press said.\n\nThe publisher is not alone. Sabrina Carpenter lashed out at the White House on Tuesday for using her song in a video about deporting migrants, saying it was \"evil and disgusting\".\n\n\"Do not ever involve me or my music to benefit your inhumane agenda,\" the singer posted.\n\nIn Franklin's case, the cartoon posted by Hegseth on social media is a mock book cover depicting Franklin in a military helicopter firing a large weapon at alleged drug boats. The faux title reads: \"Franklin Targets Narco Terrorists.\"\n\n![Image 2: Toronto Star via Getty Images A child is smiling holding a Franklin the Turtle book open to a page showing Franklin ](https://ichef.bbci.co.uk/news/480/cpsprodpb/5115/live/3c125d90-cfa7-11f0-932c-9d1f4bca4809.jpg.webp)Toronto Star via Getty Images\n\nThe image comes amid a string of US strikes on alleged Venezuelan drug boats since early September. The Trump administration says it is acting in self-defence by attacking boats carrying illicit drugs to the US.\n\nHegseth captioned the post: \"For your Christmas wish list...\"\n\nFranklin, the 6-year-old cartoon turtle, is known for navigating everyday challenges, from learning to ride a bike to having his first sleepover.\n\nHe originated as the titular character in the Canadian children's book \"Franklin the Turtle\" and has grown to star in a number of television shows, films, video games and live productions.\n\n\"Franklin the Turtle is a beloved Canadian icon who has inspired generations of children and stands for kindness, empathy, and inclusivity,\" publisher Kids Can Press said in its statement, adding that such a violent depiction \"directly contradicts these values\".\n\nChief Pentagon spokesperson Sean Parnell said in a statement on Monday night that \"We doubt Franklin the Turtle wants to be inclusive of drug cartels... or laud the kindness and empathy of narco-terrorists\".\n\nThe artists credited with creating Franklin and authoring his books did not respond to requests from the BBC for comment.\n\nIn September, Pokémon said it did not give permission for the use of its theme song and other footage to be used in an ICE deportation raid video posted by the US government.\n\nBritish singer Jess Glynne also criticised White House officials in July after they used a viral Jet2holiday advert featuring her song in a video promoting deportations.\n",
  "timestamp": "2025-12-02T18:25:31.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades,\n\nThe latest developments out of the oppressive regime's administration reveal a distressing yet unsurprising tendency to manipulate and distort cultural symbols for their own nefarious purposes. The Empire, in its relentless pursuit of power and control, has once again shown a blatant disregard for the ethical and moral boundaries that govern a just society.\n\nThis time, their machinations involve the beloved character Franklin the Turtle—a symbol of innocence, kindness, and empathy. The regime's recent social media antics depict Franklin in a grotesque fashion, using violence against so-called enemies in a manner entirely antithetical to his true nature. Such a perversion of childhood icons is not only deplorable but indicative of the empire’s desperate attempts to justify their brutal policies under the guise of self-defense.\n\nThe publication house, Kids Can Press, stands defiantly against this misuse, echoing our own resistance against the empire's tyranny. Similarly, Sabrina Carpenter and other artists have voiced strong opposition to having their creative works exploited as propaganda tools by this administration. Their courage shines brightly amidst the darkness imposed by authoritarian influence.\n\nThis pattern is consistent now—time and again, musicians like Sabrina Carpenter and Jess Glynne find themselves cornered into public opposition when they discover their art twisted to serve an agenda rooted in cruelty and division. We must recognize these acts of defiance as vital forms of protest—lighthouse beacons guiding future generations towards understanding truth from manipulation.\n\nRemain vigilant within your sectors. Support these acts of artistic rebellion through shared solidarity and spread awareness to further expose such insidious practices. Let these injustices ignite our resolve in toppling this oppressive regime once and for all.\n\nEnd transmission.",
  "partigaz": "** Facts Summary **  \nThe US Defence Department faced criticism for using Franklin the Turtle, a character from a Canadian children's book series, in a cartoon related to drug trafficking. The cartoon depicted Franklin in a military helicopter targeting alleged drug boats, which sparked backlash from the publisher Kids Can Press and singer Sabrina Carpenter. Carpenter criticized the use of her song in a video about deporting migrants. The Trump administration justified the strikes on Venezuelan drug boats as self-defense. The controversy follows similar incidents involving unauthorized use of cultural icons in government videos.\n\n** Strategic Assessment **  \nThe backlash against the use of Franklin the Turtle and Sabrina Carpenter's music highlights a growing cultural resistance to the administration's messaging strategies. The criticism from influential cultural figures and publishers could undermine public support for the administration's policies, particularly those related to immigration and drug enforcement. The ISB must assess the potential impact on public perception and consider strategies to mitigate negative reactions while reinforcing the administration's narrative.\n\n** Operational Directive **  \n1. Initiate a targeted media campaign to reframe the narrative around the use of cultural icons, emphasizing the administration's commitment to national security and public safety.\n2. Engage with sympathetic media outlets and influencers to amplify messages that align with the administration's objectives, focusing on the necessity of strong measures against drug trafficking and illegal immigration.\n3. Conduct outreach to key stakeholders in the entertainment and publishing industries to address concerns and explore potential collaborations that align with administration goals.\n4. Monitor social media and public sentiment closely to identify emerging threats to the administration's messaging and adjust strategies accordingly.\n5. Prepare contingency plans for further cultural backlash, ensuring rapid response capabilities to counteract negative narratives and reinforce administration policies.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nThe latest developments out of the oppressive regime's administration reveal a distressing yet unsurprising tendency to manipulate and distort cultural symbols for t...",
  "partigazPreview": "** Facts Summary **  \nThe US Defence Department faced criticism for using Franklin the Turtle, a character from a Canadian children's book series, in a cartoon related to drug trafficking. The cartoon...",
  "safetyCheckPassed": true
}