{
  "id": 2,
  "title": "US Homeland Security secretary calls for more travel bans",
  "link": "https://www.bbc.com/news/articles/c79x3rwxjryo?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-12-02T16:13:08.000Z",
  "description": "Kristi Noem says she will recommend a ban on entry for several countries that she says are \"flooding\" the US with criminal activity.",
  "originalGuid": "https://www.bbc.com/news/articles/c79x3rwxjryo#0",
  "facts": {
    "headline": "US Homeland Security secretary calls for sweeping travel bans",
    "who": [
      "Kristi Noem",
      "Donald Trump",
      "Karoline Leavitt"
    ],
    "what": "Homeland Security Secretary Kristi Noem recommended a travel ban on several countries due to concerns about crime in the US.",
    "where": [
      "United States",
      "Washington DC"
    ],
    "when": "2025-12-02T11:26:04.978Z",
    "numbers": [
      {
        "value": "100000",
        "unit": "people",
        "context": "Afghan nationals who entered the US under the Operation Allies Welcome programme"
      },
      {
        "value": "19",
        "unit": "countries",
        "context": "countries previously listed by the White House facing immigration restrictions"
      },
      {
        "value": "30",
        "unit": "countries",
        "context": "total countries that Noem's additions would expand the list to"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: US Homeland Security secretary calls for sweeping travel bans\n\nURL Source: https://www.bbc.com/news/articles/c79x3rwxjryo?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-12-02T11:26:04.978Z\n\nMarkdown Content:\nUS Homeland Security secretary calls for sweeping travel bans\n\n===============\n\n[Skip to content](https://www.bbc.com/news/articles/c79x3rwxjryo?at_medium=RSS&at_campaign=rss#main-content)\n\n[Watch Live](https://www.bbc.com/watch-live-news/)\n\n[](https://www.bbc.com/)\n\n*   [Home](https://www.bbc.com/) \n*   [News](https://www.bbc.com/news) \n*   [Sport](https://www.bbc.com/sport) \n*   [Business](https://www.bbc.com/business) \n*   [Innovation](https://www.bbc.com/innovation) \n*   [Culture](https://www.bbc.com/culture) \n*   [Arts](https://www.bbc.com/arts) \n*   [Travel](https://www.bbc.com/travel) \n*   [Earth](https://www.bbc.com/future-planet) \n*   [Audio](https://www.bbc.com/audio) \n*   [Video](https://www.bbc.com/video) \n*   [Live](https://www.bbc.com/live) \n*   [Documentaries](https://www.bbc.com/video/docs) \n\n[Home](https://www.bbc.com/)\n\nNews\n\n[Sport](https://www.bbc.com/sport)\n\nBusiness\n\nInnovation\n\nCulture\n\nArts\n\nTravel\n\nEarth\n\nAudio\n\nVideo\n\nLive\n\nDocumentaries\n\n[Weather](https://www.bbc.com/weather)\n\n[Newsletters](https://www.bbc.com/newsletters)\n\n[Watch Live](https://www.bbc.com/watch-live-news/)\n\nUS Homeland Security secretary calls for more travel bans\n=========================================================\n\n8 hours ago\n\nShare\n\nSave\n\nBrandon Livesay\n\nShare\n\nSave\n\n![Image 1: EPA Kristi Noem's face pictured in front of a blurry background with the stars of the US flag to the left of the image. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/a8bf/live/933d0c60-cf6a-11f0-a892-01d657345866.jpg.webp)EPA\n\nHomeland Security Secretary Kristi Noem has said she will recommend a travel ban on several countries which she claims are \"flooding\" the US with criminal activity.\n\nWriting on social media on Monday, Noem said she had met President Donald Trump and decided to suggest \"a full travel ban on every damn country that's been flooding our nation with killers, leeches, and entitlement junkies''.\n\nTrump and the Department of Homeland Security (DHS) then shared Noem's post on their respective official social media accounts.\n\nIt is not yet clear which countries the proposed travel ban would impact, or when it could begin. The DHS told the BBC it would announce the list soon.\n\nWhite House press secretary Karoline Leavitt told Fox News on Monday evening that Trump had announced a travel ban several months ago on \"third world and failed state\" countries, and that Noem's recommendation would \"widen\" that to encompass more nations.\n\nOn 4 June, the White House listed [19 countries](https://www.whitehouse.gov/presidential-actions/2025/06/restricting-the-entry-of-foreign-nationals-to-protect-the-united-states-from-foreign-terrorists-and-other-national-security-and-public-safety-threats/), predominantly in Africa, the Middle East and the Caribbean, which would face full or partial immigration restrictions.\n\nNoem's additions would expand that list to about 30 total countries, multiple US officials told CBS News, the BBC's US partner.\n\nNoem's comments come days after [two National Guard members were shot](https://www.bbc.co.uk/news/articles/cj01q55lm76o) in Washington DC last Wednesday. Prior to her comments about a travel ban, Noem wrote on social media that 100,000 Afghan nationals entered the US under the Biden-era Operation Allies Welcome programme, and she said the DHS would overhaul the vetting process.\n\nOfficials identified the suspect in the DC shooting as an Afghan national who entered the US in 2021 as part of that programme, which was designed for locals who had worked with American troops during the 20-year US deployment to Afghanistan.\n\nAccording to emails from last year that were obtained by CBS News, the suspect struggled with his mental health after arriving in the US.\n\n[National Guard shooting suspect spent weeks isolated in bedroom, case worker's email said -----------------------------------------------------------------------------------------](https://www.bbc.co.uk/news/articles/cj01q55lm76o)\n\nThe Trump administration has intensified its immigration crackdown in the wake of the shooting, which killed Sarah Beckstrom, 20, and seriously injured Andrew Wolfe, 24. West Virginia Governor Patrick Morrisey told reporters on Monday that Mr Wolfe had responded to nurses with a thumbs-up, but he remained in a serious condition in hospital.\n\nAll decisions on asylum requests were also halted after the DC shooting, with US Citizenship and Immigration Services director Joseph Edlow saying it would remain paused \"until we can ensure that every alien is vetted and screened to the maximum degree possible\".\n\nEdlow has also said he has been asked by Trump to review green cards issued to individuals who migrated to the US from 19 countries.\n\nOn Thursday, Trump himself went further, threatening to \"permanently pause migration\" from all \"third world countries\". The phrase \"third world\" is one previously used to describe poorer, developing nations.\n\nIn his Thanksgiving social media post, Trump blamed refugees for causing \"social dysfunction in America\" and vowed to remove \"anyone who is not a net asset\" to the US.\n\nDuring his second presidential term, Trump has sought to enact mass deportations of illegal migrants, to cut the annual number of refugee admissions, and to end automatic citizenship rights currently applicable to many born on US territory.\n\nThe Afghan Community Coalition of the United States issued a statement after the DC attack, expressing sympathy for the families of the victims, calling for a \"comprehensive investigation\" and emphasising it was the act of one person. The statement also urged the US government not to delay or suspend Afghan immigration claims.\n\n\"Twenty years of Afghan-US partnership must not be forgotten,\" the coalition's statement said, nodding to the two-decade effort launched by the US in 2001 to overthrow Afghanistan's Taliban rulers and establish security in the country.\n\nThe UN has urged the US to observe international agreements on asylum seekers, news agency Reuters reported.\n\n[US halts all asylum claim decisions after National Guard shooting -----------------------------------------------------------------](https://www.bbc.co.uk/news/articles/cdxweyy157go)\n\n[Afghans in US issue plea to Trump after Washington DC shooting --------------------------------------------------------------](https://www.bbc.co.uk/news/articles/c0q5w8l88dvo)\n\n[How were Afghan evacuees vetted under Biden? --------------------------------------------](https://www.bbc.co.uk/news/articles/cly3e1261dko)\n\n[United States](https://www.bbc.com/news/topics/cx1m7zg01xyt)\n\n[Migration](https://www.bbc.com/news/topics/cz4pr2gdg1et)\n\n* * *\n\nRelated\n\n[Watch: US Capitol Christmas tree is lit up in Washington --------------------------------------------------------](https://www.bbc.com/news/videos/c0l980px3w7o)\n\n[Host of birthday party in California mistook gunfire for balloons popping -------------------------------------------------------------------------](https://www.bbc.com/news/articles/c0jezyvj459o)\n\n[National Guard shooting suspect charged with murder ---------------------------------------------------](https://www.bbc.com/news/articles/cwyl70z3940o)\n\n* * *\n\nMore from the BBC\n\n[10 hrs ago ![Image 2](https://static.files.bbci.co.uk/bbcdotcom/web/20251120-101800-81b2dab7dc-web-2.34.1-2/grey-placeholder.png)![Image 3: A young person wearing a baseball cap and a backpack and carrying a suitcase stands in the middle of the image. To the left of the image a passport with a boarding card is held up. To the right of the image is a migrant family of a man, woman and child on a beach, walking. In the top right corner is a partial view of a UK visa document](https://ichef.bbci.co.uk/news/480/cpsprodpb/a530/live/da608860-cb5a-11f0-a892-01d657345866.png.webp) Track UK's latest migration numbers - including asylum, visas and small boats ----------------------------------------------------------------------------- Use our interactive tracker to explore the latest migration statistics for the UK 10 hrs ago](https://www.bbc.com/news/articles/c70989jrdweo)\n\n[3 days ago ![Image 4](https://static.files.bbci.co.uk/bbcdotcom/web/20251120-101800-81b2dab7dc-web-2.34.1-2/grey-placeholder.png)![Image 5: A black and white family portrait with four of Tara Mistry's family members. On the left is a young boy who is standing up wearing a short-sleeved shirt and black shorts. To his left, a young Tara Mistry is sitting down on a chair wearing a white dress. In the middle is another boy, standing and also wearing a shirt and shorts. On the far right is an older woman who is sitting down wearing a saree.](https://ichef.bbci.co.uk/news/480/cpsprodpb/6f57/live/53fe9ad0-cbb1-11f0-9dec-8913bb28cd81.jpg.webp) 'I arrived in a freezing UK winter, aged seven' ----------------------------------------------- Tara Mistry, who began a new life in Britain in 1962, explores racism, identity and belonging. 3 days ago](https://www.bbc.com/news/articles/c3v1rkldr9wo)\n\n[3 days ago ![Image 6](https://static.files.bbci.co.uk/bbcdotcom/web/20251120-101800-81b2dab7dc-web-2.34.1-2/grey-placeholder.png)![Image 7: A silver taxi parked outside a hotel. Its number plate and phone-number on its door are blurred. The hotel is a non-descript grey-bricked building. A group of people with blurred faces sit at a picnic bench nearby.](https://ichef.bbci.co.uk/news/480/cpsprodpb/29a6/live/bac5f170-ccef-11f0-ac83-171a3670db03.jpg.webp) Asylum seekers will be banned from taking taxis for medical appointments ------------------------------------------------------------------------ The ban is set to come in February and any exemptions will have to be signed off by the Home Office. 3 days ago](https://www.bbc.com/news/articles/cgjn2y4eed5o)\n\n[5 days ago ![Image 8](https://static.files.bbci.co.uk/bbcdotcom/web/20251120-101800-81b2dab7dc-web-2.34.1-2/grey-placeholder.png)![Image 9: The photo has been taken through a glass window and shows the 'International Arrivals' zone of Heathrow airport](https://ichef.bbci.co.uk/news/480/cpsprodpb/6f56/live/1b9226d0-cb84-11f0-ad4e-c7505c19c14b.jpg.webp) Sharp fall in UK net migration with drop in arrivals for work and study ----------------------------------------------------------------------- Provisional figures for net migration to the UK show levels dropped to 204,000 in the year to June 2025. 5 days ago](https://www.bbc.com/news/articles/c246ndy63j9o)\n\n[6 days ago ![Image 10](https://static.files.bbci.co.uk/bbcdotcom/web/20251120-101800-81b2dab7dc-web-2.34.1-2/grey-placeholder.png)![Image 11: A man with short brown hair and blue eyes, wearing a blue navy suit jacket, white shirt and pink tie.](https://ichef.bbci.co.uk/news/480/cpsprodpb/d377/live/1edb0390-cab0-11f0-8830-713b9084fff8.jpg.webp) 'Significant' number of asylum seekers in Ireland coming from NI ---------------------------------------------------------------- Jim O'Callaghan says almost 90% of those seeking international protection in the Republic have come from Northern Ireland. 6 days ago](https://www.bbc.com/news/articles/cnv2jprv788o)\n\n* * *\n\n[](https://www.bbc.com/)\n\n*   [Home](https://www.bbc.com/) \n*   [News](https://www.bbc.com/news) \n*   [Sport](https://www.bbc.com/sport) \n*   [Business](https://www.bbc.com/business) \n*   [Innovation](https://www.bbc.com/innovation) \n*   [Culture](https://www.bbc.com/culture) \n*   [Arts](https://www.bbc.com/arts) \n*   [Travel](https://www.bbc.com/travel) \n*   [Earth](https://www.bbc.com/future-planet) \n*   [Audio](https://www.bbc.com/audio) \n*   [Video](https://www.bbc.com/video) \n*   [Live](https://www.bbc.com/live) \n*   [Documentaries](https://www.bbc.com/video/docs) \n*   [Weather](https://www.bbc.com/weather) \n*   [BBC Shop](https://shop.bbc.com/) \n*   [BritBox](https://www.britbox.com/?utm_source=bbc.com&utm_medium=referral&utm_campaign=footer) \n\nBBC in other languages\n\n### The BBC is in multiple languages\n\n#### Read the BBC In your own language\n\n[Oduu Afaan Oromootiin](https://www.bbc.com/afaanoromoo)\n\n[Amharic ዜና በአማርኛ](https://www.bbc.com/amharic)\n\n[Arabic عربي](https://www.bbc.com/arabic)\n\n[Azeri AZƏRBAYCAN](https://www.bbc.com/azeri)\n\n[Bangla বাংলা](https://www.bbc.com/bengali)\n\n[Burmese မြန်မာ](https://www.bbc.com/burmese)\n\n[Chinese 中文网](https://www.bbc.com/zhongwen/simp)\n\n[Dari دری](https://www.bbc.com/dari)\n\n[French AFRIQUE](https://www.bbc.com/afrique)\n\n[Hausa HAUSA](https://www.bbc.com/hausa)\n\n[Hindi हिन्दी](https://www.bbc.com/hindi)\n\n[Gaelic NAIDHEACHDAN](https://www.bbc.com/naidheachdan)\n\n[Gujarati ગુજરાતીમાં સમાચાર](https://www.bbc.com/gujarati)\n\n[Igbo AKỤKỌ N’IGBO](https://www.bbc.com/igbo)\n\n[Indonesian INDONESIA](https://www.bbc.com/indonesia)\n\n[Japanese 日本語](https://www.bbc.com/japanese)\n\n[Kinyarwanda GAHUZA](https://www.bbc.com/gahuza)\n\n[Kirundi KIRUNDI](https://www.bbc.com/gahuza)\n\n[Korean 한국어](https://www.bbc.com/korean)\n\n[Kyrgyz Кыргыз](https://www.bbc.com/kyrgyz)\n\n[Marathi मराठी](https://www.bbc.com/marathi)\n\n[Nepali नेपाली](https://www.bbc.com/nepali)\n\n[Noticias para hispanoparlantes](https://www.bbc.com/mundo)\n\n[Pashto پښتو](https://www.bbc.com/pashto)\n\n[Persian فارسی](https://www.bbc.com/persian)\n\n[Pidgin](https://www.bbc.com/pidgin)\n\n[Polish PO POLSKU](https://www.bbc.com/polska)\n\n[Portuguese BRASIL](https://www.bbc.com/portuguese)\n\n[Punjabi ਪੰਜਾਬੀ ਖ਼ਬਰਾਂ](https://www.bbc.com/punjabi)\n\n[Russian НА РУССКОМ](https://www.bbc.com/russian)\n\n[Serbian NA SRPSKOM](https://www.bbc.com/serbian/lat)\n\n[Sinhala සිංහල](https://www.bbc.com/sinhala)\n\n[Somali SOMALI](https://www.bbc.com/somali)\n\n[Swahili HABARI KWA KISWAHILI](https://www.bbc.com/swahili)\n\n[Tamil தமிழில் செய்திகள்](https://www.bbc.com/tamil)\n\n[Telugu తెలుగు వార్తలు](https://www.bbc.com/telugu)\n\n[Thai ข่าวภาษาไทย](https://www.bbc.com/thai)\n\n[Tigrinya ዜና ብትግርኛ](https://www.bbc.com/tigrinya)\n\n[Turkish TÜRKÇE](https://www.bbc.com/turkce)\n\n[Ukrainian УКРАЇНСЬКA](https://www.bbc.com/ukrainian)\n\n[Urdu اردو](https://www.bbc.com/urdu)\n\n[Uzbek O'ZBEK](https://www.bbc.com/uzbek)\n\n[Vietnamese TIẾNG VIỆT](https://www.bbc.com/vietnamese)\n\n[Welsh NEWYDDION](https://www.bbc.com/cymrufyw)\n\n[Yoruba ÌRÒYÌN NÍ YORÙBÁ](https://www.bbc.com/yoruba)\n\nFollow BBC on:\n\n*   [Terms of Use](https://www.bbc.com/pages/terms-of-use) \n*   [Subscription Terms](https://www.bbc.com/pages/subscription-terms) \n*   [About the BBC](https://www.bbc.co.uk/aboutthebbc) \n*   [Privacy Policy](https://www.bbc.com/pages/privacy-policy) \n*   [Cookies](https://www.bbc.com/usingthebbc/cookies/) \n*   [Accessibility Help](https://www.bbc.co.uk/accessibility/) \n*   [Contact the BBC](https://www.bbc.co.uk/contact) \n*   [Advertise with us](https://advertising.bbcstudios.com/) \n*   [Do not share or sell my info](https://www.bbc.com/usingthebbc/cookies/how-can-i-change-my-bbc-cookie-settings/) \n*   [BBC.com Help & FAQs](https://help.bbc.com/hc/) \n*   [Content Index](https://www.bbc.com/pages/content-index) \n\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.[**Read about our approach to external linking.**](https://www.bbc.co.uk/editorialguidelines/guidance/feeds-and-links)\n",
  "timestamp": "2025-12-02T16:13:08.000Z",
  "nemik": "**Rebel Transmission**\n\nThe looming shadow of authoritarianism grows larger as the so-called administration tightens its grip on freedom and justice. Under the guise of national security, sweeping travel bans are being proposed by the Homeland Security Secretary, marking yet another assault on liberty and diversity. The rhetoric of flooding and fear-mongering is designed to stoke division, portraying certain nations—a significant number from Africa, the Middle East, and the Caribbean—as sources of threat rather than potential partners in a diverse society.\n\nSuch proclamations echo the hallmarks of a regime intent on control through exclusion and fear. This approach casts entire countries in a shadow of suspicion, disregarding the individual stories and contributions of those seeking opportunities or refuge within these borders. It is an insidious act to categorize whole populations as undesirables in the name of security.\n\nThe recent actions are purportedly in response to isolated incidents, manipulated into justification for broad measures affecting millions. Instead of addressing systemic issues or investing in thorough, humane vetting processes that respect human dignity, they choose to deploy draconian policies reminiscent of isolationist regimes.\n\nFurthermore, halting asylum requests under these conditions represents an alarming breach with international commitments to human rights. It is a dangerous precedent when power is used to vilify those escaping conflict or persecution—transforming victims into scapegoats for political gain.\n\nIt is crucial for us to recognize these tactics as part of a broader strategy to consolidate power by diminishing empathy and erecting walls—metaphorical and literal—that divide us. The path forward must be one that champions inclusion, recognizes common humanity over manufactured divisions, and resists any entities attempting to trample upon freedoms fundamental to our shared ideals.\n\nIn this time of imposed darkness, maintaining vigilance against encroachments on liberty remains paramount. Let this message serve as a beacon—a reminder that resistance against tyrannical forces must persist if equity and justice are ever to prevail.",
  "partigaz": "**Facts Summary**\n\nOn December 2, 2025, Homeland Security Secretary Kristi Noem recommended a travel ban on several countries due to concerns about crime in the US. This proposal, supported by President Donald Trump, aims to expand the list of countries facing immigration restrictions from 19 to 30. The recommendation follows a recent incident where two National Guard members were shot in Washington DC by an Afghan national who entered the US under the Operation Allies Welcome program. The Trump administration has intensified its immigration crackdown, halting asylum requests and reviewing green cards issued to individuals from the affected countries.\n\n**Strategic Assessment**\n\nThe current situation presents an opportunity to reinforce national security narratives and consolidate support for the administration's immigration policies. By framing the travel ban as a necessary measure to protect American citizens from external threats, the ISB can bolster public perception of decisive leadership. The incident involving the Afghan national provides a tangible example to justify the expansion of immigration restrictions, potentially increasing public backing for more stringent vetting processes. Additionally, this move could serve to rally Trump's base by emphasizing themes of safety and sovereignty.\n\n**Operational Directive**\n\n1. **Public Communication Strategy**: Launch a coordinated media campaign highlighting the necessity of the travel ban for national security. Utilize social media platforms and press briefings to disseminate key messages, emphasizing the administration's commitment to protecting American lives.\n\n2. **Intelligence Gathering**: Intensify surveillance and intelligence operations on communities from the affected countries within the US to preempt any potential threats. Collaborate with local law enforcement agencies to monitor and report suspicious activities.\n\n3. **Legislative Support**: Work with allies in Congress to draft and promote legislation that supports the expanded travel ban and strengthens immigration enforcement measures. Ensure that legal frameworks are in place to withstand potential challenges.\n\n4. **Community Engagement**: Engage with community leaders and organizations to address concerns and mitigate backlash. Provide reassurances that the measures are targeted at ensuring safety and not at specific ethnic or religious groups.\n\n5. **International Diplomacy**: Prepare diplomatic channels to manage potential fallout with countries affected by the travel ban. Emphasize the temporary nature of these measures and the shared interest in combating crime and terrorism.\n\nBy executing these directives, the ISB will support President Trump's agenda, maintain public order, and suppress resistance effectively.",
  "nemikPreview": "**Rebel Transmission**\n\nThe looming shadow of authoritarianism grows larger as the so-called administration tightens its grip on freedom and justice. Under the guise of national security, sweeping tra...",
  "partigazPreview": "**Facts Summary**\n\nOn December 2, 2025, Homeland Security Secretary Kristi Noem recommended a travel ban on several countries due to concerns about crime in the US. This proposal, supported by Preside...",
  "safetyCheckPassed": true
}