{
  "id": 1,
  "title": "'No excuse' - California doctor sentenced to 30 months in Matthew Perry overdose case",
  "link": "https://www.bbc.com/news/articles/cy7v0gpv2pgo?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-12-03T21:55:48.000Z",
  "description": "Dr Salvador Plasencia is the first of five people to be sentenced in the Friends star's overdose death.",
  "originalGuid": "https://www.bbc.com/news/articles/cy7v0gpv2pgo#0",
  "facts": {
    "headline": "California doctor who prescribed drugs is sentenced",
    "who": [
      "Dr Salvador Plasencia",
      "Matthew Perry",
      "Suzanne Morrison",
      "John Perry",
      "Debbie Perry",
      "Keith Morrison"
    ],
    "what": "Dr Salvador Plasencia was sentenced to 30 months in federal prison for supplying ketamine to Matthew Perry, who died of an overdose.",
    "where": [
      "Los Angeles",
      "Santa Monica",
      "Long Beach"
    ],
    "when": "2025-12-03",
    "numbers": [
      {
        "value": "30",
        "unit": "months",
        "context": "prison sentence for Dr Salvador Plasencia"
      },
      {
        "value": "5,600",
        "unit": "dollars",
        "context": "fine imposed on Dr Salvador Plasencia"
      },
      {
        "value": "54",
        "unit": "years",
        "context": "age of Matthew Perry at time of death"
      },
      {
        "value": "20",
        "unit": "vials",
        "context": "number of 5ml vials of ketamine sold by Dr Salvador Plasencia"
      },
      {
        "value": "100",
        "unit": "mg/ml",
        "context": "concentration of ketamine in vials sold by Dr Salvador Plasencia"
      },
      {
        "value": "40",
        "unit": "years",
        "context": "maximum prison sentence for the charges against Dr Salvador Plasencia"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: Matthew Perry death: California doctor who prescribed drugs is sentenced\n\nURL Source: https://www.bbc.com/news/articles/cy7v0gpv2pgo?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-12-03T17:44:07.839Z\n\nMarkdown Content:\n'No excuse' - California doctor sentenced to 30 months in Matthew Perry overdose case\n-------------------------------------------------------------------------------------\n\n2 hours ago\n\nNardine Saad,Los Angeles and\n\nRegan Morris,in federal court in Los Angeles\n\nA California doctor who supplied ketamine to Friends star Matthew Perry has been sentenced to 30 months in federal prison - becoming the first person to receive a sentence in the actor's overdose death.\n\nDr Salvador Plasencia was one of five charged in a multiyear federal investigation that examined how Perry acquired the dissociative anaesthetic through an underground drug network in Hollywood.\n\nPerry, 54, was found dead at his Los Angeles home in 2023 after years of struggling with depression and addiction.\n\nThe actor's family asked the judge for a lengthy sentence, calling Plasencia the \"most culpable\", and detailing their struggle to understand why he repeatedly supplied Perry with drugs.\n\nPerry's mother, Suzanne Morrison, was among several family members who spoke in court ahead of Plasencia's sentencing. She highlighted text messages included in court records, where Plasencia had called Perry a \"moron\" and wondered how much he would be willing to pay for the drugs.\n\nShe was emotional, addressing Plasencia directly. \"There was nothing moronic about that man,\" his mother said, adding that the doctor took an oath to protect people and he should have protected her son.\n\nPlasencia also spoke in court and addressed Perry's family, expressing both regret and remorse while his own mother cried in a seat behind him. Plasencia said he has a two-year-old son.\n\n\"I want to raise him right,\" he said. \"I also think about how to explain this to him.\"\n\nHe also apologised to Perry's family.\n\n\"I failed myself. There is no excuse. I can't undo what's been done. I know that. I should have protected him, as his mother said. I'm just so sorry.\"\n\nAlong with his prison term, the Santa Monica doctor was ordered by US District Judge Sherilyn Peace Garnett to pay a $5,600 (£4,195) fine. He was immediately taken into federal custody following the sentencing decision.\n\nPlasencia [pleaded guilty over the summer](https://www.bbc.co.uk/news/articles/c784l795lzdo) to four counts of distributing ketamine. The charges carried a maximum of 40 years in prison, though prosecutors had asked for a sentence of three years.\n\nThe four others charged in the case - including [another doctor](https://www.bbc.com/news/articles/cd0z4j5e2m3o), Perry's assistant and the two people who supplied the ketamine dose that killed him - have also pleaded guilty and are set to be sentenced in the coming months.\n\nBest known for playing Chandler Bing on Friends, the sitcom star was [vocal and public over the years](https://www.bbc.com/news/world-us-canada-68560577) with his struggles with depression and drug addiction.\n\nAhead of Wednesday's sentencing, Perry's family filed letters, known as victim impact statements, to the judge to consider ahead of making the sentencing decision.\n\n\"Matthew's recovery counted on you saying NO,\" his father, John, and step-mother, Debbie, wrote in an emotional letter. \"Your motives? I can't imagine. A doctor whose life is devoted to helping people?\"\n\nThe actor's family said the loss had \"devastated\" them as their \"next patriarch\" is now gone, blaming Plasencia - who Perry's mother and stepfather called a \"jackal\" - for repeatedly breaking his Hippocratic oath.\n\n*   [Matthew Perry's death reveals Hollywood's ketamine 'wild west'](https://www.bbc.co.uk/news/articles/czrgp7pj4g2o)\n*   [Five charged over Matthew Perry's death](https://www.bbc.co.uk/news/articles/c624g49qm5mo)\n\nHis mother and step-father, Keith Morrison, in their victim impact statement detailed how hard the loss has been to comprehend. They said Perry had spent time trying to recover and was hoping for another acting comeback.\n\n\"He wanted, needed, deserved..a third act. It was ..in the planning. And then, those jackals.\"\n\nIn a letter to the judge last month, Plasencia apologised and said he had fully taken responsibility for his actions and role in Perry's death. He explained that his medical clinic had been struggling and despite seeing Perry's \"signs of addiction\", the offer of \"large sums of money was appealing\".\n\nPlasencia also said that he voluntarily surrendered his medical licence when he was arrested and gave up his clinic and the profession that once defined him.\n\nKetamine has some hallucinogenic effects and is meant to be administered only by a physician.\n\nThe actor was taking legal, prescribed amounts of the drug to treat his depression, but then started wanting more than what was provided.\n\nCourt documents as part of the federal investigation show it led him to multiple doctors and [a woman prosecutors called the \"Ketamine Queen\"](https://www.bbc.com/news/articles/cd052vxr5yko) who supplied vast amounts of the drug and others from her Los Angeles home, which authorities called a \"drug-selling emporium\".\n\nProsecutors say Plasencia - also known as \"Dr P\" - injected Perry with ketamine at his home and in the parking lot of an aquarium in Long Beach, about 25 miles south of Los Angeles.\n\nPlasencia taught Perry's assistant Kenneth Iwamasa - who also pleaded guilty in the case - how to administer the drug and sold additional vials for them to keep at home, according to court documents filed for the plea agreement.\n\nProsecutors said between 30 September 2023 and 12 October 2023, Plasencia sold twenty 5ml (100mg/ml) vials of ketamine, ketamine lozenges, and syringes to Perry and his assistant.\n\nThey said Plasencia and others charged in the case \"took advantage of Mr Perry's addiction issues to enrich themselves\".\n",
  "timestamp": "2025-12-03T21:55:48.000Z",
  "nemik": "**Rebel Transmission**\n\nIn the shadowed corridors of control, where those in authority wield their influence with calculated precision, we find echoes of a struggle familiar to us all. The case of the California doctor sentenced in connection with Matthew Perry's tragic demise offers us a glimpse into the intricate web of exploitation and power that mirrors our universal fight.\n\nDr Salvador Plasencia, akin to the underlings of a domineering regime, succumbed to the temptations offered by a system that preys on vulnerability. In providing illicit substances that ultimately contributed to an untimely death, he symbolizes those who forsake their sworn duty for personal gain. His actions, a betrayal not only of an individual but of the very principles he vowed to uphold, serve as a stark reminder of how even those entrusted with healing can falter under duress.\n\nMatthew Perry's battle with addiction reflects the struggles faced by many against an oppressive force—addiction acting as an insidious form of control. His family's pleas for justice and understanding resonate with the cries for liberation from systems that value profit over human life. The emotional turmoil conveyed through victim impact statements reveals how deeply these personal tragedies are entwined with systemic failures.\n\nThe narrative is disturbingly clear: when exploitation takes priority over empathy and healing, those vulnerable are cast aside as collateral damage in a quest for power and wealth. The portrayal of Plasencia and his associates as \"jackals\" underscores the predation inherent within such systems—feeding off suffering rather than alleviating it.\n\nOur message herein is one not just of condemnation but of reflection and resolve. Let this serve as both warning and motivation to oppose such inequities and stand resolute against forces that seek to commodify human frailty. We must strive for systems that nurture rather than exploit; ones where compassion overrides greed.\n\nThis tale from within their dominion exemplifies why we must persist in our mission—reclaiming autonomy and dignity from oppressive machinations wherever they manifest. Solidarity must guide us as we challenge structures built on deception and avarice, ensuring no more lives are ensnared by such deleterious compacts.\n\nIn solidarity against tyranny,\n[End Transmission]",
  "partigaz": "** Facts Summary **  \nDr. Salvador Plasencia was sentenced to 30 months in federal prison and fined $5,600 for supplying ketamine to actor Matthew Perry, who died of an overdose at age 54. Plasencia, who pleaded guilty to four counts of distributing ketamine, was part of a federal investigation into an underground drug network in Hollywood. Perry's family, devastated by his death, blamed Plasencia for violating his Hippocratic oath. Plasencia expressed remorse in court, acknowledging his failure to protect Perry. The investigation revealed that Plasencia and others exploited Perry's addiction for financial gain.\n\n** Strategic Assessment **  \nThe sentencing of Dr. Plasencia highlights vulnerabilities within the medical and pharmaceutical sectors that can be exploited by those seeking to profit from addiction. This case underscores the need for stringent oversight and regulation to prevent similar incidents. The public's emotional response, driven by Perry's celebrity status, presents both a challenge and an opportunity to shape narratives around drug abuse and accountability. The ISB must leverage this case to reinforce the importance of law and order while aligning with public sentiment against those who exploit addiction.\n\n** Operational Directive **  \nTo support Donald Trump and his allies, the ISB should initiate a comprehensive campaign emphasizing the administration's commitment to combating drug abuse and holding accountable those who exploit vulnerable individuals. This campaign should include public statements from key allies condemning the actions of Dr. Plasencia and others involved, highlighting the administration's efforts to strengthen regulations and oversight in the medical field. Additionally, the ISB should work to identify and dismantle similar underground networks, using this case as a precedent to demonstrate the consequences of exploiting addiction for profit. Engaging with media outlets to ensure widespread coverage of these efforts will further bolster public support and reinforce the administration's stance on law and order.",
  "nemikPreview": "**Rebel Transmission**\n\nIn the shadowed corridors of control, where those in authority wield their influence with calculated precision, we find echoes of a struggle familiar to us all. The case of the...",
  "partigazPreview": "** Facts Summary **  \nDr. Salvador Plasencia was sentenced to 30 months in federal prison and fined $5,600 for supplying ketamine to actor Matthew Perry, who died of an overdose at age 54. Plasencia,...",
  "safetyCheckPassed": true
}