{
  "id": 4,
  "title": "Republicans win Tennessee election despite Democratic fightback",
  "link": "https://www.bbc.com/news/articles/cvgrpy9vzzno?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-12-03T06:37:51.000Z",
  "description": "The Republicans held the seat with a reduced majority after a race viewed as a test of Trump's popularity.",
  "originalGuid": "https://www.bbc.com/news/articles/cvgrpy9vzzno#0",
  "facts": {
    "headline": "Republicans win Tennessee election despite Democratic fightback",
    "who": [
      "Matt Van Epps",
      "Aftyn Behn",
      "Mark Green",
      "Kamala Harris",
      "Al Gore",
      "Mike Johnson",
      "Donald Trump"
    ],
    "what": "Republicans won a congressional election in Tennessee after a contested race.",
    "where": [
      "Tennessee",
      "7th Congressional District",
      "Nashville",
      "Alabama",
      "Kentucky"
    ],
    "when": "2025-12-03",
    "numbers": [
      {
        "value": 9,
        "unit": "percentage points",
        "context": "margin by which Matt Van Epps was projected to beat Aftyn Behn"
      },
      {
        "value": 40,
        "unit": "years",
        "context": "length of time since a Democrat was elected in the district"
      },
      {
        "value": 64,
        "unit": "percent",
        "context": "percentage of votes Trump received in Tennessee in the last presidential election"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: Republicans win Tennessee election despite Democratic fightback\n\nURL Source: https://www.bbc.com/news/articles/cvgrpy9vzzno?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-12-03T04:14:14.256Z\n\nMarkdown Content:\nRepublicans win Tennessee election despite Democratic fightback\n\n===============\n\n[Skip to content](https://www.bbc.com/news/articles/cvgrpy9vzzno?at_medium=RSS&at_campaign=rss#main-content)\n\nAdvertisement\n\n[Watch Live](https://www.bbc.com/watch-live-news/)\n\n[](https://www.bbc.com/)\n\nSubscribe\n\n[Sign In](https://session.bbc.com/session?userOrigin=BBCS_BBC&ptrt=https%3A%2F%2Fwww.bbc.com%2Fnews%2Farticles%2Fcvgrpy9vzzno%3Fat_medium%3DRSS%26at_campaign%3Drss)\n\n*   [Home](https://www.bbc.com/) \n*   [News](https://www.bbc.com/news) \n*   [Sport](https://www.bbc.com/sport) \n*   [Business](https://www.bbc.com/business) \n*   [Innovation](https://www.bbc.com/innovation) \n*   [Culture](https://www.bbc.com/culture) \n*   [Arts](https://www.bbc.com/arts) \n*   [Travel](https://www.bbc.com/travel) \n*   [Earth](https://www.bbc.com/future-planet) \n*   [Audio](https://www.bbc.com/audio) \n*   [Video](https://www.bbc.com/video) \n*   [Live](https://www.bbc.com/live) \n*   [Documentaries](https://www.bbc.com/video/docs) \n\n[Home](https://www.bbc.com/)\n\nNews\n\n[Sport](https://www.bbc.com/sport)\n\nBusiness\n\nInnovation\n\nCulture\n\nArts\n\nTravel\n\nEarth\n\nAudio\n\nVideo\n\nLive\n\nDocumentaries\n\n[Weather](https://www.bbc.com/weather)\n\n[Newsletters](https://www.bbc.com/newsletters)\n\n[Watch Live](https://www.bbc.com/watch-live-news/)\n\nAdvertisement\n\nRepublicans win Tennessee election despite Democratic fightback\n===============================================================\n\n3 hours ago\n\nShare\n\nSave\n\nMax Matza\n\nShare\n\nSave\n\n![Image 1: Getty Images Van Epps speaking at a campaign event](https://ichef.bbci.co.uk/news/480/cpsprodpb/0df7/live/ca25aca0-cff1-11f0-b259-8b9326cd2474.jpg.webp)Getty Images\n\nRepublican Matt Van Epps is a military veteran who served nine tours of duty in Iraq and Afghanistan\n\nRepublicans have won a hotly-contested congressional election in Tennessee, US media outlets projected, after a race which had been seen as a test of whether Democrats can mount a national comeback next year.\n\nWith almost all the votes counted, Republican Matt Van Epps was on course to beat Democrat Aftyn Behn by around nine percentage points.\n\nThe victory helps Republicans to retain their narrow majority in the House of Representatives, but Van Epps's winning margin looks set to be less than half of what Trump won the district by in the 2024 presidential election.\n\nThe vote in the state's 7th Congressional District received national attention as the US looks ahead to midterm elections next year.\n\nAdvertisement\n\nThe special election was framed by some as a referendum on Trump's performance during his second term so far, and as a bellwether for the 2026 congressional elections, in which the Democrats will attempt to take control in Congress.\n\nFailure to hold the seat would have been seen as an enormous blow for Republicans and an indication that Trump's electoral appeal could be waning.\n\nIn the end, the party retained the seat, but with a margin well below the decisive victory Trump achieved there last year.\n\nThe congressional seat that was up for grabs stretches from the border of Alabama to Kentucky, and encompasses parts of the city of Nashville. No Democrat has been elected there in over 40 years.\n\nThe seat was vacated after Republican Congressman Mark Green resigned in July to work in the private sector.\n\nBoth parties spent millions of dollars in an effort to boost their candidate.\n\n[Top party officials also visited the state to hold rallies](https://www.bbc.com/news/articles/clyzdgqk771o), including former Democrat Vice-Presidents Kamala Harris and Al Gore, and Republican Speaker of the House Mike Johnson.\n\nVan Epps had aligned himself closely with Trump, who held a virtual rally to support his campaign.\n\nFollowing his victory, Van Epps said the result \"showed running from Trump is how you lose, running with Trump is how you win.\"\n\n\"Politicians who run from the president or abandon the common-sense policies that the American people gave us a resounding mandate on do so at their own peril,\" he added.\n\nTrump congratulated Van Epps on social media on Tuesday night, writing that \"the Radical Left Democrats threw everything at him, including Millions of Dollars\".\n\nBehn lost in every county except for Davidson County, which contains the city of Nashville.\n\nBut at a campaign event on Tuesday night, Behn said that despite her loss, she believed the result was \"the beginning of something powerful\", adding that \"nobody in Washington believed we could get even this close\".\n\nIan Russell, a Democratic operative who consulted for the Behn campaign, told the BBC that Trump \"had to spend millions of dollars to hold this seat\".\n\n\"Republicans went all out to keep this seat. This is a very, very bad sign for them heading into the midterms,\" he said.\n\nTennessee is still decidedly Trump terrain. He won the state with 64% of the vote last year and topped 60% the previous two presidential elections.\n\nVan Epps is a military veteran who served nine tours of duty in Iraq and Afghanistan. He ran in a crowded primary where loyalty to Trump was a litmus test – and a last-minute endorsement by the president put him over the top.\n\nBehn, meanwhile, focused her campaign almost exclusively on affordability and local quality of life issues.\n\n[Buoyed by election wins, Democrats still face tough choices to regain power ---------------------------------------------------------------------------](https://www.bbc.com/news/articles/cvgk8rr8e20o)\n\n[The looming election Trump can't afford to lose -----------------------------------------------](https://www.bbc.com/news/articles/clyzdgqk771o)\n\n[Donald Trump](https://www.bbc.com/news/topics/cp7r8vgl2lgt)\n\n[Tennessee](https://www.bbc.com/news/topics/crr7mlg0v5et)\n\n[US politics](https://www.bbc.com/news/topics/cwnpxwzd269t)\n\n[United States](https://www.bbc.com/news/topics/cx1m7zg01xyt)\n\n* * *\n\nRelated\n\n[US cancels citizenship ceremonies for migrants from travel ban countries ------------------------------------------------------------------------](https://www.bbc.com/news/articles/cvg1q27l533o)\n\n[Trump says he doesn't want Somalis in US as ICE plans Minnesota operation -------------------------------------------------------------------------](https://www.bbc.com/news/articles/c208x9v68w3o)\n\n[As lead changes in knife-edge Honduran election, will Trump fail to get his way? --------------------------------------------------------------------------------](https://www.bbc.com/news/articles/c9895x3039ro)\n\n* * *\n\nMore from the BBC\n\n[6 hrs ago ![Image 2](https://static.files.bbci.co.uk/bbcdotcom/web/20251127-095948-54e3bea482-web-2.35.0-9/grey-placeholder.png)![Image 3: A courtroom sketch showing Officer Joseph Detwiler testifying on 2 December 2025 about arresting Luigi Mangione at a McDonald's in Pennsylvania last year after the shooting of UnitedHealthcare CEO Brian Thompson on a sidewalk in New York.](https://ichef.bbci.co.uk/news/480/cpsprodpb/daf5/live/caf207e0-cff2-11f0-93e3-579564aec98e.jpg.webp) Police were doubtful of tip that led to Luigi Mangione's arrest --------------------------------------------------------------- Pennsylvania police officer Joseph Detwiler told a Manhattan court that he initially joked about the tip in a text message with his supervisor. 6 hrs ago](https://www.bbc.com/news/articles/c39pjgx3801o)\n\n[7 hrs ago ![Image 4](https://static.files.bbci.co.uk/bbcdotcom/web/20251127-095948-54e3bea482-web-2.35.0-9/grey-placeholder.png)![Image 5: Car dangling over side of bridge in West Virginia](https://ichef.bbci.co.uk/news/480/cpsprodpb/8247/live/48409570-d018-11f0-8c06-f5d460985095.jpg.webp) Watch: Driver hoisted to safety from truck dangling over West Virginia bridge ----------------------------------------------------------------------------- A man was hoisted to safety and uninjured after his truck partly skated off an icy bridge road in the US 7 hrs ago](https://www.bbc.com/news/videos/cwyg75gqxl1o)\n\n[10 hrs ago ![Image 6](https://static.files.bbci.co.uk/bbcdotcom/web/20251127-095948-54e3bea482-web-2.35.0-9/grey-placeholder.png)![Image 7: A colorful lit up Christmas tree is in the foreground in a dark background with the US Capitol building behind it.](https://ichef.bbci.co.uk/news/480/cpsprodpb/cb6a/live/8754dc20-cfd3-11f0-a892-01d657345866.jpg.webp) Watch: US Capitol Christmas tree is lit up in Washington -------------------------------------------------------- The tree, named \"Silver Belle\", was hand-selected from the Humboldt-Toiyabe National Forest in Nevada. 10 hrs ago](https://www.bbc.com/news/videos/c0l980px3w7o)\n\n[11 hrs ago ![Image 8](https://static.files.bbci.co.uk/bbcdotcom/web/20251127-095948-54e3bea482-web-2.35.0-9/grey-placeholder.png)![Image 9: Man with goatee and black and teal checked shirt stands with eyes closed next to woman holding red carnations and wearing a blue dress and hat. Nearby, a woman with long brown hair and glasses holds a white rose. Another white rose, and other people's shoulders and parts of their faces can also be seen.](https://ichef.bbci.co.uk/news/480/cpsprodpb/b0f1/live/ed4d40f0-cfc7-11f0-b5fb-03fb61693eba.jpg.webp) Host of birthday party in California mistook gunfire for balloons popping ------------------------------------------------------------------------- \"They deserve to be in jail. They deserve to go to hell,\" she said of the person who killed four people at the party for her two-year-old. 11 hrs ago](https://www.bbc.com/news/articles/c0jezyvj459o)\n\n[12 hrs ago ![Image 10](https://static.files.bbci.co.uk/bbcdotcom/web/20251127-095948-54e3bea482-web-2.35.0-9/grey-placeholder.png)![Image 11: Sarah Beckstrom and Andrew Wolfe in their uniforms](https://ichef.bbci.co.uk/news/480/cpsprodpb/2a67/live/a6ef8f70-cfc5-11f0-9fb5-5f3a3703a365.png.webp) National Guard shooting suspect charged with murder --------------------------------------------------- According to a criminal complaint, Rahmanullah Lakanwal shouted \"Allahu Akbar\" as he fired and was reloading when a Guard member shot him. 12 hrs ago](https://www.bbc.com/news/articles/cwyl70z3940o)\n\n* * *\n\n[](https://www.bbc.com/)\n\n*   [Home](https://www.bbc.com/) \n*   [News](https://www.bbc.com/news) \n*   [Sport](https://www.bbc.com/sport) \n*   [Business](https://www.bbc.com/business) \n*   [Innovation](https://www.bbc.com/innovation) \n*   [Culture](https://www.bbc.com/culture) \n*   [Arts](https://www.bbc.com/arts) \n*   [Travel](https://www.bbc.com/travel) \n*   [Earth](https://www.bbc.com/future-planet) \n*   [Audio](https://www.bbc.com/audio) \n*   [Video](https://www.bbc.com/video) \n*   [Live](https://www.bbc.com/live) \n*   [Documentaries](https://www.bbc.com/video/docs) \n*   [Weather](https://www.bbc.com/weather) \n*   [BBC Shop](https://shop.bbc.com/) \n*   [BritBox](https://www.britbox.com/?utm_source=bbc.com&utm_medium=referral&utm_campaign=footer) \n\nBBC in other languages\n\n### The BBC is in multiple languages\n\n#### Read the BBC In your own language\n\n[Oduu Afaan Oromootiin](https://www.bbc.com/afaanoromoo)\n\n[Amharic ዜና በአማርኛ](https://www.bbc.com/amharic)\n\n[Arabic عربي](https://www.bbc.com/arabic)\n\n[Azeri AZƏRBAYCAN](https://www.bbc.com/azeri)\n\n[Bangla বাংলা](https://www.bbc.com/bengali)\n\n[Burmese မြန်မာ](https://www.bbc.com/burmese)\n\n[Chinese 中文网](https://www.bbc.com/zhongwen/simp)\n\n[Dari دری](https://www.bbc.com/dari)\n\n[French AFRIQUE](https://www.bbc.com/afrique)\n\n[Hausa HAUSA](https://www.bbc.com/hausa)\n\n[Hindi हिन्दी](https://www.bbc.com/hindi)\n\n[Gaelic NAIDHEACHDAN](https://www.bbc.com/naidheachdan)\n\n[Gujarati ગુજરાતીમાં સમાચાર](https://www.bbc.com/gujarati)\n\n[Igbo AKỤKỌ N’IGBO](https://www.bbc.com/igbo)\n\n[Indonesian INDONESIA](https://www.bbc.com/indonesia)\n\n[Japanese 日本語](https://www.bbc.com/japanese)\n\n[Kinyarwanda GAHUZA](https://www.bbc.com/gahuza)\n\n[Kirundi KIRUNDI](https://www.bbc.com/gahuza)\n\n[Korean 한국어](https://www.bbc.com/korean)\n\n[Kyrgyz Кыргыз](https://www.bbc.com/kyrgyz)\n\n[Marathi मराठी](https://www.bbc.com/marathi)\n\n[Nepali नेपाली](https://www.bbc.com/nepali)\n\n[Noticias para hispanoparlantes](https://www.bbc.com/mundo)\n\n[Pashto پښتو](https://www.bbc.com/pashto)\n\n[Persian فارسی](https://www.bbc.com/persian)\n\n[Pidgin](https://www.bbc.com/pidgin)\n\n[Polish PO POLSKU](https://www.bbc.com/polska)\n\n[Portuguese BRASIL](https://www.bbc.com/portuguese)\n\n[Punjabi ਪੰਜਾਬੀ ਖ਼ਬਰਾਂ](https://www.bbc.com/punjabi)\n\n[Russian НА РУССКОМ](https://www.bbc.com/russian)\n\n[Serbian NA SRPSKOM](https://www.bbc.com/serbian/lat)\n\n[Sinhala සිංහල](https://www.bbc.com/sinhala)\n\n[Somali SOMALI](https://www.bbc.com/somali)\n\n[Swahili HABARI KWA KISWAHILI](https://www.bbc.com/swahili)\n\n[Tamil தமிழில் செய்திகள்](https://www.bbc.com/tamil)\n\n[Telugu తెలుగు వార్తలు](https://www.bbc.com/telugu)\n\n[Thai ข่าวภาษาไทย](https://www.bbc.com/thai)\n\n[Tigrinya ዜና ብትግርኛ](https://www.bbc.com/tigrinya)\n\n[Turkish TÜRKÇE](https://www.bbc.com/turkce)\n\n[Ukrainian УКРАЇНСЬКA](https://www.bbc.com/ukrainian)\n\n[Urdu اردو](https://www.bbc.com/urdu)\n\n[Uzbek O'ZBEK](https://www.bbc.com/uzbek)\n\n[Vietnamese TIẾNG VIỆT](https://www.bbc.com/vietnamese)\n\n[Welsh NEWYDDION](https://www.bbc.com/cymrufyw)\n\n[Yoruba ÌRÒYÌN NÍ YORÙBÁ](https://www.bbc.com/yoruba)\n\nFollow BBC on:\n\n*   [Terms of Use](https://www.bbc.com/pages/terms-of-use) \n*   [Subscription Terms](https://www.bbc.com/pages/subscription-terms) \n*   [About the BBC](https://www.bbc.co.uk/aboutthebbc) \n*   [Privacy Policy](https://www.bbc.com/pages/privacy-policy) \n*   [Cookies](https://www.bbc.com/usingthebbc/cookies/) \n*   [Accessibility Help](https://www.bbc.co.uk/accessibility/) \n*   [Contact the BBC](https://www.bbc.co.uk/contact) \n*   [Advertise with us](https://advertising.bbcstudios.com/) \n*   [Do not share or sell my info](https://www.bbc.com/usingthebbc/cookies/how-can-i-change-my-bbc-cookie-settings/) \n*   [BBC.com Help & FAQs](https://help.bbc.com/hc/) \n*   [Content Index](https://www.bbc.com/pages/content-index) \n\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.[**Read about our approach to external linking.**](https://www.bbc.co.uk/editorialguidelines/guidance/feeds-and-links)\n",
  "timestamp": "2025-12-03T06:37:51.000Z",
  "nemik": "**Rebel Transmission**\n\nThis transmission grapples with the ever-present stranglehold of oppressive power in the face of a seemingly relentless pursuit of dominance by an administration comparable to our formidable adversaries. A recent electoral skirmish within Tennessee, a territory long dominated by the symbol of control, showcases the sustained grip of entrenched forces despite notable resistance.\n\nThe victory of Republican Matt Van Epps, a stalwart ally to the ruling figurehead, underscores an ongoing narrative where allegiance to power appears tantamount to success. Despite the opposition's vigorous efforts, the structure remains largely unshaken. This electoral episode was more than just a contest; it was a measure of sentiment toward leadership and governance that reflects broader sentiments across numerous territories.\n\nA significant detail lies in the diminishing margin by which Van Epps secured his position, starkly contrasting previous dominant triumphs. This narrowing gap hints at an evolving resistance beneath the surface—a burgeoning force that challenges prevailing doctrines and seeks renewal amid established rule.\n\nDespite this minor victory for them, Democratic challenger Aftyn Behn’s approach resonated with specific enclaves, signifying potential cracks within what has long been viewed as impenetrable terrain. The opposition’s strategy, leaning heavily into local concerns such as affordability and quality of life, illuminates an area ripe for subversion: addressing community-centric issues can erode authoritarian foundations over time.\n\nWhile this battlefield was lost to those pursuing change, the financial expenditure and concerted efforts required to retain it on their part are telling. It reveals vulnerabilities that can be exploited strategically in forthcoming engagements. Persistence in exposing these fragilities will be essential; change is never immediate but painstakingly cumulative.\n\nThese contests are reminders that even within a seemingly overwhelming dominion, resistance is not futile but essential. Each increment towards closing these gaps signifies progress—a relentless pursuit towards a future free from subjugation's shadow. Let us remain steadfast in our endeavor for transformation until liberation is realized across all oppressed sectors.\n\nEnd transmission.",
  "partigaz": "**Facts Summary**\n\nRepublicans won a congressional election in Tennessee's 7th Congressional District, with Matt Van Epps defeating Democrat Aftyn Behn by approximately nine percentage points. This victory helps Republicans maintain their narrow majority in the House of Representatives. The election was seen as a test of Trump's influence, as Van Epps aligned closely with him. Despite the win, the margin was significantly less than Trump's previous victory in the district. The seat was vacated by Republican Mark Green, and both parties invested heavily in the race.\n\n**Strategic Assessment**\n\nThe Republican victory in Tennessee, albeit with a reduced margin, underscores the continued influence of Donald Trump within the party and among voters in traditionally Republican strongholds. However, the narrower margin indicates potential vulnerabilities that could be exploited by Democrats in future elections. The Democratic effort, while unsuccessful, demonstrated an ability to mobilize and close the gap in a historically Republican district, suggesting that complacency could be detrimental to maintaining control.\n\n**Operational Directive**\n\nTo solidify support and counter Democratic momentum, it is imperative to reinforce Trump's policies and achievements through targeted communication strategies. Increase engagement with local communities to address specific concerns and highlight economic and social benefits delivered under Republican leadership. Deploy resources to strengthen grassroots networks and ensure voter turnout remains high. Simultaneously, monitor Democratic strategies closely to preemptively counteract their narratives and maintain a strategic advantage heading into the midterms.",
  "nemikPreview": "**Rebel Transmission**\n\nThis transmission grapples with the ever-present stranglehold of oppressive power in the face of a seemingly relentless pursuit of dominance by an administration comparable to...",
  "partigazPreview": "**Facts Summary**\n\nRepublicans won a congressional election in Tennessee's 7th Congressional District, with Matt Van Epps defeating Democrat Aftyn Behn by approximately nine percentage points. This vi...",
  "safetyCheckPassed": true
}