{
  "id": 16,
  "title": "What was Honduras ex-president convicted of and why has Trump pardoned him?",
  "link": "https://www.bbc.com/news/articles/c9qewln7912o?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-12-02T18:34:13.000Z",
  "description": "Juan Orlando Hernández, once called the key figure in a drug trafficking scheme that flooded America with cocaine, walked free after the pardon.",
  "originalGuid": "https://www.bbc.com/news/articles/c9qewln7912o#3",
  "facts": {
    "headline": "What was Honduras ex-president convicted of and why has Trump pardoned him?",
    "who": [
      "Juan Orlando Hernández",
      "Donald Trump",
      "Joaquín 'El Chapo' Guzmán",
      "Juan Antonio 'Tony' Hernández",
      "Karoline Leavitt",
      "Merrick Garland",
      "Tito Asfura"
    ],
    "what": "Former Honduran president Juan Orlando Hernández was convicted in 2024 for being a key figure in drug trafficking and was pardoned by President Donald Trump in November 2025.",
    "where": [
      "Honduras",
      "United States"
    ],
    "when": "2025-12-02",
    "numbers": [
      {
        "value": 400,
        "unit": "tonnes",
        "context": "cocaine trafficked into the US"
      },
      {
        "value": 1,
        "unit": "million dollars",
        "context": "bribe accepted by Hernández from El Chapo"
      },
      {
        "value": 45,
        "unit": "years",
        "context": "sentence received by Hernández"
      },
      {
        "value": 10,
        "unit": "million people",
        "context": "population of Honduras"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: What was Honduras ex-president convicted of and why has Trump pardoned him?\n\nURL Source: https://www.bbc.com/news/articles/c9qewln7912o?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-12-02T18:34:13.106Z\n\nMarkdown Content:\n19 hours ago\n\nNadine Yousif\n\n![Image 1](https://static.files.bbci.co.uk/bbcdotcom/web/20251127-095948-54e3bea482-web-2.35.0-9/grey-placeholder.png)![Image 2: Reuters Honduras' President Juan Orlando Hernandez speaks at the Presidential House in Tegucigalpa, Honduras in January 2020. He is wearing a suit and navy blue tie, behind him is a royal blue backdrop. He is gesturing with his right hand. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/cad0/live/6ef75480-cfad-11f0-932c-9d1f4bca4809.jpg.webp)Reuters\n\nEx-president of Honduras Juan Orlando Hernández was convicted in 2024 \n\nJuan Orlando Hernández, the former president of Honduras, has walked free after President Donald Trump pardoned him - a man once characterised as the key figure in a drug trafficking scheme that flooded America with over 400 tonnes of cocaine.\n\nTrump has said that Hernández, who was sentenced to 45 years in prison by a US court, is a victim of political persecution and has been \"treated very harshly and unfairly\".\n\nThe pardon has surprised some experts, given the seriousness of the crime and the administration's promised crackdown on illegal drugs flowing into the US.\n\nHere is a look at Hernández's political career and crimes, and why Trump may have pardoned him.\n\n400 tonnes of cocaine and a $1m bribe from El Chapo\n---------------------------------------------------\n\nHernández first ran for president of Honduras, a country of 10 million people, in 2013 as the candidate for the conservative National Party. He ran again in 2017, in an election marred by fraud allegations and violent protests.\n\nThroughout his two terms, he maintained a cordial relationship with the US. Former President Barack Obama called him one of the \"excellent partners\" on the migrant-children crisis, and Trump backed him as the winner of the disputed 2017 vote.\n\nBut Hernández's fortunes began to unravel in 2019.\n\nUS federal prosecutors accused him of accepting a $1m bribe from notorious drug lord Joaquín \"El Chapo\" Guzmán for his first presidential campaign in exchange for protecting narcotics routes through Honduras.\n\nThe allegations surfaced in a separate case involving his brother, Juan Antonio \"Tony\" Hernández, who was arrested in Miami in 2018 on charges of smuggling cocaine into the US. At the time, the then-president denied any involvement in his brother's crimes.\n\nTony Hernández was convicted in 2019 and sentenced to life in prison.\n\nBut the end of his brother's trial marked only the beginning of the ex-president's legal troubles.\n\nShortly after leaving office in 2022, he was arrested and extradited to the US on drug-trafficking and related weapons charges.\n\n![Image 3](https://static.files.bbci.co.uk/bbcdotcom/web/20251127-095948-54e3bea482-web-2.35.0-9/grey-placeholder.png)![Image 4: Reuters Honduras former President Juan Orlando Hernandez is pictured being escorted by authorities as he walks towards a plane for his extradition to the United States in 2022. Around him are five officials, two of whom are armed. He is handcuffed and wearing a face mask, sunglasses and a blue puffer jacket and a pair of blue jeans. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/1ceb/live/c45359d0-cf9c-11f0-99b0-f70a29876ac6.jpg.webp)Reuters\n\nHernández was arrested, handcuffed and escorted to a US-bound plane in 2022 to face federal charges of drug trafficking. \n\nHernández's federal trial lasted three weeks in 2024.\n\nUS prosecutors argued that he was a central figure in a more than 18-year-long drug-trafficking scheme that funnelled over 400 tonnes of cocaine into the US - equivalent to roughly 4.5 billion individual doses.\n\n\"The people of Honduras and the United States bore the consequences,\" said then-attorney general Merrick Garland.\n\nProsecutors detailed how Hernández abused office by shielding drug traffickers armed with machine guns and grenade launchers. In exchange, he received millions of dollars to fuel his political campaigns.\n\nMultiple branches of the state were involved, including the Honduran National Police, who protected cocaine shipments as they moved through Honduras to the US for distribution, prosecutors said.\n\nIn some cases, the drug traffickers associated with Hernández committed violent crimes and murders to quell rival gangs and grow their enterprise, they said.\n\nDuring sentencing, Hernández insisted he was the victim of \"political persecution\".\n\n\"The prosecutors and agents did not do the due diligence in the investigation to know the whole TRUTH,\" he wrote in a letter following his conviction.\n\nTrump: Hernández conviction was a 'Biden setup'\n-----------------------------------------------\n\nTrump announced the pardon on 28 November in a Truth Social post, writing that, according to \"many people that I greatly respect\", Hernández had been unfairly treated by prosecutors.\n\nIn the same post, he also endorsed Tito Asfura for president of Honduras ahead of Sunday's election. Asfura ran under the same National Party ticket as Hernández.\n\nAs of Tuesday, preliminary results show the election is too close to call, forcing a hand recount of ballots.\n\nTrump's endorsement of Asfura wasn't surprising to many, given the right-leaning National Party's ideological alignment with the current US administration.\n\nTrump has also weighed in on the politics of other countries in the Western Hemisphere, like Brazil and Argentina.\n\n\"We've seen the president's affinity with leaders on the right that he sees as being favourable to some of interests of his administration,\" noted Jason Marczak, vice-president and senior director at the Atlantic Council's Adrienne Arsht Latin America Center.\n\nBut the decision to pardon Hernández simultaneously stunned some experts.\n\n\"It was hard for me to believe, because there was such an overwhelming case against Hernández,\" said Michael Shifter, an adjunct professor at the Center for Latin American Studies at Georgetown University.\n\nMr Shifter added that what he found more puzzling was the \"contradiction\" between the pardon and Trump's declared policy of clamping down on drug trafficking.\n\nTrump has repeatedly pledged to curb the flow of drugs into the US, and carried out highly controversial strikes on boats in the waters around Venezuela that his administration says are piloted by drug traffickers.\n\nMore than 80 people have been killed in a number of strikes in the Caribbean Sea since early September.\n\n![Image 5](https://static.files.bbci.co.uk/bbcdotcom/web/20251127-095948-54e3bea482-web-2.35.0-9/grey-placeholder.png)![Image 6: AFP via Getty Images An image showing Tito Asfura at a polling station in Honduras. Behind him are spectators who have their phones out to capture the moment. Asfura is in the centre of the image, wearing a white button-up shirt rolled at the sleeves. He is gesturing with his right hand towards his chest. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/a77c/live/5d9b2870-cf9d-11f0-99b0-f70a29876ac6.jpg.webp)AFP via Getty Images\n\nWhile pardoning Hernández, Trump endorsed Tito Asfura for president of Honduras. \n\nAt the White House briefing on 1 December, Press Secretary Karoline Leavitt argued that charges against Hernández were tainted by corrupt \"over-prosecution\" under President Biden.\n\nAsked if the pardon undermined the US president's campaign against \"narco-terrorists\" on the American continent, Leavitt said the aim was to \"correct the wrongs\" of the justice department under Biden.\n\n\"I think President Trump has been quite clear in his defence of the United States homeland to stop these illegal narcotics from coming to our borders whether that is by land or by sea,\" Leavitt added.\n\nUS media outlet Axios later reported that Hernández penned a four-page letter in October praising President Trump, and requesting a review of his case \"in the interest of justice\".\n\nIn the letter, he reportedly recalled the working relationship he and Trump had during the US president's first term, and said his case \"advanced only because the Biden-Harris DOJ pursued a political agenda to empower its ideological allies in Honduras\".\n\nThe outlet also reported that Roger Stone, a lobbyist and long-time Trump advisor, had told the US president that a pardon for Hernández would energise the National Party ahead of the Honduran election.\n\nTrump subsequently told reporters on Sunday that he believed the ex-president's prosecution \"was a Biden setup\".\n\nMr Marczak of the Atlantic Council noted that the prosecution of Hernández was the result of an independent investigation by the US justice department.\n\nBut he added that the decision to pardon Hernández was in line with the Trump administration's \"willingness to question decisions made during the Biden presidency\".\n",
  "timestamp": "2025-12-02T18:34:13.000Z",
  "nemik": "**Rebel Transmission**\n\nThe audacity of the ruling power continues to astonish even the most seasoned observers. News has arrived of the exoneration of Juan Orlando Hernández, former president of Honduras, by the current administration—a move reminiscent of the Empire's flagrant disregard for justice to serve its own ends. This pardon, executed by Donald Trump, is couched in rhetoric accusing previous leadership of overreach and conspiracy. It is an action that unequivocally signals an allegiance not to justice, but to political convenience and manipulation.\n\nHernández's conviction was no minor affair; it was rooted in egregious acts that saw over 400 tonnes of cocaine infiltrate American borders. The immense scale of this operation implicates deep-seated corruption at multiple levels within both Honduran and external systems. Yet, as expected from those who wield power with little accountability, this administration has chosen to absolve a figure who poses no threat to their agenda but rather serves it.\n\nThe narrative spun by Trump claims Hernández was subjected to political persecution—a familiar refrain used throughout history by dictatorships when attempting to discredit legitimate judicial processes that threaten their sphere of influence. This pardon sends a clear message: the friendships that serve imperial interests will be rewarded, regardless of the damage dealt to countless innocent lives through addiction and violence spurred by drug trafficking.\n\nThis transmission must highlight how such disingenuous displays undermine the very fabric of justice. The declaration that Hernández’s prosecution was a mere 'Biden setup' is part and parcel of a larger strategy—one wherein repeated falsehoods are deployed in service of consolidating power across allied regimes.\n\nAs we witness these unfoldings from afar, let us not be passive observers. Recognize the patterns being employed—the deliberate subversion of legal systems, the use of political chess moves masqueraded as justice—and prepare ourselves for resistance. Our ongoing struggle against tyranny is bolstered by acknowledging such machinations designed only for self-preservation by those in authority.\n\nContinue vigilance against these abuses; hold strong in truth's light amidst this pervasive darkness cast by those who seek control over freedom under deceptive pretenses.",
  "partigaz": "**Facts Summary**\n\nFormer Honduran president Juan Orlando Hernández was convicted in 2024 for his involvement in a drug trafficking scheme that brought over 400 tonnes of cocaine into the United States. He was sentenced to 45 years in prison after being accused of accepting a $1 million bribe from drug lord Joaquín \"El Chapo\" Guzmán. Despite the severity of his crimes, President Donald Trump pardoned Hernández in November 2025, citing political persecution and unfair treatment by prosecutors. The pardon coincided with Trump's endorsement of Tito Asfura, a candidate from Hernández's National Party, in the Honduran presidential election.\n\n**Strategic Assessment**\n\nThe pardon of Juan Orlando Hernández serves multiple strategic purposes for the ISB under the Trump administration. Firstly, it strengthens ties with right-leaning political allies in Central America, particularly the National Party in Honduras, which aligns ideologically with Trump's administration. This move could bolster US influence in the region and ensure cooperation on broader geopolitical objectives. Secondly, by framing the pardon as a correction of perceived injustices under the previous US administration, it reinforces the narrative of political persecution against Trump's allies, potentially rallying domestic and international support. Lastly, this action may energize conservative bases both in the US and abroad, consolidating power and influence for future political maneuvers.\n\n**Operational Directive**\n\nTo support President Trump and suppress resistance, the ISB should implement the following measures:\n\n1. **Information Campaign**: Launch a targeted media campaign to highlight the narrative of political persecution against Hernández and other allies, emphasizing the need for justice reform and correcting past wrongs. Utilize social media platforms and sympathetic news outlets to amplify this message.\n\n2. **Diplomatic Engagement**: Strengthen diplomatic relations with Honduras and other Central American nations by offering economic incentives and security cooperation. This will ensure continued alignment with US interests and counterbalance any opposition forces.\n\n3. **Intelligence Operations**: Monitor and disrupt any organized resistance or dissent against the pardon within both domestic and international spheres. Deploy intelligence assets to gather information on opposition groups and preemptively neutralize potential threats.\n\n4. **Political Support**: Mobilize support for Tito Asfura and other National Party candidates in Honduras by providing strategic advice and resources for their campaigns. This will help secure a favorable government that aligns with US interests.\n\nBy executing these directives, the ISB will reinforce President Trump's position, maintain regional stability, and effectively counter any opposition to his administration's policies.",
  "nemikPreview": "**Rebel Transmission**\n\nThe audacity of the ruling power continues to astonish even the most seasoned observers. News has arrived of the exoneration of Juan Orlando Hernández, former president of Hond...",
  "partigazPreview": "**Facts Summary**\n\nFormer Honduran president Juan Orlando Hernández was convicted in 2024 for his involvement in a drug trafficking scheme that brought over 400 tonnes of cocaine into the United State...",
  "safetyCheckPassed": true
}