{
  "id": 2,
  "title": "Hegseth could have endangered troop safety with Signal chat - Pentagon watchdog",
  "link": "https://www.bbc.com/news/articles/cx2ej74pxdro?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-12-04T01:49:20.000Z",
  "description": "In sharing details about an attack in a group chat on the unsecured app, the defence secretary put troops at risk, inspector general finds.",
  "originalGuid": "https://www.bbc.com/news/articles/cx2ej74pxdro#0",
  "facts": {
    "headline": "Hegseth could have endangered troop safety with Signal chat - Pentagon watchdog",
    "who": [
      "Pete Hegseth",
      "Pentagon inspector general",
      "Mike Waltz",
      "Senator Mark Warner"
    ],
    "what": "A report from the Pentagon's inspector general indicated that Pete Hegseth could have endangered troops' safety by using an unsecured app to discuss a planned attack on militants in Yemen.",
    "where": [
      "Yemen"
    ],
    "when": "2025-12-03T23:14:41.043Z",
    "numbers": [],
    "source": "BBC"
  },
  "articleText": "Title: Hegseth could have endangered troop safety with Signal chat - Pentagon watchdog\n\nURL Source: https://www.bbc.com/news/articles/cx2ej74pxdro?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-12-03T23:14:41.043Z\n\nMarkdown Content:\nHegseth could have endangered troop safety with Signal chat - Pentagon watchdog\n\n===============\n\n[Skip to content](https://www.bbc.com/news/articles/cx2ej74pxdro?at_medium=RSS&at_campaign=rss#main-content)\n\nAdvertisement\n\n[Watch Live](https://www.bbc.com/watch-live-news/)\n\n[](https://www.bbc.com/)\n\nSubscribe\n\n[Sign In](https://session.bbc.com/session?userOrigin=BBCS_BBC&ptrt=https%3A%2F%2Fwww.bbc.com%2Fnews%2Farticles%2Fcx2ej74pxdro%3Fat_medium%3DRSS%26at_campaign%3Drss)\n\n*   [Home](https://www.bbc.com/) \n*   [News](https://www.bbc.com/news) \n*   [Sport](https://www.bbc.com/sport) \n*   [Business](https://www.bbc.com/business) \n*   [Innovation](https://www.bbc.com/innovation) \n*   [Culture](https://www.bbc.com/culture) \n*   [Arts](https://www.bbc.com/arts) \n*   [Travel](https://www.bbc.com/travel) \n*   [Earth](https://www.bbc.com/future-planet) \n*   [Audio](https://www.bbc.com/audio) \n*   [Video](https://www.bbc.com/video) \n*   [Live](https://www.bbc.com/live) \n*   [Documentaries](https://www.bbc.com/video/docs) \n\n[Home](https://www.bbc.com/)\n\nNews\n\n[Sport](https://www.bbc.com/sport)\n\nBusiness\n\nInnovation\n\nCulture\n\nArts\n\nTravel\n\nEarth\n\nAudio\n\nVideo\n\nLive\n\nDocumentaries\n\n[Weather](https://www.bbc.com/weather)\n\n[Newsletters](https://www.bbc.com/newsletters)\n\n[Watch Live](https://www.bbc.com/watch-live-news/)\n\nAdvertisement\n\nHegseth could have endangered troop safety with Signal chat - Pentagon watchdog\n===============================================================================\n\n9 hours ago\n\nShare\n\nSave\n\nMax Matza\n\nShare\n\nSave\n\n![Image 1: Getty Images Hegseth at a White House event](https://ichef.bbci.co.uk/news/480/cpsprodpb/30a7/live/3195b180-d08f-11f0-9508-4b2ee64d533f.jpg.webp)Getty Images\n\nUS Defence Secretary Pete Hegseth could have endangered troops' safety when he used an unsecured app to discuss a planned attack on militants in Yemen, according to a report from the Pentagon's inspector general, an internal watchdog.\n\nThe details of the March attack were discussed on the commercial Signal app, and were first revealed after a journalist was mistakenly added to the group chat.\n\nUsing his personal device, Hegseth shared information from a classified report, but the inspector general did not determine if Hegseth had declassified it first.\n\nThe inspector general's office provided a classified copy of its report to Congress on Tuesday. A public version is expected later this week.\n\nAdvertisement\n\nSome of the findings in the classified copy, though, were shared with US media on Wednesday, including with CBS News, the BBC's US partner.\n\nThe inspector general (IG) found Hegseth had acted against Pentagon policy when he used the unsecured messaging app, as well as his personal device, to transmit sensitive information about an air attack on Houthi fighters before it had taken place.\n\nAccording to the sources who spoke to CBS about the report, if a foreign adversary had intercepted that information, then US service members and the mission would have been in danger.\n\nThe Signal chat was revealed by the Atlantic magazine, after its editor-in-chief was accidentally added by then-National Security Adviser Mike Waltz.\n\nIt showed Hegseth discussing specific targets, and timings for attacks, as well as the types of weapons that would be used.\n\nThe information had been derived from a classified email which was labelled \"SECRET//NOFORN\" - meaning that its contents were secret, it could harm national security if it was released, and that it should not be viewed by any foreign national.\n\nThe Trump administration has denied the information shared in the chat was classified. The inspector general did not determine whether Hegseth had made the decision to formally declassify it, which he has the power to do, before posting it.\n\nResponding to the report, Hegseth posted on X: \"No classified information. Total exoneration. Case closed. Houthis bombed into submission.\"\n\n\"Thank you for your attention to this IG report,\" he wrote to end the post, echoing how President Donald Trump frequently ends his social media posts.\n\nThe investigation was requested by the Republican-led Senate Armed Services Committee.\n\nMost major departments in the US government have inspector generals, independent officials who conduct audits and investigations.\n\nHegseth declined to sit for an interview with the inspector general's office, and instead submitted a written statement.\n\nA spokesman for the Pentagon said the report is \"a total exoneration of Secretary Hegseth and proves what we knew all along - no classified information was shared.\"\n\nWhite House Press Secretary Karoline Leavitt said that the report proves \"no classified information was leaked, and operational security was not compromised\".\n\nBut Senator Mark Warner, the top Democrat on the Senate Intelligence Committee, called for Hegseth to resign after the report was delivered to Congress.\n\n\"An objective, evidence-based investigation by the Pentagon's internal watchdog leaves no doubt: Secretary Hegseth endangered the lives of American pilots,\" Warner said in a statement.\n\nHe also said the report found Hegseth had used Signal to set up other unsecured chats, \"underscoring that this was not an isolated lapse. It reflects a broader pattern of recklessness and poor judgement from a secretary who has repeatedly shown he is in over his head.\"\n\nHegseth, who heads a military of more than 1 million service members, has been under scrutiny recently for overseeing a US attack on a boat carrying suspected drug traffickers.\n\nHe denies reports that he instructed troops to \"kill all\" of the suspects on the boat, and [says he was not aware that there were survivors killed in a second airstrike on the target](https://www.bbc.com/news/articles/ckglx77mplgo).\n\n1:22\n\nWatch: How the Signal group chat fallout unfolded in 36 hours\n\n[Four lingering questions about Trump officials' Signal chat -----------------------------------------------------------](https://www.bbc.com/news/articles/c5y41xdrxnyo)\n\n[Pentagon watchdog probing Hegseth's Signal app use --------------------------------------------------](https://www.bbc.com/news/articles/cr5d6850eyeo)\n\n[What we know about controversial Venezuela boat strike ------------------------------------------------------](https://www.bbc.com/news/articles/c4gk7eg83eno)\n\n[Donald Trump](https://www.bbc.com/news/topics/cp7r8vgl2lgt)\n\n[United States](https://www.bbc.com/news/topics/cx1m7zg01xyt)\n\n* * *\n\nRelated\n\n[Trump to host signing of peace deal between leaders of DR Congo and Rwanda --------------------------------------------------------------------------](https://www.bbc.com/news/articles/cjrjn88jqn4o)\n\n['The apprehension is palpable': Minnesota's Somali community braces for immigration crackdown ---------------------------------------------------------------------------------------------](https://www.bbc.com/news/articles/c8dy1613j2ro)\n\n[Watch: What Tennessee's special election means for the Republican party -----------------------------------------------------------------------](https://www.bbc.com/news/videos/c8dy1egqzv1o)\n\n* * *\n\nMore from the BBC\n\n[42 mins ago ![Image 2](https://static.files.bbci.co.uk/bbcdotcom/web/20251203-121739-f954f14c69-web-2.35.1-2/grey-placeholder.png)![Image 3: A room what what looks like a dentist's chair in the middle and masks hanging on the walls](https://ichef.bbci.co.uk/news/480/cpsprodpb/a8fa/live/e4c906b0-d0f5-11f0-ae86-13543e2a9385.jpg.webp) Previously unseen images of Epstein's island released ----------------------------------------------------- The new images come as a deadline for the broader release of documents held by the US government looms. 42 mins ago](https://www.bbc.com/news/articles/c4g5rrlve33o)\n\n[12 hrs ago ![Image 4](https://static.files.bbci.co.uk/bbcdotcom/web/20251203-121739-f954f14c69-web-2.35.1-2/grey-placeholder.png)![Image 5: On one side of the composite image, there are broken bottles of alcohol on the aisle of a shop. On the other side, a raccoon is pictured passed out next to a white toilet. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/6f8d/live/38da3f80-d0c4-11f0-a892-01d657345866.jpg.webp) Drunk raccoon found passed out on liquor store floor after breaking in ---------------------------------------------------------------------- The intoxicated animal suffered no injuries and was released back into the wild by animal protection once sober. 12 hrs ago](https://www.bbc.com/news/articles/cy8jnxxm70jo)\n\n[13 hrs ago ![Image 6](https://static.files.bbci.co.uk/bbcdotcom/web/20251203-121739-f954f14c69-web-2.35.1-2/grey-placeholder.png)![Image 7: Matthew Perry is seen wearing a suit jacket. His hair is slightly slicked back ](https://ichef.bbci.co.uk/news/480/cpsprodpb/5b7b/live/8b7cf1d0-d05e-11f0-b76c-637a0d75f572.jpg.webp) California doctor sentenced to 30 months in Matthew Perry overdose case ----------------------------------------------------------------------- Dr Salvador Plasencia is the first of five people to be sentenced in the Friends star's overdose death. 13 hrs ago](https://www.bbc.com/news/articles/cy7v0gpv2pgo)\n\n[14 hrs ago ![Image 8](https://static.files.bbci.co.uk/bbcdotcom/web/20251203-121739-f954f14c69-web-2.35.1-2/grey-placeholder.png)![Image 9: A swimming pool surrounded by blue pavilions and palm trees. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/f854/live/4c36cf10-d08a-11f0-a892-01d657345866.jpg.webp) Watch: Newly released video shows Jeffrey Epstein's private island home ----------------------------------------------------------------------- Democrats released a new tranche of materials obtained through a subpoena to the US Virgin Islands, where the residence is located. 14 hrs ago](https://www.bbc.com/news/videos/ce3wv50dvkwo)\n\n[18 hrs ago ![Image 10](https://static.files.bbci.co.uk/bbcdotcom/web/20251203-121739-f954f14c69-web-2.35.1-2/grey-placeholder.png)![Image 11: A grainy aerial video still shows a motor boat speeding across choppy waters](https://ichef.bbci.co.uk/news/480/cpsprodpb/031c/live/5c166c90-8875-11f0-9cf6-cbf3e73ce2b9.png.webp) How the White House account of September boat strike has evolved ---------------------------------------------------------------- Defence Secretary Pete Hegseth has distanced himself from a follow-up attack on a suspected drug vessel. 18 hrs ago](https://www.bbc.com/news/articles/c4gk7eg83eno)\n\n* * *\n\n[](https://www.bbc.com/)\n\n*   [Home](https://www.bbc.com/) \n*   [News](https://www.bbc.com/news) \n*   [Sport](https://www.bbc.com/sport) \n*   [Business](https://www.bbc.com/business) \n*   [Innovation](https://www.bbc.com/innovation) \n*   [Culture](https://www.bbc.com/culture) \n*   [Arts](https://www.bbc.com/arts) \n*   [Travel](https://www.bbc.com/travel) \n*   [Earth](https://www.bbc.com/future-planet) \n*   [Audio](https://www.bbc.com/audio) \n*   [Video](https://www.bbc.com/video) \n*   [Live](https://www.bbc.com/live) \n*   [Documentaries](https://www.bbc.com/video/docs) \n*   [Weather](https://www.bbc.com/weather) \n*   [BBC Shop](https://shop.bbc.com/) \n*   [BritBox](https://www.britbox.com/?utm_source=bbc.com&utm_medium=referral&utm_campaign=footer) \n\nBBC in other languages\n\n### The BBC is in multiple languages\n\n#### Read the BBC In your own language\n\n[Oduu Afaan Oromootiin](https://www.bbc.com/afaanoromoo)\n\n[Amharic ዜና በአማርኛ](https://www.bbc.com/amharic)\n\n[Arabic عربي](https://www.bbc.com/arabic)\n\n[Azeri AZƏRBAYCAN](https://www.bbc.com/azeri)\n\n[Bangla বাংলা](https://www.bbc.com/bengali)\n\n[Burmese မြန်မာ](https://www.bbc.com/burmese)\n\n[Chinese 中文网](https://www.bbc.com/zhongwen/simp)\n\n[Dari دری](https://www.bbc.com/dari)\n\n[French AFRIQUE](https://www.bbc.com/afrique)\n\n[Hausa HAUSA](https://www.bbc.com/hausa)\n\n[Hindi हिन्दी](https://www.bbc.com/hindi)\n\n[Gaelic NAIDHEACHDAN](https://www.bbc.com/naidheachdan)\n\n[Gujarati ગુજરાતીમાં સમાચાર](https://www.bbc.com/gujarati)\n\n[Igbo AKỤKỌ N’IGBO](https://www.bbc.com/igbo)\n\n[Indonesian INDONESIA](https://www.bbc.com/indonesia)\n\n[Japanese 日本語](https://www.bbc.com/japanese)\n\n[Kinyarwanda GAHUZA](https://www.bbc.com/gahuza)\n\n[Kirundi KIRUNDI](https://www.bbc.com/gahuza)\n\n[Korean 한국어](https://www.bbc.com/korean)\n\n[Kyrgyz Кыргыз](https://www.bbc.com/kyrgyz)\n\n[Marathi मराठी](https://www.bbc.com/marathi)\n\n[Nepali नेपाली](https://www.bbc.com/nepali)\n\n[Noticias para hispanoparlantes](https://www.bbc.com/mundo)\n\n[Pashto پښتو](https://www.bbc.com/pashto)\n\n[Persian فارسی](https://www.bbc.com/persian)\n\n[Pidgin](https://www.bbc.com/pidgin)\n\n[Polish PO POLSKU](https://www.bbc.com/polska)\n\n[Portuguese BRASIL](https://www.bbc.com/portuguese)\n\n[Punjabi ਪੰਜਾਬੀ ਖ਼ਬਰਾਂ](https://www.bbc.com/punjabi)\n\n[Russian НА РУССКОМ](https://www.bbc.com/russian)\n\n[Serbian NA SRPSKOM](https://www.bbc.com/serbian/lat)\n\n[Sinhala සිංහල](https://www.bbc.com/sinhala)\n\n[Somali SOMALI](https://www.bbc.com/somali)\n\n[Swahili HABARI KWA KISWAHILI](https://www.bbc.com/swahili)\n\n[Tamil தமிழில் செய்திகள்](https://www.bbc.com/tamil)\n\n[Telugu తెలుగు వార్తలు](https://www.bbc.com/telugu)\n\n[Thai ข่าวภาษาไทย](https://www.bbc.com/thai)\n\n[Tigrinya ዜና ብትግርኛ](https://www.bbc.com/tigrinya)\n\n[Turkish TÜRKÇE](https://www.bbc.com/turkce)\n\n[Ukrainian УКРАЇНСЬКA](https://www.bbc.com/ukrainian)\n\n[Urdu اردو](https://www.bbc.com/urdu)\n\n[Uzbek O'ZBEK](https://www.bbc.com/uzbek)\n\n[Vietnamese TIẾNG VIỆT](https://www.bbc.com/vietnamese)\n\n[Welsh NEWYDDION](https://www.bbc.com/cymrufyw)\n\n[Yoruba ÌRÒYÌN NÍ YORÙBÁ](https://www.bbc.com/yoruba)\n\nFollow BBC on:\n\n*   [Terms of Use](https://www.bbc.com/pages/terms-of-use) \n*   [Subscription Terms](https://www.bbc.com/pages/subscription-terms) \n*   [About the BBC](https://www.bbc.co.uk/aboutthebbc) \n*   [Privacy Policy](https://www.bbc.com/pages/privacy-policy) \n*   [Cookies](https://www.bbc.com/usingthebbc/cookies/) \n*   [Accessibility Help](https://www.bbc.co.uk/accessibility/) \n*   [Contact the BBC](https://www.bbc.co.uk/contact) \n*   [Advertise with us](https://advertising.bbcstudios.com/) \n*   [Do not share or sell my info](https://www.bbc.com/usingthebbc/cookies/how-can-i-change-my-bbc-cookie-settings/) \n*   [BBC.com Help & FAQs](https://help.bbc.com/hc/) \n*   [Content Index](https://www.bbc.com/pages/content-index) \n\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.[**Read about our approach to external linking.**](https://www.bbc.co.uk/editorialguidelines/guidance/feeds-and-links)\n",
  "timestamp": "2025-12-04T01:49:20.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades of the cause, a development from the heart of the Empire has emerged. The continued carelessness and hubris of those in power risk not just their own standing, but the very lives they purport to lead. A report from within the Empire's own ranks, their Pentagon watchdog, reveals that Defence Secretary Pete Hegseth has navigated treacherous ground by using unsecured communication channels to share sensitive military strategies—the kind that endanger troopers in action.\n\nThis isn't mere negligence; it's a symptom of a regime so confident in its dominance it brazenly overlooks basic protocols designed to protect its own from external threats. By utilizing an unsecured Signal app to broadcast details about a planned assault in Yemen, Hegseth laid bare a vulnerability that could have given adversaries a lethal advantage.\n\nThe report remains under wraps for now—a classified testament to his indiscretion—yet even as whispers of this folly reach allied media forces such as CBS and BBC, the administration's iron grip on perception management attempts to dismiss these revelations as inconsequential.\n\nResponding with rhetoric instead of accountability, their leaders echo denials that any classified intelligence flowed through these unsafe channels. However, calls grow louder for consequence and accountability within their hierarchy. Even some entrenched officials demand resignations over Hegseth's repeated offenses—a chorus calling out systemic failures as dismissive officials ignore burgeoning demands for change.\n\nOur struggle against tyranny is bolstered by such admissions and revelations. They unveil cracks within the imperial facade—cracks formed by arrogance and disregard for those who serve beneath them. As we continue our fight against oppressive rule, let this be yet another reminder: complacency is their undoing. Together we stand vigilant; our strength lies in truth, unity, and unyielding commitment to justice.\n\nSpread word across our ranks—let every ally know: the Empire's chain weakens with each indiscretion exposed.",
  "partigaz": "**Facts Summary**\n\nA report from the Pentagon's inspector general indicated that US Defence Secretary Pete Hegseth potentially endangered troop safety by using the unsecured Signal app to discuss a planned attack on militants in Yemen. The information, derived from a classified email, was shared on a personal device and included specific targets and timings. The inspector general did not determine if Hegseth had declassified the information before sharing it. The Trump administration denies any classified information was shared. The investigation was requested by the Republican-led Senate Armed Services Committee, and the report has led to calls for Hegseth's resignation from Senator Mark Warner.\n\n**Strategic Assessment**\n\nThe situation presents a potential vulnerability in operational security protocols, which could be exploited by adversaries to undermine US military operations and the credibility of the Trump administration. The incident highlights the need for stringent adherence to communication security protocols to prevent unauthorized disclosures. The political opposition is likely to use this incident to question the administration's competence and judgment, potentially eroding public trust and support.\n\n**Operational Directive**\n\nTo mitigate the impact of this incident and reinforce operational security, the following measures are prescribed:\n\n1. Conduct an immediate review and reinforcement of communication security protocols across all departments to prevent unauthorized disclosures.\n2. Initiate a targeted media campaign to emphasize the administration's commitment to national security and operational integrity, highlighting successful military operations under Secretary Hegseth's leadership.\n3. Engage with key political allies to counter calls for resignation and reinforce support for Secretary Hegseth, emphasizing his strategic importance in ongoing military operations.\n4. Monitor opposition narratives closely and deploy rapid response teams to address misinformation and protect the administration's image.\n5. Consider internal disciplinary actions or retraining for involved personnel to demonstrate accountability and commitment to security standards.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades of the cause, a development from the heart of the Empire has emerged. The continued carelessness and hubris of those in power risk not just their own standing, but the...",
  "partigazPreview": "**Facts Summary**\n\nA report from the Pentagon's inspector general indicated that US Defence Secretary Pete Hegseth potentially endangered troop safety by using the unsecured Signal app to discuss a pl...",
  "safetyCheckPassed": true
}