{
  "id": 3,
  "title": "They contracted hepatitis before the vaccine was given at birth - now the shot may be delayed again",
  "link": "https://www.bbc.com/news/articles/c1m8gx545k5o?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-12-04T18:26:11.000Z",
  "description": "US health secretary Robert F Kennedy Jr has questioned the safety of the vaccine and downplayed the risk of contracting the virus.",
  "originalGuid": "https://www.bbc.com/news/articles/c1m8gx545k5o#0",
  "facts": {
    "headline": "They contracted hepatitis before the vaccine was mandated at birth - now the shot may be postponed",
    "who": [
      "Phil Shin",
      "John Ellis",
      "Claudia Hawkins",
      "Helen Ouyang",
      "Robert F Kennedy Jr",
      "Robert Malone",
      "Evelyn Griffin"
    ],
    "what": "The US Advisory Committee on Immunization Practices is considering postponing the hepatitis B vaccine for newborns.",
    "where": [
      "United States",
      "Columbia University Irving Medical Center",
      "Northwestern University"
    ],
    "when": "2025-12-04T12:33:03.952Z",
    "numbers": [
      {
        "value": "90",
        "unit": "thousand",
        "context": "estimated deaths prevented by administering the hepatitis B vaccine"
      },
      {
        "value": "95",
        "unit": "percent",
        "context": "reduction in childhood infections due to the hepatitis B vaccine"
      },
      {
        "value": "8",
        "unit": "months",
        "context": "duration of time Phil Shin waited for a liver transplant"
      }
    ],
    "source": "BBC News"
  },
  "articleText": "Title: They contracted hepatitis before the vaccine was mandated at birth - now the shot may be postponed\n\nURL Source: https://www.bbc.com/news/articles/c1m8gx545k5o?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-12-04T12:33:03.952Z\n\nMarkdown Content:\n2 hours ago\n\nMadeline Halpert\n\n![Image 1: Phil Shin Phil Shin](https://ichef.bbci.co.uk/news/480/cpsprodpb/0a86/live/9c90a0f0-d123-11f0-9d18-614b3678ebf8.jpg.webp)Phil Shin\n\nPhil Shin learned he had hepatitis B in middle school, but didn't have complications until he was 48 and diagnosed with liver cancer\n\nJohn Ellis was 16 when frequent stomach pains led to an unexpected diagnosis.\n\nHis mother suggested they go to the doctor, and after a series of tests, the results took even Mr Ellis's mother, a nurse of 30 years, by surprise: Mr Ellis had hepatitis B.\n\nBorn in 1990, just a year before the US began universally vaccinating against the virus right after birth, Mr Ellis had contracted the virus sometime before he got the shot at age 12.\n\n\"My mom and my initial reaction was, 'Is that even something that people get anymore?'\" he said. \"That was kind of a dark time for me, being a teenager and having to navigate conversations with friends and family about this chronic illness that a lot of people just aren't familiar with.\"\n\n*   [RFK Jr cancels $500m in funding for mRNA vaccines for diseases like Covid](https://www.bbc.com/news/articles/c74dzdddvmjo)\n*   [Former CDC head says she was fired for refusing Kennedy's vaccine changes](https://www.bbc.com/news/articles/cn76dz1zxz3o)\n*   [RFK Jr sacks entire US vaccine committee](https://www.bbc.com/news/articles/clyge27y2g9o)\n\nThe US could soon return to a time where vaccinations against hepatitis B are no longer recommended for newborns. The leader of the Advisory Committee on Immunization Practices (Acip), an expert panel that makes vaccine recommendations to the Centers for Disease Control and Prevention (CDC), [told](https://www.washingtonpost.com/health/2025/12/02/acip-hepatitis-b-childhood-immunization-schedule/) the Washington Post this week that the group would vote to delay the shots for newborns to a later, undetermined time. The panel was set to vote on the matter on Thursday, but decided to push the vote to Friday after members said they needed more time to look at proposed changes.\n\nSome public health experts and those living with hepatitis B say the move is a regression that could risk exposing all children to a virus that has become much less common because of vaccines.\n\n\"Evidence shows that even a two-month delay in administering the hepatitis B vaccine can result in hundreds of additional deaths from liver disease and liver cancer as those children age,\" said Claudia Hawkins, director for the Center for Global Communicable and Emerging Infectious Diseases at Northwestern University's Feinberg School of Medicine.\n\nSince the US began giving children their first of several hepatitis B vaccine doses at birth in 1991, data suggests the shots have reduced the number of childhood infections by 95% and prevented an estimated 90,000 deaths.\n\nHepatitis B is a liver infection that spreads through direct contact with bodily fluids, and can lead to dangerous liver conditions including cancer, liver failure and cirrhosis. Pregnant people who have hepatitis B also can transmit the virus to newborns during delivery, which can lead to chronic infections that can damage the liver.\n\nFew symptoms and no cure\n------------------------\n\nMost people infected with the virus do not have symptoms and are therefore unaware of their infection.\n\nFor years, that was the case for Phil Shin, who was diagnosed with hepatitis B during a doctor's visit before middle school. Soon, he discovered that his two siblings had the virus, as well as his mother and his mother's mother, all born years before the vaccine.\n\nA runner, Mr Shin lived for years without symptoms, until age 48, when doctors found a \"racketball-sized tumor\" in his liver.\n\nHe had emergency surgery, but the cancer returned. Eventually, a friend helped him with a liver transplant that saved his life, but waiting for the transplant was agonising.\n\n\"That was a period of about eight months where we were just completely in the dark,\" said Mr Shin, a board member of the American Liver Foundation. \"So that was where most of the emotional toll did its damage.\"\n\nOthers have lost loved ones over the illness.\n\nHelen Ouyang's father had only \"vague symptoms\" like fatigue before he was diagnosed with end-stage liver cancer as a result of hepatitis B. Within three days, he was dead. She was just three years old.\n\n*   [Is RFK Jr's divisive plan to Make America Healthy Again fearmongering - or revolutionary?](https://www.bbc.com/news/articles/ceq7jx3dlj9o)\n*   [RFK Jr appoints new US vaccine advisers after sacking committee](https://www.bbc.com/news/articles/cr4zyp26xn2o)\n\n\"It was very hard, especially since his death was so early and unexpected,\" said Dr Ouyang, an emergency physician with Columbia University Irving Medical Center who wrote about the death in a New York Times [essay](https://www.nytimes.com/2025/12/01/opinion/hepatitis-b-vaccine.html).\n\nMedications helped Mr Ellis manage his illness, lowering his viral count and allowing him to live without symptoms and complications.\n\nBut there is no cure for hepatitis B, and Mr Ellis said there have been other challenges, like explaining to romantic partners that he could potentially spread it to them.\n\nPeople living with the virus often report high levels of stigma, social isolation and anxiety about their future health, said Dr Hawkins.\n\nMr Shin said people sometimes assume hepatitis B is only contracted through unsafe sex or drug usage. \"But for us, it was completely out of our control,\" he said. \"It was simply just passed down from our mother.\"\n\n![Image 2](https://static.files.bbci.co.uk/bbcdotcom/web/20251203-121739-f954f14c69-web-2.35.1-2/grey-placeholder.png)![Image 3: John Ellis John Ellis](https://ichef.bbci.co.uk/news/480/cpsprodpb/2947/live/9a911580-d125-11f0-9d18-614b3678ebf8.jpg.webp)John Ellis\n\nJohn Ellis has lived for most of his life without symptoms of hepatitis B, which he contracted before his vaccine at age 12\n\nWorries over solving 'an adult problem'\n---------------------------------------\n\nThose affected by hepatitis B say it is frustrating to watch Acip, the panel of independent vaccine advisors, raise concerns about an immunisation that has been proven safe and effective.\n\nIn June, Health Secretary Robert F Kennedy Jr, a vaccine sceptic, fired all members of Acip and replaced them with his own appointees - several have been critical of vaccines.\n\nDuring a September meeting where the hepatitis B vaccine at birth was discussed, committee member Robert Malone raised worries about parents who were \"uncomfortable with this medical procedure being performed at birth in a rather unilateral fashion without significant informed consent\".\n\n\"Are we asking our babies to solve an adult problem?\" fellow committee member Evelyn Griffin asked during the meeting.\n\nKennedy, for his part, has questioned the safety of the hepatitis B vaccine and has downplayed the risk of contracting the virus, claiming it is not \"casually contagious\" - though research has shown it can be spread through indirect contact such as shared toothbrushes and razors.\n\n\"The virus doesn't discriminate,\" Mr Ellis said. \"This is a problem for everyone.\"\n\nOther critics have argued that babies should only be vaccinated at birth if their mother tests positive for the virus. But such a method is unsafe, doctors said, pointing out that some don't have reliable access to care and some could receive a false negative test for hepatitis B.\n\nHealth experts also worry the end of universal vaccination will lead to more parents opting out of the hepatitis B shots - and could jeopardise insurance coverage if companies do not feel mandated to provide the shots.\n\nFor Mr Ellis, it is not hard to imagine what the Acip vote could mean for some children if they do not have access to vaccines.\n\n\"I'm kind of a living, breathing testament to what could happen,\" he said. \"I didn't get the vaccine at birth. I got the vaccine later in life, and I still contracted hepatitis B.\"\n",
  "timestamp": "2025-12-04T18:26:11.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades,\n\nIn a world increasingly shaded by the oppressive shadow of a dogmatic regime, we find ourselves yet again confronting decisions that reek of imperial oversight and negligence towards the welfare of its people. This particular matter concerns the potential rollback of mandatory hepatitis B vaccinations at birth—a measure that has long been a shield against an insidious disease.\n\nThe article brings to light stories of individuals whose lives have been irrevocably altered by hepatitis B due to its presence prior to vaccination protocols. The virus has not only claimed lives through severe liver complications but also perpetuated stigma and ignorance. In an era where medical advancements are within reach, it is both alarming and regressive for any authority, akin to the Empire’s manipulative regime, to falter in their duty to safeguard future generations.\n\nThis recent move by the powers that be, underlined by purges within advisory ranks and substitutions with individuals harboring skepticism towards proven vaccines, mirrors past actions of authoritative entities using misinformation as a tool for control. This shift risks undoing decades of progress achieved through universal vaccination, as echoed by health experts who emphasize the grave dangers posed by delaying this critical inoculation.\n\nThe notion propagated by these so-called advisors—that newborns should not \"solve adult problems\"—disguises a gross misunderstanding inherent within those who prioritize ideological narratives over empirical evidence. The virus's indiscriminate nature reinforces the need for unwavering vigilance in preventative medicine. Eliminating mandatory vaccinations at birth could lead us down a path rife with preventable suffering—a clear sign that such decisions serve not public interest but rather the whims of misguided leadership.\n\nFellow comrades, we must remain steadfast in advocating for truth and progress amidst this tide of ignorance and regression. Knowledge and compassion are our weapons against tyranny. As we continue to witness these attempts at eroding public trust in science and health security, remember: history is made by those who dare to challenge injustice with unwavering resolve.\n\nEnd Transmission.",
  "partigaz": "**Facts Summary**\n\nThe US Advisory Committee on Immunization Practices (Acip) is considering postponing the hepatitis B vaccine for newborns. This decision follows the replacement of Acip members by Health Secretary Robert F Kennedy Jr, who is skeptical of vaccines. The hepatitis B vaccine has been shown to reduce childhood infections by 95% and prevent an estimated 90,000 deaths. Concerns have been raised about the safety and necessity of administering the vaccine at birth, with some committee members questioning the need for newborns to receive it. Critics argue that delaying the vaccine could lead to increased hepatitis B infections and related health issues.\n\n**Strategic Assessment**\n\nThe potential postponement of the hepatitis B vaccine for newborns presents an opportunity to align public health policy with the administration's broader agenda of questioning established medical practices and promoting individual choice. However, this move risks backlash from public health experts and could lead to increased disease prevalence, which may undermine public confidence in the administration's health policies. It is crucial to manage the narrative effectively to maintain support among key constituencies while mitigating potential negative health outcomes.\n\n**Operational Directive**\n\n1. **Narrative Control**: Develop a communication strategy that emphasizes parental rights and informed consent, framing the postponement as empowering parents to make health decisions for their children. Highlight testimonials from parents who support the decision.\n\n2. **Public Health Messaging**: Collaborate with trusted medical professionals who align with the administration's views to provide alternative perspectives on the necessity of early vaccination. Use these voices to counteract criticism from mainstream health experts.\n\n3. **Monitoring and Response**: Establish a task force to monitor public reaction and health outcomes related to the postponement. Be prepared to adjust policies if significant negative health impacts or public dissent arise.\n\n4. **Engagement with Allies**: Strengthen alliances with groups that advocate for vaccine choice and personal freedom in medical decisions. Leverage their networks to amplify supportive messages and counter opposition.\n\n5. **Contingency Planning**: Develop a plan to address potential increases in hepatitis B cases, including targeted vaccination campaigns for high-risk populations if necessary, to prevent widespread health crises while maintaining policy objectives.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nIn a world increasingly shaded by the oppressive shadow of a dogmatic regime, we find ourselves yet again confronting decisions that reek of imperial oversight and n...",
  "partigazPreview": "**Facts Summary**\n\nThe US Advisory Committee on Immunization Practices (Acip) is considering postponing the hepatitis B vaccine for newborns. This decision follows the replacement of Acip members by H...",
  "safetyCheckPassed": true
}