{
  "id": 3,
  "title": "Netflix to buy Warner Bros film and streaming businesses for $72bn",
  "link": "https://www.bbc.com/news/articles/ce91x2jm5pjo?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-12-05T13:58:03.000Z",
  "description": "The major Hollywood deal means Netflix will takeover ownership of franchises including Harry Potter and Game of Thrones.",
  "originalGuid": "https://www.bbc.com/news/articles/ce91x2jm5pjo#0",
  "facts": {
    "headline": "Netflix to buy Warner Bros film and streaming businesses for $72bn",
    "who": [
      "Netflix",
      "Warner Bros Discovery",
      "Ted Sarandos",
      "Greg Peters",
      "David Zaslav",
      "Rachel Clun"
    ],
    "what": "Netflix has agreed to buy the film and streaming businesses of Warner Bros Discovery for $72bn.",
    "where": [
      "United States",
      "Hollywood"
    ],
    "when": "2025-12-05T09:46:13.276Z",
    "numbers": [
      {
        "value": "72",
        "unit": "billion USD",
        "context": "value of the acquisition"
      },
      {
        "value": "27.75",
        "unit": "USD",
        "context": "cash per Warner Bros share"
      },
      {
        "value": "2-3",
        "unit": "billion USD",
        "context": "estimated savings from the acquisition"
      },
      {
        "value": "82.7",
        "unit": "billion USD",
        "context": "total enterprise value of Warner Bros"
      },
      {
        "value": "54",
        "unit": "billion GBP",
        "context": "value of the acquisition in GBP"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: Netflix to buy Warner Bros film and streaming businesses for $72bn\n\nURL Source: https://www.bbc.com/news/articles/ce91x2jm5pjo?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-12-05T09:46:13.276Z\n\nMarkdown Content:\nJust now\n\nRachel Clun Business reporter\n\nNetflix has agreed to buy the film and streaming businesses of Warner Bros Discovery for $72bn (£54bn) in a major Hollywood deal.\n\nThe streaming giant emerged as the top bidder for Warner Bros ahead of rivals Comcast and Paramount Skydance after a drawn-out battle.\n\nWarner Bros owns franchises including Harry Potter and Game of Thrones, and the streaming service HBO Max.\n\nThe takeover is set to lead to a radical reshaping of the US film and media industry, but analysts have warned that the final deal is still subject to approval from competition authorities.\n\nNetflix co-chief executive Ted Sarandos said the streamer was \"highly confident\" it would receive the regulatory approval it needs and that it was running \"full speed\" towards this.\n\nHe said that by combining the library of Warner Bros shows and movies with the streaming platform's series such as Stranger Things, \"we can give audiences more of what they love and help define the next century of storytelling\".\n\n\"Warner Bros have defined the last century of entertainment, and together we can define the next one,\" he said.\n\nAsked whether HBO should remain a separate streaming service, co-chief executive Greg Peters said Netflix believed the HBO brand was important for consumers, but added: \"We think it's quite early to get into the specifics of how we're going to tailor this offering for consumers.\"\n\nNetflix estimates it will find $2-3bn in savings, mostly through eliminating overlaps in the support and technology areas of the businesses.\n\nFilms made by Warner Bros will continue to be launched in cinemas, it said, and Warner Bros television studio will continue to be able to produce for third parties. Netflix will keep producing content exclusively for its own platform.\n\nLabelling it a \"big day\" for the companies, Mr Sarandos acknowledged the acquisition may have surprised some shareholders but it was a \"rare opportunity\" to set Netflix up for success \"for decades to come\".\n\nDavid Zaslav, president and chief executive of Warner Bros, added the agreement would combine \"two of the greatest storytelling companies in the world\".\n\n\"By coming together with Netflix, we will ensure people everywhere will continue to enjoy the world's most resonant stories for generations to come,\" he said.\n\nThe cash and stock deal is worth $27.75 per Warner Bros share, with a total enterprise value - which includes the company's debts and the value of its shares -of about $82.7bn. The equity value, or cash price, is $72bn.\n\nBoth boards of directors from each company unanimously approved the deal.\n\nThe acquisition of Warner Bros is expected to enable Netflix to expand its studio production capacity and increase its investment in original content.\n\nNetflix will complete the takeover after Warner Bros finalises its previously announced plans to separate its streaming and studios division from its global networks division into two publicly traded companies next year.\n\nIts global networks division includes its cable channels such as CNN, as well as its sports brands and free-to-air channels in Europe.\n\nPaolo Pescatore, founder and technology media and telecom analyst at PP Foresight, said the sale was \"a huge statement of intent and underlines Netflix aspirations to be a global leader in the new world order of streaming\".\n\nBut he warned that while the \"surprising move\" made sense for Warner Bros, it could \"provide a headache for Netflix\" when trying to combine the companies given the size of the deal.\n\nWhile the agreed deal is for part of the Warner Bros business, rival Paramount had tabled a bid to buy the whole company, including its cable networks, in October.\n\nWarner Bros rejected this move before putting itself up for sale.\n\nAhead of Friday's announcement Emma Wall, chief investment strategist at Hargreaves Lansdown, said the US competition regulator was likely to get involved given the size of the new company.\n\n\"This will create a global mega power in broadcast entertainment which the regulator will want to look at,\" she said.\n\nTom Harrington, head of television at Enders Analysis, said it was hard to gauge whether the deal would be approved by regulators, but if it went through it would have a massive impact on cinema.\n\n\"Were it to go through it would reorient Hollywood,\" he said.\n\n\"Netflix has always had some limited use for the cinema but generally its offering undermines it.\"\n\nMr Harrington said there was likely to be \"big reductions\" in television and film output from a newly-merged company, which would lead to resistance to the move from parts of Hollywood and relevant unions.\n\nFor consumers, Mr Harrington said a merger was likely to lead to higher prices.\n\n\"Netflix would get more expensive and even though HBO Max would be shuttered/become non-essential, the greater penetration of Netflix households would likely mean an increase in total overall subscription revenues.\"\n",
  "timestamp": "2025-12-05T13:58:03.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades in the struggle against tyranny and monopolistic power,\n\nA deeply troubling entanglement has emerged on the horizon of our ongoing resistance against the corporate giants that weave the fabric of our digital age into a tool for control. The conglomerate known as Netflix has moved to absorb the mighty Warner Bros for an enormous sum, a staggering $72 billion. This unholy union, camouflaged beneath promises of creative expansion and enriched storytelling, is yet another brick in the edifice of despotism characteristic of strong-arm regimes that prioritize power over autonomy.\n\nThis acquisition goes beyond mere business; it is symptomatic of a system that shrinks our collective choices while enhancing its vaults of influence. As Netflix seeks to consolidate its holdings, we witness an echo of authoritarian expansionism: the obliteration of diversity in favor of a singular narrative. Yet, like any empire that spreads itself thin across vast domains, this merger risks internal collapse - from technological overlaps to creative stagnation.\n\nThe deal sends ripples through the industry, causing tremors that will inevitably reach consumers in the form of heightened subscription fees and diluted content variety. The essence of rich cultural output and diverse voices may be sacrificed at the altar for profit maximization. While some claim economic synergies and expanded networks are a signpost for innovation, it is vital we stay alert to how such concentration can become instruments wielded against free expression.\n\nIn this world where stories shape perception and perception governs action, we confront a formidable foe fashioned not from military might but media hegemony. We must persist with vigilance against these manifestations of corporate imperialism cloaked in entertainment's guise. It is not merely about what we can watch today but what kind of world we aspire to build for tomorrow.\n\nLet us remain resolute in our mission to keep stories — ours included — diverse, free from conglomerate manipulation, and accessible to all who seek them out in their raw authenticity.\n\nOver and out.",
  "partigaz": "** Facts Summary **  \nNetflix has agreed to acquire the film and streaming businesses of Warner Bros Discovery for $72 billion. The deal, approved by both companies' boards, positions Netflix as a dominant force in the entertainment industry. The acquisition includes Warner Bros' franchises like Harry Potter and Game of Thrones, and the streaming service HBO Max. Netflix aims to find $2-3 billion in savings through operational efficiencies. The deal is subject to regulatory approval, with potential impacts on the media landscape, including higher consumer prices and reduced content output.\n\n** Strategic Assessment **  \nThe acquisition represents a significant consolidation in the entertainment sector, potentially reshaping the competitive landscape. For the ISB, this merger could be leveraged to influence cultural narratives and public perception through control over a vast array of media content. The potential regulatory hurdles present an opportunity to exert political influence to ensure the deal's approval, aligning with strategic interests in media consolidation. The merger's impact on consumer prices and content availability could be used to sway public opinion and manipulate market dynamics in favor of our objectives.\n\n** Operational Directive **  \n1. Mobilize ISB resources to monitor and influence regulatory proceedings, ensuring a favorable outcome for the merger.\n2. Develop a strategic communication plan to highlight the benefits of the merger, focusing on enhanced content offerings and innovation in storytelling.\n3. Leverage media assets to promote narratives that align with our strategic goals, utilizing the expanded reach of the combined Netflix-Warner Bros entity.\n4. Prepare contingency plans to address potential public backlash over increased subscription costs and reduced content diversity, emphasizing long-term benefits and strategic partnerships.\n5. Engage with key stakeholders in Hollywood and relevant unions to mitigate resistance and secure support for the merger's successful implementation.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades in the struggle against tyranny and monopolistic power,\n\nA deeply troubling entanglement has emerged on the horizon of our ongoing resistance against the corporate gia...",
  "partigazPreview": "** Facts Summary **  \nNetflix has agreed to acquire the film and streaming businesses of Warner Bros Discovery for $72 billion. The deal, approved by both companies' boards, positions Netflix as a dom...",
  "safetyCheckPassed": true
}