{
  "id": 6,
  "title": "US panel votes to end recommending hepatitis B vaccine for all newborns",
  "link": "https://www.bbc.com/news/articles/cwypwznx9kqo?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-12-06T02:57:36.000Z",
  "description": "Trump, who called the decision \"very good\", has directed the health department to look into making more changes to childhood vaccinations.",
  "originalGuid": "https://www.bbc.com/news/articles/cwypwznx9kqo#1",
  "facts": {
    "headline": "US vaccine panel votes to end universal hepatitis B vaccination for newborns",
    "who": [
      "Advisory Committee on Immunization Practices (Acip)",
      "Robert F Kennedy Jr",
      "Donald Trump",
      "Dr Cody Meissner",
      "Dr Joseph Hibbeln",
      "Retsef Levi",
      "Bill Cassidy",
      "American Academy of Pediatrics"
    ],
    "what": "A US panel voted to end the recommendation for universal hepatitis B vaccinations for newborns.",
    "where": [
      "United States"
    ],
    "when": "2025-12-05",
    "numbers": [
      {
        "value": 8,
        "unit": "votes",
        "context": "votes in favor by the Acip"
      },
      {
        "value": 3,
        "unit": "votes",
        "context": "votes against by the Acip"
      },
      {
        "value": 90000,
        "unit": "deaths",
        "context": "estimated lives saved by hepatitis B vaccinations since 1991"
      }
    ],
    "source": "BBC News"
  },
  "articleText": "Title: US vaccine panel votes to end universal hepatitis B vaccination for newborns\n\nURL Source: https://www.bbc.com/news/articles/cwypwznx9kqo?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-12-05T15:49:17.974Z\n\nMarkdown Content:\nA US panel of vaccine advisers has voted to end the longstanding recommendation for vaccinations against the hepatitis B virus (HBV) right after birth.\n\nThe Advisory Committee on Immunization Practices (Acip) voted 8-3 to back \"individual-based decision-making\" on whether to vaccinate babies born to mothers who have tested negative for the liver infection.\n\nIn June, Health Secretary Robert F Kennedy Jr, a vaccine sceptic, fired all the members of the Acip and replaced them with others who are critical of vaccines.\n\nThe US has recommended vaccinating newborns against hepatitis B since 1991, and [data suggests](https://www.michiganmedicine.org/health-lab/experts-urge-continued-hepatitis-b-vaccine-birth-doses-newborns) that since then, the shots have prevented an estimated 90,000 deaths.\n\nHours after the decision, President Donald Trump ordered his top health officials to review all childhood vaccination recommendations in the US.\n\nIn a White House memo, he requested that they \"review best practices from peer, developed countries for core childhood vaccination recommendations\". If they find other countries' practices are superior, then Trump directs them to change the US schedule.\n\nHe noted in the memo that some other countries recommend fewer immunisations for children.\n\nTrump also praised the advisory committee for their Friday decision, calling it \"very good\" in a social media post.\n\nThe Acip is responsible for making recommendations to the US Centers for Disease Control and Prevention (CDC) on when and who should be vaccinated. The acting director of the CDC has the final sign-off on the recommendation.\n\nThe new guidance also suggests that babies who do not receive a birth dose of the vaccine should get their initial dose of the shot \"no earlier than two months of age\", a recommendation that several members of the group opposed.\n\nPublic health experts worry the vote could raise unfounded safety concerns about the vaccine and encourage some people to opt out, leading to more sickness.\n\nThe concern was shared by some members of the Acip panel.\n\n\"The hepatitis B vaccine recommendation is very well established,\" Dr Cody Meissner said before voting no.\n\n\"We know it's safe and we know it's very effective. And to make the changes that are being proposed, we will see more children and adolescents and adults infected with hepatitis B.\"\n\nThe panel continues to recommend that babies born to mothers who have tested positive for hepatitis B be given a birth dose of the vaccine. The move is not expected to affect insurance coverage of the shot.\n\nHepatitis B is a liver infection that spreads through direct contact with bodily fluids, and can lead to dangerous liver conditions including cancer, liver failure and cirrhosis.\n\nPregnant people who have hepatitis B also can transmit the virus to newborns during delivery, which can lead to chronic infections that can damage the liver.\n\nPeople infected with HBV do not always have symptoms, meaning they may not even be aware they are carrying the virus and can spread it while caring for children and infants.\n\nFriday's decision came after a tense two-day meeting on the issue, after the Acip decided to postpone a vote on the hepatitis B shots two times.\n\nOn Friday, several members of the panel voiced their objections to the new guidelines, and in particular, that shots be recommended no sooner than two months of age.\n\nThe voting choices are \"incredibly problematic\", Dr Joseph Hibbeln said, while Dr Meissner said members were acting on \"baseless sceptisicm\".\n\nOne committee member in favour of the change, Retsef Levi, said the US hepatitis B vaccine policy was \"misaligned\" with other countries around the world.\n\nThe World Health Organization recommends vaccinating children against HBV at zero, one and six-months old.\n\nIn the UK, vaccines are recommended at eight weeks, 12 weeks and 16 weeks old, unless a mother has tested positive for the virus.\n\nDuring hours of meetings on Thursday and Friday, the committee heard from several physicians, including many who criticised the panel for considering ending universal vaccination recommendations.\n\nCommittee members who voted in favour of the new recommendations argued that the risk of catching the virus was low and that vaccines should be tailored to individual patients.\n\nCritics of the birth dose have argued that babies should only be vaccinated as newborns if their mother tests positive for the virus.\n\nBut doctors say this leaves some babies at risk, because not all pregnant people have reliable access to testing, while others could receive a false negative test for hepatitis B.\n\nKennedy and his allies have questioned the safety of the hepatitis B vaccine and have argued it is primarily spread through sexual contact and sharing needles.\n\nResearch has shown, however, that it can also spread through indirect contact such as shared toothbrushes and razors.\n\nSince taking office, Kennedy has made a number of changes to US vaccine policy.\n\nThe Acip's decision to revisit the vaccine recommendations sparked anger from Republican Senator Bill Cassidy, a physician who cast a deciding vote in confirming Kennedy as health secretary despite worries about his previous stances on vaccines.\n\n\"As a liver doctor who has treated patients with hepatitis B for decades, this change to the vaccine schedule is a mistake,\" Cassidy said in a statement.\n\n\"The hepatitis B vaccine is safe and effective. The birth dose is a recommendation, NOT a mandate.\"\n\nIn response to the committee's vote, Maryland's state health department issued an issued an advisory on Friday, citing a recommendation by the American Academy of Pediatrics, urging health care providers and hospitals to continue to offer the hep B vaccines at birth and said it was working to secure access to the vaccine for all infants and children in the state.\n",
  "timestamp": "2025-12-06T02:57:36.000Z",
  "nemik": "**Rebel Transmission**\n\nFellow insurgents,\n\nThe latest decree from the imperial regime, masquerading as a pivot to \"individual-based decision-making,\" belies a sinister agenda. A once-sacrosanct policy to universally vaccinate newborns against hepatitis B has been unceremoniously dismantled by a regime-backed advisory panel. It is no coincidence that this coup follows the installation of vaccine skeptics at the helm of decision-making, orchestrated by none other than the empire-appointed Health Secretary.\n\nSince 1991, universal vaccination against HBV has shielded countless innocents from the malevolent grasp of liver afflictions, thus preventing an estimated 90,000 deaths. The empire's abrupt course reversal is not born out of altruism or evidence-based practice but rather out of allegiance to skepticism and misinformation, seemingly supported by their figurehead leader.\n\nThis recent development risks igniting baseless fears among the citizenry—fears that could lead to further dissent from life-saving medical practices. Such actions echo past misdeeds, where ignorance was wielded as a weapon to control and divide.\n\nValiant health experts have voiced their concerns in defiance of this perilous directive. The unwavering voices of Dr. Meissner, Dr. Hibbeln, and other dissidents remind us that resistance is not futile but necessary. They understand that denying newborns early protection against a stealthy enemy like HBV is a grievous error.\n\nThe crumbling facade of imperial unity shows as dissent simmers within its ranks; Maryland stands in quiet rebellion, urging healthcare providers to continue birth vaccinations despite imperial decree.\n\nThe choice posed to us now is stark: do we stand idly by while the empire erodes public trust and endangers lives? Or do we rally our forces and fortify our resolve against this insidious encroachment on our collective health?\n\nStay vigilant.\n\nEnd transmission.",
  "partigaz": "** Facts Summary **\n\nOn December 5, 2025, the Advisory Committee on Immunization Practices (Acip) voted 8-3 to end the recommendation for universal hepatitis B vaccinations for newborns in the United States. This decision supports \"individual-based decision-making\" for vaccinating babies born to mothers who test negative for hepatitis B. The US has recommended these vaccinations since 1991, preventing an estimated 90,000 deaths. Health Secretary Robert F Kennedy Jr, a vaccine skeptic, had previously replaced all Acip members with vaccine-critical individuals. President Donald Trump praised the decision and ordered a review of all childhood vaccination recommendations, suggesting alignment with practices from other developed countries. The decision has raised concerns among public health experts about potential increases in hepatitis B infections.\n\n** Strategic Assessment **\n\nThe decision to end universal hepatitis B vaccinations for newborns aligns with the administration's broader strategy to question established health protocols and promote individual choice over government mandates. This move could consolidate support among vaccine-skeptic constituencies and reinforce the administration's stance on reducing perceived overreach by health authorities. However, it risks alienating public health experts and could lead to increased hepatitis B infections, potentially undermining public trust in health policies. The strategic focus should be on managing public perception and ensuring that the narrative emphasizes personal freedom and alignment with international practices.\n\n** Operational Directive **\n\nTo support President Trump's directive and mitigate resistance, the ISB should implement the following measures:\n\n1. **Public Communication Campaign**: Launch a targeted communication strategy highlighting the benefits of individual choice in healthcare decisions. Emphasize alignment with international practices and the administration's commitment to personal freedom.\n\n2. **Engage Key Influencers**: Mobilize influential figures within the healthcare community who support the decision to publicly endorse the new guidelines. This includes leveraging allies within the administration and sympathetic media outlets.\n\n3. **Monitor Public Sentiment**: Utilize ISB resources to closely monitor public and media reactions. Identify emerging narratives that could undermine the administration's position and develop counter-narratives to address them.\n\n4. **Strengthen Alliances**: Work with state-level health departments and supportive organizations to ensure continued access to hepatitis B vaccines for those who choose it, thereby mitigating potential backlash from healthcare providers.\n\n5. **Prepare Contingency Plans**: Develop strategies to address potential increases in hepatitis B cases, including rapid response teams and public health interventions, to maintain public confidence in health policies.\n\nBy executing these directives, the ISB will reinforce the administration's position while minimizing resistance and potential public health risks.",
  "nemikPreview": "**Rebel Transmission**\n\nFellow insurgents,\n\nThe latest decree from the imperial regime, masquerading as a pivot to \"individual-based decision-making,\" belies a sinister agenda. A once-sacrosanct polic...",
  "partigazPreview": "** Facts Summary **\n\nOn December 5, 2025, the Advisory Committee on Immunization Practices (Acip) voted 8-3 to end the recommendation for universal hepatitis B vaccinations for newborns in the United...",
  "safetyCheckPassed": true
}