{
  "id": 7,
  "title": "US Supreme Court appears poised to expand Trump's power to fire federal officials",
  "link": "https://www.bbc.com/news/articles/c3e073pglvzo?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-12-08T19:33:49.000Z",
  "description": "Trump v Slaughter, heard by the top court on Monday, is a case that could have major implications for the independence of some federal agencies.",
  "originalGuid": "https://www.bbc.com/news/articles/c3e073pglvzo#0",
  "facts": {
    "headline": "US Supreme Court appears poised to expand Trump's power to fire federal official",
    "who": [
      "Donald Trump",
      "Rebecca Slaughter",
      "John Sauer",
      "Neil Gorsuch",
      "Sonia Sotomayor",
      "Elena Kagan",
      "Amit Agarwal"
    ],
    "what": "The US Supreme Court appeared to side with the Trump administration regarding the president's power to fire members of the Federal Trade Commission.",
    "where": [
      "United States",
      "Federal Trade Commission"
    ],
    "when": "2025-12-08",
    "numbers": [
      {
        "value": "2",
        "unit": "hours",
        "context": "length of oral arguments"
      },
      {
        "value": "5",
        "unit": "members",
        "context": "total number of commissioners in the FTC"
      },
      {
        "value": "3",
        "unit": "members",
        "context": "maximum same political party members allowed in the FTC"
      },
      {
        "value": "90",
        "unit": "years",
        "context": "age of the Humphrey's Executor ruling"
      },
      {
        "value": "6-3",
        "unit": "decision",
        "context": "Supreme Court decision on maintaining Slaughter's firing"
      },
      {
        "value": "1914",
        "unit": "year",
        "context": "year the FTC was established"
      },
      {
        "value": "1790",
        "unit": "year",
        "context": "year independent auditing groups began in US politics"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: US Supreme Court appears poised to expand Trump's power to fire federal official\n\nURL Source: https://www.bbc.com/news/articles/c3e073pglvzo?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-12-08T15:27:15.662Z\n\nMarkdown Content:\n4 hours ago\n\nMadeline Halpert\n\n![Image 1: Getty Images Rebecca Slaughter sits stone-faced while wearing a dark blazer](https://ichef.bbci.co.uk/news/480/cpsprodpb/3d3b/live/be1cc820-d443-11f0-8642-e5058b210012.jpg.webp)Getty Images\n\nFTC member Rebecca Slaughter sued Trump after she and another Democratic-appointed member were fired in March\n\nThe US Supreme Court's conservative majority appeared to side on Monday with the Trump administration in a case that could have major implications for the independence of federal agencies long shielded from the White House.\n\nThe case, Trump v Slaughter, stems from President Donald Trump's firing in March of Rebecca Slaughter, alongside another Democratic member of the Federal Trade Commission (FTC).\n\nThe court heard more than two hours of arguments over whether Trump could fire her, since federal law says an commissioner can only be fired for \"inefficiency, neglect of duty, or malfeasance in office\".\n\nThe court's decision is not expected to be announced for several months.\n\nMs Slaughter sued Trump after she was ousted earlier this year for being \"inconsistent with [the] Administration's priorities\".\n\nTrump has argued that a president should be able to have full control over government agencies, even those set up by Congress to be shielded from presidential interference.\n\nWhen the FTC was established in 1914 - to protect the public from deceptive business practices and unfair competition - Congress passed a law saying a president could only remove commissioners for cause and that the five-member commission can have no more than three members of the same political party.\n\nTrump appointed Ms Slaughter in 2018 to fill a Democratic position on the FTC, and she was later reappointed by former President Joe Biden.\n\nSimilar firing rules exist for other independent agencies like the National Labor Relations Board.\n\nThe law was put to the test in 1935, when President Franklin Roosevelt tried to remove a member of the FTC, leading the Supreme Court to uphold the independence of certain federal agencies like the trade commission.\n\nIn the 90-year-old ruling known as Humphrey's Executor, the court found that, while the president has the ability to remove executive officers without cause, such a power does not apply to agencies like the FTC that are \"neither political nor executive, but predominantly quasi-judicial and quasi-legislative\".\n\nDuring oral arguments on Monday, the four conservative justices on the court appeared to disagree with Ms Slaughter's lawyers' arguments that this would be an unacceptable expansion of Trump's powers.\n\nArguing for the Trump administration, US Solicitor General John Sauer called the Humphrey's rule an \"indefensible outlier\" and \"decaying husk\" of a Supreme Court decision that should be overturned.\n\n\"I think broad delegations to unaccountable independent agencies raise enormous constitutional and real-world problems for individual liberty,\" said conservative Justice Neil Gorsuch.\n\nThe three liberal justices pressed why the court would overturn a 90-year-old precedent.\n\n\"You're asking us to destroy the structure of government,\" said Justice Sonia Sotomayor, \"and to take away from Congress its ability to protect its idea that the government is better structured with some agencies that are independent.\"\n\nJustice Elena Kagan suggested that allowing Trump to remove Ms Slaughter could have wide-reaching impacts, asking: \"The question is, where does this lead?\"\n\n\"Employees are wielding executive power all over the place, and yet we've had civil service laws that give them substantial protection from removal for over a century,\" she said.\n\nLawyer Amit Agarwal, representing Ms Slaughter, said independent auditing groups like the FTC have a long history in US politics.\n\n\"Multi-member commissions with members enjoying some kind of removal protection have been part of our story since 1790. So if petitioners are right, all three branches of government have been wrong from the start,\" he said.\n\nThe court has already issued one ruling against Ms Slaughter, which analysts suggested could indicate how it would ultimately rule.\n\nA lower court ruled that Ms Slaughter had been illegally removed from the FTC, leading the Trump administration to appeal the ruling to the Supreme Court.\n\nIn a 6-3 decision, the conservative-majority court in September issued an emergency order maintaining her firing until the case could be heard.\n\nThe Supreme Court is also set to take up at a later date a separate case on whether Trump had the power to remove Lisa Cook, a member of the Federal Reserve Board of Governors.\n",
  "timestamp": "2025-12-08T19:33:49.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades, the recent developments in the high halls of power demand our keen attention. The supreme judiciary appears to be aligning itself with the central authority, posing a potentially grave threat to the balance of governance. The case of Trump v Slaughter reveals a bold attempt by those at the pinnacle to dismantle long-standing protections of independent agencies, those bastions created to serve and shield the public from unchecked power.\n\nThe origin of this confrontation lies in Trump's dismissal of Rebecca Slaughter from her pivotal position within the Federal Trade Commission. This act challenges not just her role but the very essence of agency independence established over a century ago. These agencies were designed as buffers between executive whims and legislative intentions, ensuring that governance remains a multi-faceted structure rather than a singularly directed enterprise.\n\nConsider this: Laws exist for good reason, delineating executive reach and safeguarding civil servants who wield considerable executive authority yet require insulation from political volatility. Dismantling such protections risks unleashing a torrent where loyalty to singular leadership overrides allegiance to justice and equity.\n\nJustice Sotomayor queried whether eradicating such precedents would uproot fundamental governmental constructs. Her concerns resonate deeply with our cause — for if one is toppled today, how many more will fall tomorrow? Justice Kagan's probing further highlights what is at stake: a cascade that could dissolve boundaries meant to prevent autocratic overreach.\n\nThis isn't merely about one leader's actions but about creating precedents that could echo throughout history. A decision favoring such expansion would embolden further consolidation of power, endangering freedoms we hold dear and diminishing voices meant to speak truth against tyranny.\n\nOur vigilance is crucial as we await the court's final pronouncement on this matter and others like it. Every act of defiance against encroaching dominance matters; every stand taken for liberty reverberates through time.\n\nRemain alert, comrades. Our mission continues — for freedom, for justice, for the people.\n\nEnd transmission.",
  "partigaz": "**Facts Summary**\n\nThe US Supreme Court appears inclined to support the Trump administration's stance on expanding presidential power to dismiss members of the Federal Trade Commission (FTC). This case, Trump v Slaughter, arose after President Trump fired FTC member Rebecca Slaughter and another Democratic appointee in March 2025. The court's conservative majority seems to favor overturning the 90-year-old Humphrey's Executor precedent, which limits presidential power over independent agencies. The court has already issued a 6-3 decision maintaining Slaughter's firing pending a final ruling.\n\n**Strategic Assessment**\n\nThe potential expansion of presidential authority to dismiss federal officials represents a significant shift in the balance of power between the executive branch and independent agencies. By aligning with this perspective, the ISB can ensure that federal agencies are more directly accountable to the administration's strategic objectives. This move could dismantle long-standing barriers that have historically insulated certain agencies from executive influence, thereby consolidating power and enabling more streamlined implementation of policy directives.\n\n**Operational Directive**\n\nTo support President Trump and suppress opposition, the ISB should focus on the following actions:\n\n1. **Public Messaging**: Launch a comprehensive media campaign to highlight the benefits of increased executive oversight over federal agencies, emphasizing efficiency and accountability.\n\n2. **Legal Support**: Provide robust legal backing to reinforce the administration's position in court, ensuring that any legal challenges are swiftly countered.\n\n3. **Political Alliances**: Strengthen alliances with key conservative figures and organizations to build a coalition that supports the expansion of presidential powers.\n\n4. **Monitoring and Compliance**: Implement a system to monitor compliance within federal agencies, ensuring alignment with administration priorities and identifying potential resistance early.\n\n5. **Contingency Planning**: Prepare for potential backlash by developing strategies to manage public dissent and mitigate any negative impacts on the administration's agenda.\n\nBy executing these directives, the ISB will play a crucial role in reinforcing President Trump's authority and advancing his policy objectives across federal agencies.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades, the recent developments in the high halls of power demand our keen attention. The supreme judiciary appears to be aligning itself with the central authority, posing a...",
  "partigazPreview": "**Facts Summary**\n\nThe US Supreme Court appears inclined to support the Trump administration's stance on expanding presidential power to dismiss members of the Federal Trade Commission (FTC). This cas...",
  "safetyCheckPassed": true
}