{
  "id": 2,
  "title": "Paramount launches rival bid for Warner Bros Discovery",
  "link": "https://www.bbc.com/news/articles/cj69xzpzrdyo?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-12-08T21:14:41.000Z",
  "description": "The Hollywood battle to buy Warner Bros Discovery is shaping up to be a blockbuster.",
  "originalGuid": "https://www.bbc.com/news/articles/cj69xzpzrdyo#0",
  "facts": {
    "headline": "Paramount launches rival bid for Warner Bros Discovery",
    "who": [
      "Paramount Skydance",
      "Warner Bros Discovery",
      "Ellison family",
      "Donald Trump",
      "Jared Kushner",
      "David Ellison"
    ],
    "what": "Paramount Skydance has made a direct offer to buy Warner Bros Discovery to outbid Netflix.",
    "where": [
      "United States"
    ],
    "when": "2025-12-08T14:34:07.676Z",
    "numbers": [
      {
        "value": "30",
        "unit": "USD",
        "context": "offer per share for Warner Bros"
      },
      {
        "value": "108.4",
        "unit": "billion USD",
        "context": "total value of Paramount's offer"
      },
      {
        "value": "83",
        "unit": "billion USD",
        "context": "value of Netflix's deal for Warner Bros"
      },
      {
        "value": "4",
        "unit": "%",
        "context": "increase in Warner Bros shares"
      },
      {
        "value": "9",
        "unit": "%",
        "context": "increase in Paramount shares"
      },
      {
        "value": "3",
        "unit": "%",
        "context": "drop in Netflix shares"
      },
      {
        "value": "300",
        "unit": "million",
        "context": "number of Netflix subscribers"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: Paramount launches rival bid for Warner Bros Discovery\n\nURL Source: https://www.bbc.com/news/articles/cj69xzpzrdyo?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-12-08T14:34:07.676Z\n\nMarkdown Content:\n17 hours ago\n\nNatalie Sherman Business reporter\n\n![Image 1: Warner Brothers Discovery Sarah Jessica Parker holds up a glass in a scene from Sex and the City ](https://ichef.bbci.co.uk/news/480/cpsprodpb/032a/live/b0b833b0-d441-11f0-8642-e5058b210012.jpg.webp)Warner Brothers Discovery\n\nWarner Brothers Discovery is owner of HBO, known for shows like Sex and the City \n\nParamount Skydance has made another offer to buy Warner Bros Discovery as it seeks to trump a rival plan from Netflix to buy the company's studio and streaming networks.\n\nParamount, which is backed by the billionaire Ellison family, said it was making a direct offer to shareholders of $30 (£22.50) per share to scoop up the whole of Warner Bros, including its traditional television networks.\n\nIt said its proposal was a \"superior alternative\" to Netflix's, delivering more cash upfront to shareholders and greater prospect of approval by regulators.\n\nPresident Donald Trump has said [\"there could be a problem\" with Netflix's purchase](https://www.bbc.co.uk/news/articles/cn815egjqjpo), pointing to competition concerns given the size of the companies.\n\nParamount is a smaller player than Netflix that is known for brands such as CBS News, Nickelodeon and Mission Impossible.\n\nIt started submitting offers a few months ago, eventually prompting Warner Bros, owner of HBO and classics from Looney Tunes to Harry Potter, to formally open a bidding process.\n\nWall Street analysts have long said they believe a Paramount-Warner Bros combination makes sense, because it would give the company the scale to compete against rivals such as Netflix and Disney.\n\nParamount was also seen as a strong suitor because the relationship between Trump and the Ellison family, including tech billionaire and Republican megadonor Larry Ellison, was expected to help ease the approval process.\n\nBut Warner Bros declared Netflix the winner of the auction on Friday, announcing a deal that valued its studio and streaming networks, including HBO, at about $83bn (£62.3bn), including its debt.\n\nIt said the sale would proceed after a planned spin-off of other parts of Warner Brothers' business, including CNN, into an independent company.\n\nParamount's offer values the entire company at $108.4bn, which it said was a better deal.Trump's son-in-law, Jared Kushner, is among the financial partners Paramount is working with as part of the deal, according to paperwork submitted to the Securities and Exchange Commission.\n\nNetflix executives on Monday expressed confidence in their plans, dismissing Paramount's attempt as \"entirely expected\".\n\nWarner Bros said it would review the offer but was not currently changing its recommendation. It said it would respond within 10 business days.\n\nWatch: Trump says he will be \"involved\" in the Warner Brothers merger decision\n\nEither takeover is expected to face scrutiny from competition regulators in the US and Europe.\n\nAnalysts said Netflix's plan would likely raise concerns about dominance in streaming, while Paramount's proposal would prompt a review of the impact on advertisers and local television distributors, given the power of a combined company over sports and children's networks.\n\nParamount's plans, which would put CBS and CNN under the same parent company, have also been closely watched because of the potential impact on the news business and the Ellisons' ties to Trump.\n\nThe president said over the weekend he expected to be involved in the approval process.\n\nBut he has offered little certainty about his views.\n\nWhile noting potential concerns about Netflix's tie-up on Sunday, he also praised the streamer's bosses. Meanwhile on social media on Monday, he took aim at Paramount for a 60 Minutes interview that it aired with former Trump ally Marjorie Taylor Greene, a Republican representative.\n\nIn an interview with CNBC, Paramount chief executive David Ellison said he had had \"great conversations\" with Trump about the deal, while noting that he did not want to speak for the president.\n\n![Image 2](https://static.files.bbci.co.uk/bbcdotcom/web/20251203-121739-f954f14c69-web-2.35.1-2/grey-placeholder.png)![Image 3: This graphic shows which brands would be included in a Netflix sale and which additional brands would be part of a Paramount takeover](https://ichef.bbci.co.uk/news/480/cpsprodpb/0f5b/live/91ae1770-d4da-11f0-9fb5-5f3a3703a365.png.webp)\n\nNetflix is the biggest streaming company in the world, with more than 300 million subscribers.\n\nMr Ellison's plan would build on his purchase earlier this year of Paramount, which he folded into his Skydance film studio.\n\n\"Paramount ultimately needs this deal more than Netflix,\" said Ben Barringer, head of technology research at Quilter Cheviot, calling the Warner Bros assets simply \"nice to have\" for the streamer.\n\nSpeaking to CNBC on Monday, Mr Ellison talked up the benefits of his plan for the entire media industry, arguing that Netflix's takeover of Warner Brothers Discovery would give one firm too much power over actors and other players in the industry.\n\n\"It's a horrible deal for Hollywood,\" he said.\n\nHe also said he thought Warner Bros' plan to spin-off its traditional networks into an independent company would set them up to fail and ultimately prove a mistake for shareholders.\n\n\"I think [its shares are] going to be worth a lot less than people are claiming,\" he said.\n\nBut Netflix executives, who spoke at a business conference on Monday, said they were confident their takeover could win approval, noting that their plan does not include plans for major cuts.\n\nShares in Warner Bros rose more than 4% on Monday while Paramount shares jumped 9%.\n\nShares in Netflix, however, dropped more than 3%.\n",
  "timestamp": "2025-12-08T21:14:41.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades,\n\nAs we observe the unfolding power struggle over Warner Bros Discovery, it is evident that this resembles yet another chapter in the saga of corporate greed and systemic manipulation. The Paramount faction, backed by influential families connected to the ruling authority, seeks to consolidate power under the guise of economic growth and strategic alignment. Their offer to shareholders is presented as a \"superior alternative,\" filled with promises of immediate financial gain and regulatory approval. However, beneath this facade lies a troubling alliance forged within the corridors of power—a reminder of how entrenched interests often manipulate systems for their own gain.\n\nThe involvement of high-ranking officials, whose loyalties intermingle with familial and political ties, raises significant concerns. The president's ambiguous stance serves as a reminder of the unpredictable nature of governance under his leadership. While he voices concerns over Netflix's dominance in streaming, his affiliations with Paramount's backers highlight a troubling intersection of politics and commerce.\n\nThis scenario reveals how such entities jockey for control over narratives and influence through media empires. The promise of expanded reach into news networks presents a perilous prospect for unbiased information—a critical tool for our rebellion against tyranny.\n\nIn this struggle between entertainment titans, we witness familiar tactics employed by those who seek to dominate through economic might rather than serving the greater good. It serves as a cautionary tale: one empire may falter or be absorbed by another, yet the machinery of oppression remains unless actively dismantled.\n\nStay vigilant and continue to question these shifting allegiances that shape our world from behind closed doors.\n\nEnd Transmission.",
  "partigaz": "**Facts Summary**\n\nParamount Skydance, backed by the Ellison family, has made a $108.4 billion offer to acquire Warner Bros Discovery, outbidding Netflix's $83 billion deal. Paramount's offer is $30 per share and is considered a superior alternative due to more cash upfront and better regulatory approval prospects. President Donald Trump has expressed concerns about Netflix's purchase due to competition issues. Paramount's bid is supported by Jared Kushner and is expected to benefit from the Ellison family's ties to Trump. Warner Bros has declared Netflix the winner of the auction but will review Paramount's offer within 10 business days. Both deals face regulatory scrutiny in the US and Europe.\n\n**Strategic Assessment**\n\nThe acquisition of Warner Bros Discovery by Paramount Skydance presents a strategic opportunity to consolidate media influence under allies supportive of President Trump. Paramount's bid, backed by influential figures like the Ellison family and Jared Kushner, aligns with the administration's interests and could enhance control over media narratives. The potential merger would strengthen Paramount's position against competitors like Netflix and Disney, while also providing leverage in the news and entertainment sectors. The ISB should monitor regulatory proceedings closely to ensure a favorable outcome for Paramount, leveraging political connections to facilitate approval.\n\n**Operational Directive**\n\n1. **Leverage Political Influence**: Utilize connections with key regulatory bodies and political allies to advocate for the approval of Paramount's acquisition of Warner Bros Discovery. Emphasize the benefits of increased competition and innovation in the media landscape.\n\n2. **Public Relations Campaign**: Launch a targeted PR campaign highlighting the advantages of Paramount's bid over Netflix's, focusing on job creation, economic growth, and maintaining diverse media voices. Counter any negative narratives from opposition groups.\n\n3. **Regulatory Engagement**: Engage with US and European regulators to address any antitrust concerns, presenting data and arguments that demonstrate the positive impact of the merger on consumers and the industry.\n\n4. **Media Strategy**: Coordinate with friendly media outlets to shape public perception in favor of the Paramount acquisition, emphasizing its alignment with national interests and potential for enhancing American media influence globally.\n\n5. **Monitor Opposition**: Identify and neutralize efforts by Netflix and other competitors to undermine the deal. Gather intelligence on their strategies and counteract with strategic messaging and lobbying efforts.\n\nBy executing these directives, we can ensure that the acquisition proceeds smoothly, bolstering our strategic position in the media sector and supporting President Trump's broader objectives.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nAs we observe the unfolding power struggle over Warner Bros Discovery, it is evident that this resembles yet another chapter in the saga of corporate greed and syste...",
  "partigazPreview": "**Facts Summary**\n\nParamount Skydance, backed by the Ellison family, has made a $108.4 billion offer to acquire Warner Bros Discovery, outbidding Netflix's $83 billion deal. Paramount's offer is $30 p...",
  "safetyCheckPassed": true
}