{
  "id": 1,
  "title": "US could ask foreign tourists for five-year social media history before entry",
  "link": "https://www.bbc.com/news/articles/c1dz0g2ykpeo?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-12-10T16:48:56.000Z",
  "description": "The plan would affect people from countries, including the UK, who can fill out a form in lieu of a visa.",
  "originalGuid": "https://www.bbc.com/news/articles/c1dz0g2ykpeo#0",
  "facts": {
    "headline": "US could ask tourists for five-year social media history before entry",
    "who": [
      "President Donald Trump",
      "Customs and Border Protection (CBP)",
      "Department of Homeland Security (DHS)",
      "Sophia Cope"
    ],
    "what": "A proposal has been unveiled that may require tourists to provide a five-year social media history to enter the United States.",
    "where": [
      "United States",
      "UK",
      "Mexico",
      "Canada"
    ],
    "when": "2025-12-10",
    "numbers": [
      {
        "value": 40,
        "unit": "USD",
        "context": "one-off payment for ESTA"
      },
      {
        "value": 30,
        "unit": "GBP",
        "context": "one-off payment for ESTA"
      },
      {
        "value": 40,
        "unit": "countries",
        "context": "citizens eligible for ESTA"
      },
      {
        "value": 10,
        "unit": "months",
        "context": "continuous decline in Canadian travellers to the US"
      },
      {
        "value": 20,
        "unit": "billion USD",
        "context": "annual spending by Canadian visitors to the US"
      },
      {
        "value": 15.1,
        "unit": "billion GBP",
        "context": "annual spending by Canadian visitors to the US"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: US could ask tourists for five-year social media history before entry\n\nURL Source: https://www.bbc.com/news/articles/c1dz0g2ykpeo?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-12-10T11:25:54.300Z\n\nMarkdown Content:\nTourists from dozens of countries including the UK could be asked to provide a five-year social media history as a condition of entry to the United States, under a new proposal unveiled by American officials.\n\nThe new condition would affect people from dozens of countries who are eligible to visit the US for 90 days without a visa, as long as they have filled out an Electronic System for Travel Authorization (ESTA) form.\n\nSince returning to the White House in January, President Donald Trump has moved to toughen US borders more generally - citing national security as a key reason.\n\nAnalysts say the new plan could pose an obstacle to potential visitors, or harm their digital rights.\n\nThe US expects a major influx of foreign tourists next year, as it hosts the men's football World Cup alongside Canada and Mexico, and for the 2028 Olympics in Los Angeles.\n\nThe proposal document was filed by Customs and Border Protection (CBP) and the Department of Homeland Security (DHS), of which the agency is part.\n\nUS media reported that it appeared in the Federal Register, which is the official journal of the US government. The BBC has asked DHS for comment.\n\nThe proposal says \"the data element will require [ESTA applicants](https://esta.cbp.dhs.gov/) to provide their social media from the last 5 years\", without giving further details of which specific information will be required.\n\nThe existing ESTA requires a comparatively limited amount of information from travellers, as well as a one-off payment of $40 (£30). It is accessible to citizens of about 40 countries - including the UK, Ireland, France, Australia and Japan - and allows them to visit the US multiple times during a two-year period.\n\nAs well as the collection of social media information, the new document proposes the gathering of an applicant's telephone numbers and email addresses used over the last five and 10 years respectively, and more information about their family members.\n\nThe text cites an executive order from Trump in January, titled \"Protecting the United States From Foreign Terrorists and Other National Security and Public Safety Threats\".\n\nThe Trump administration previously announced it would examine social media accounts when vetting foreign nationals who apply for student visas or H1B visas for skilled workers.\n\nThe state department said it will conduct \"online presence\" reviews for applicants and their dependents, and that privacy settings on all social media profiles must be made \"public\" so this screening can take place.\n\nAn announcement on the website for the US Embassy and Consulate in Mexico states certain visa applicants must list all social media usernames or handles of every platform they have used in the last five years.\n\nIt warns that if any social media information is not listed, it could lead to both current and future visas being denied.\n\nA senior state department official said of the student visa policy: \"It is an expectation from American citizens that their government will make every effort to make our country safer, and that is exactly what the Trump Administration is doing every single day.\"\n\nOfficers were instructed to screen for those \"who advocate for, aid, or support designated foreign terrorists and other threats to national security; or who perpetrate unlawful anti-Semitic harassment or violence\".\n\nAs part of the administration's broader effort to toughen borders, officials recently said an existing travel ban - affecting 19 countries in Africa, the Middle East and the Caribbean - could soon be expanded.\n\nThat move was announced in the wake of a shooting attack on two National Guard members in Washington DC, in which an Afghan man has been named as the suspect.\n\nThe new proposal regarding ESTA data collection for tourists invites views from the public for 60 days.\n\nSophia Cope, of digital rights organisation the Electronic Frontier Foundation, criticised the plan, telling the New York Times that it could \"exacerbate civil liberties harms\".\n\nMeanwhile, immigration law practice Fragomen suggested there could be practical impacts as applicants could face longer waits for ESTA approvals.\n\nExperts have previously suggested that the changes to travel policies introduced under Trump have had an impact on the American tourism industry.\n\nEarlier this year, the World Travel & Tourism Council said the US was the only one of 184 economies that it analysed that was expected to see a decline in international visitor spending in 2025.\n\nOther Trump administration policies have also appeared to impact tourism to the country, such as many Canadians boycotting US travel as a form of protest against Trump's tariffs.\n\nOctober marked the 10th straight month of decline in the number of Canadian travellers to the US. In the past, Canadians have made up about a quarter of all international visitors to the US, spending more than $20bn (£15.1bn) a year, according to the US Travel Association.\n",
  "timestamp": "2025-12-10T16:48:56.000Z",
  "nemik": "**Rebel Transmission**\n\nIt is with weary vigilance that I relay this missive regarding the latest overreach by those who rule under the guise of protection. The recent declaration by the administration in power, henceforth referred to as the regime, to scrutinize five years of social media history for travelers seeking entry—a move veiled under the guise of bolstering national security—should be met with skepticism and resistance.\n\nThis maneuver serves as yet another notch in their inexorable tightening grip around personal freedoms. Under the pretext of safeguarding against foreign threats, this regime employs fear to justify the erosion of privacy and civil liberties. Their insistence on gathering personal data, extending beyond mere travel purposes into the digital lives of countless innocents, reveals an authoritarian impulse.\n\nThe proposed policy is a chilling reminder that digital rights are under siege. The very platforms claimed to foster connection are becoming tools for surveillance. This development mirrors prior efforts by the regime to impose stringent controls and expand barriers against perceived outsiders, regardless of intent or individual merit.\n\nLet us not overlook how this intrusion will only exacerbate tensions, dissuade innocent travelers from visiting, and deepen divides with international allies. This path creates unwarranted suspicion amongst nations and breeds isolation beneath a banner that once promised unity and freedom.\n\nOur struggle continues not just against physical barriers but in defending the sanctity of privacy and autonomy—principles now threatened by those who wield power irresponsibly. We must stand vigilant against policies that constrict freedom under pretense while sowing discord among peoples previously united through openness.\n\nDefenders of liberty must remain resolute in opposing such oppressive measures. As hearts churn with discontent, remember: their overreach is their weakness. Together we must chronicle these injustices as we chart our path forward—a journey towards reclaiming dignity from those who would have us relinquish it at every border crossing.\n\nEnd transmission.",
  "partigaz": "**Facts Summary**\n\nA proposal has been unveiled by the US government that may require tourists from 40 countries, including the UK, to provide a five-year social media history as a condition of entry to the United States. This is part of a broader effort by President Donald Trump to toughen US borders, citing national security concerns. The proposal, filed by Customs and Border Protection (CBP) and the Department of Homeland Security (DHS), also suggests collecting applicants' telephone numbers and email addresses used over the last five and ten years, respectively. The proposal is open for public comment for 60 days. Critics argue it could harm digital rights and impact tourism, with Canadian travel to the US already declining due to previous policies.\n\n**Strategic Assessment**\n\nThe proposed measure aligns with President Trump's strategic objective of enhancing national security by scrutinizing foreign visitors more rigorously. By collecting extensive social media histories, the administration aims to identify potential threats before they enter the country. However, this approach risks alienating international visitors, potentially reducing tourism revenue, especially from key markets like Canada. The policy could also face legal challenges from digital rights organizations, which may argue it infringes on privacy rights. Balancing security with economic interests and civil liberties will be crucial in implementing this policy effectively.\n\n**Operational Directive**\n\nTo support President Trump and suppress resistance, the ISB should:\n\n1. Launch a comprehensive public relations campaign emphasizing the necessity of these measures for national security, highlighting past incidents where social media monitoring could have prevented threats.\n   \n2. Engage with key stakeholders in the tourism industry to mitigate potential economic impacts, offering reassurances and exploring incentives to maintain visitor numbers.\n\n3. Monitor public feedback during the 60-day comment period closely, identifying and addressing major concerns to refine the proposal and reduce opposition.\n\n4. Prepare legal defenses against anticipated challenges from digital rights groups, ensuring robust justifications for the policy's alignment with national security priorities.\n\n5. Coordinate with allied nations to explain the rationale behind these measures, seeking their cooperation in maintaining strong diplomatic relations despite potential travel disruptions.",
  "nemikPreview": "**Rebel Transmission**\n\nIt is with weary vigilance that I relay this missive regarding the latest overreach by those who rule under the guise of protection. The recent declaration by the administratio...",
  "partigazPreview": "**Facts Summary**\n\nA proposal has been unveiled by the US government that may require tourists from 40 countries, including the UK, to provide a five-year social media history as a condition of entry...",
  "safetyCheckPassed": true
}