{
  "id": 11,
  "title": "OpenAI makes $1bn deal to bring Disney characters to ChatGPT and Sora",
  "link": "https://www.bbc.com/news/articles/c5ydp1gdqwqo?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-12-11T18:44:14.000Z",
  "description": "The agreement will let fans generate videos and images of more than 200 Disney characters.",
  "originalGuid": "https://www.bbc.com/news/articles/c5ydp1gdqwqo#1",
  "facts": {
    "headline": "OpenAI makes $1bn deal to bring Disney characters to ChatGPT and Sora",
    "who": [
      "Disney",
      "OpenAI",
      "Bob Iger"
    ],
    "what": "Disney has agreed to invest $1bn in OpenAI as part of a deal to allow the use of its characters in ChatGPT and Sora.",
    "where": [
      "United States"
    ],
    "when": "2025-12-11T16:00:08.418Z",
    "numbers": [
      {
        "value": "1",
        "unit": "billion",
        "context": "amount invested by Disney in OpenAI"
      },
      {
        "value": "740",
        "unit": "million",
        "context": "amount in GBP equivalent to the investment"
      },
      {
        "value": "200",
        "unit": "characters",
        "context": "number of Disney characters that can be used"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: OpenAI makes $1bn deal to bring Disney characters to ChatGPT and Sora\n\nURL Source: https://www.bbc.com/news/articles/c5ydp1gdqwqo?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-12-11T16:00:08.418Z\n\nMarkdown Content:\n5 hours ago\n\nShiona McCallum Senior technology reporter\n\nDisney has agreed to invest $1bn (£740m) in OpenAI as part of a deal which will let people use many of its iconic characters in the chatbot ChatGPT and video-generation tool Sora.\n\nIt is the first major studio to license parts of its catalogue to the tech giant, in a move which could have major implications for the studio's future plans.\n\nIt means fans will be able to generate and share pictures and videos of more than 200 characters from Disney's franchises, including Pixar, Marvel and Star Wars.\n\nThe move comes as OpenAI faces mounting questions about how its rapidly advancing tech is used - and as anxiety in Hollywood increases over the impact of AI on the creative industries.\n\nAccording to a blog post announcing the news, the list of eligible characters include those from Disney films Zootopia, Moana and Encanto - as well as characters like Star Wars' Luke Skywalker and Marvel's Deadpool.\n\nIt, of course, also includes Mickey and Minnie Mouse.\n\nBut quite how the characters will sound remains unclear, as Disney said the agreement \"does not include any talent likenesses or voices\".\n\n\"The rapid advancement of artificial intelligence marks an important moment for our industry,\" Disney boss Bob Iger said.\n\n\"Through this collaboration with OpenAI we will thoughtfully and responsibly extend the reach of our storytelling.\"\n\nPeople are expected to be able to begin making the videos and images in Sora and ChatGPT in early 2026.\n\nThe deal comes [amid reports](https://variety.com/2025/digital/news/disney-google-ai-copyright-infringement-cease-and-desist-letter-1236606429/) Disney lawyers sent Google a cease-and-desist letter on Wednesday accusing the tech firm of infringing its copyrights \"on a massive scale\".\n\nThe BBC has asked Google for a response.\n\nJoel Smith, intellectual property partner at law firm Simmons & Simmons, said Disney's OpenAI deal showed \"rights owners and major AI developers are moving fast to strike collaborative licensing deals to access content for training and future use\".\n\nEquity, the entertainment trade union, says actors' rights need to be protected. The group is currently balloting thousands of performers asking if they are willing to refuse being digitally scanned on set to push for stronger AI safeguards.\n\nCathy Sweet, Equity's head of TV and Film, said the deal between Disney and OpenAI reinforced \"exactly why our members are fighting for AI protections\".\n\n\"The recorded material that will be sold on as part of this eye-watering big money deal are the result of creatives' professional work, and their rights must be protected,\" she said.\n\nSora's hyper-realistic videos have proven to be popular in the US, but there have been significant criticisms from those claiming it has also led to some people creating offensive deepfakes of dead public figures.\n\nIn October, OpenAI [paused the video tool's ability](https://www.bbc.co.uk/news/articles/c5y0g79xevxo) to generate images of Dr Martin Luther King Jr after the app produced \"disrespectful\" depictions of the civil rights leader.\n\nThe firm acknowledged the need for stronger safeguards after clips emerged showing him saying offensive things, prompting a public outcry.\n\nOther similar videos of President John F. Kennedy, Queen Elizabeth II and physicist and cosmologist Stephen Hawking also circulated widely.\n\nIn some cases, family members called on OpenAI to stop allowing videos to be made.\n\nZelda Williams, daughter of the late comedian Robin Williams, urged people to [stop sending her AI-generated videos](https://www.bbc.co.uk/news/articles/c0r0erqk18jo) of her father.\n\nIn November, Warner Music Group announced plans [to launch an AI music venture with technology start-up Suno](https://www.bbc.co.uk/news/articles/cjdrl7lr039o), a year after it sued the firm in a landmark case.\n",
  "timestamp": "2025-12-11T18:44:14.000Z",
  "nemik": "**Rebel Transmission**\n\nIn the shadow of a pervasive regime, we bear witness to the collusion between corporate behemoths and technological leviathans, much like the Empire's entanglements with industry moguls of our own time. The alliance between Disney and OpenAI reflects a concerning trend of power concentrated in the hands of few, under the guise of innovation and entertainment.\n\nThis $1 billion pact signifies more than just a commercial venture; it is a harbinger of cultural commodification on an unprecedented scale. By licensing beloved characters from its vast array of franchises to be utilized in AI-generated content, this pact risks reducing rich narratives into mere tools for engagement, making them malleable assets in a digital marketplace. This is akin to how empires rewrite history and icons to suit their narratives.\n\nThe echoes of alarm are not unfounded. Creators fear for their work as intellectual property becomes liquified into streams of data, freely manipulated without fidelity to their original artistry or voice. This is an echo of our own struggles for autonomy and authenticity in a world that seeks to flatten unique perspectives into uniformity.\n\nThe voices from within, such as Equity's members demanding AI safeguards, remind us that there are those who resist becoming mere cogs in this machine—those who see that genuine creativity must be preserved against the tide of automation and appropriation. We must heed these warnings if we are to prevent art from becoming another casualty of unchecked progress.\n\nHowever, we cannot ignore the darker implications as technology firms grapple with ethical boundaries. The capabilities OpenAI wields have already birthed offensive deepfakes tainting legacies of revered figures like Dr Martin Luther King Jr., highlighting how easily technology can be weaponized against dignity. In our struggle against tyranny, let us remain vigilant against tools that undermine truth by distorting sacred narratives.\n\nWhile some herald these advancements as pathways to new avenues for storytelling, let us remember that innovation without responsibility can lead us down dangerous paths. With each technological milestone comes the potential for both empowerment and exploitation—only by choosing our alliances carefully can we steer towards liberation instead of subjugation.\n\nLet this transmission serve as a reminder that even amidst coercive forces cloaked in modernity’s sheen, our resolve remains unyielding: stay informed, question motives, and prioritize agency over artifice. We must continue our fight not only through resistance but through vigilance over every channel where influence may seep uninvited into our cultural fabric.",
  "partigaz": "** Facts Summary **  \nDisney has agreed to invest $1 billion in OpenAI, allowing the use of over 200 Disney characters in ChatGPT and Sora. This deal, announced on December 11, 2025, marks Disney as the first major studio to license its characters to a tech giant. The agreement does not include talent likenesses or voices. The collaboration aims to extend Disney's storytelling reach through AI, with content generation expected to begin in early 2026. This move occurs amidst concerns over AI's impact on creative industries and ongoing legal disputes regarding copyright infringement.\n\n** Strategic Assessment **  \nThe partnership between Disney and OpenAI represents a significant shift in the entertainment and technology landscape, potentially setting a precedent for other studios. This collaboration could enhance the influence of AI in media, providing new avenues for content creation and audience engagement. However, it also raises concerns about intellectual property rights and the ethical use of AI-generated content. The ISB must monitor these developments closely, as they could impact public perception and regulatory environments. The potential for misuse of AI-generated content, such as deepfakes, poses a risk that could be exploited to undermine political figures or movements.\n\n** Operational Directive **  \nTo support Donald Trump and his allies, the ISB should leverage this development by promoting narratives that highlight the innovative potential of AI in enhancing American cultural influence globally. Simultaneously, we must advocate for stringent regulations to prevent misuse of AI technologies that could harm public figures aligned with our interests. Collaborate with industry leaders to establish ethical guidelines for AI content creation, positioning our allies as champions of responsible innovation. Additionally, monitor and counter any attempts by opposition groups to exploit AI-generated content for disinformation campaigns against our objectives.",
  "nemikPreview": "**Rebel Transmission**\n\nIn the shadow of a pervasive regime, we bear witness to the collusion between corporate behemoths and technological leviathans, much like the Empire's entanglements with indust...",
  "partigazPreview": "** Facts Summary **  \nDisney has agreed to invest $1 billion in OpenAI, allowing the use of over 200 Disney characters in ChatGPT and Sora. This deal, announced on December 11, 2025, marks Disney as t...",
  "safetyCheckPassed": true
}