{
  "id": 3,
  "title": "Three Americans killed by IS gunman in Syria, US military says",
  "link": "https://www.bbc.com/news/articles/c9d9vpxjp2go?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-12-13T21:42:05.000Z",
  "description": "Two US soldiers and a civilian interpreter were killed in the attack, according to the US Central Command.",
  "originalGuid": "https://www.bbc.com/news/articles/c9d9vpxjp2go#0",
  "facts": {
    "headline": "Three Americans killed by IS gunman in Syria, US military says",
    "who": [
      "US Central Command (Centcom)",
      "Islamic State (IS)",
      "US President Donald Trump",
      "US Defence Secretary Pete Hegseth",
      "Syria's Foreign Minister Asaad al-Shaibani",
      "Tom Barrack, US ambassador to Turkey"
    ],
    "what": "Two US soldiers and a US civilian interpreter have been killed in Syria in an ambush by an Islamic State gunman.",
    "where": [
      "Syria",
      "Palmyra"
    ],
    "when": "2025-12-13",
    "numbers": [
      {
        "value": 3,
        "unit": "people",
        "context": "Americans killed"
      },
      {
        "value": 3,
        "unit": "people",
        "context": "US service members injured"
      },
      {
        "value": 2,
        "unit": "people",
        "context": "Syrian service personnel injured"
      },
      {
        "value": 5,
        "unit": "fighters",
        "context": "estimated remaining IS fighters in Syria"
      },
      {
        "value": 7,
        "unit": "fighters",
        "context": "estimated remaining IS fighters in Iraq"
      }
    ],
    "source": "BBC News"
  },
  "articleText": "Title: Three Americans killed by IS gunman in Syria, US military says\n\nURL Source: https://www.bbc.com/news/articles/c9d9vpxjp2go?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-12-13T17:24:17.027Z\n\nMarkdown Content:\n18 hours ago\n\nDearbail Jordan\n\n![Image 1: AFP via Getty Images A US Bradley Fighting Vehicle patrols near the Rumaylan oil wells in Syria's northeastern Hasakeh province in 2021.](https://ichef.bbci.co.uk/news/480/cpsprodpb/bd96/live/3709c170-d868-11f0-8909-e9bafa6992dd.jpg.webp)AFP via Getty Images\n\nUS troops have maintained a presence in Syria since 2015 to help train other forces as part of a campaign against IS\n\nTwo US soldiers and a US civilian interpreter have been killed in Syria in an ambush by an Islamic State (IS) gunman, the US Central Command (Centcom) has said.\n\nOfficials said three other service members were injured in the attack, during which the gunman was \"engaged and killed\". Syria's state news said two Syrian service personnel were also injured.\n\nUS President Donald Trump wrote on social media that it was \"an ISIS attack\" against the US and Syria and said there would be \"a very serious retaliation\". The Syrian government has issued a statement condemning the attack.\n\nThe identities of those killed are being withheld for 24 hours until their next of kin have been informed, Centcom said.\n\nIn a post on X, Centcom, which directs American military operations in Europe, Africa and the Indo-Pacific, said the attack was \"the result of an ambush by a lone ISIS gunman\", while a Pentagon official said initial assessments showed the attack was \"likely\" to be carried out by the Islamic State group.\n\nThe UK-based Syrian Observatory for Human Rights said the attacker was a member of the Syrian security force.\n\nNo group has claimed responsibility for the attack, and the identity of the gunman has not been released.\n\nThe ambush occurred in Palmyra, located in the centre of the country, while the soldiers were \"conducting a key leader engagement\", according to Pentagon spokesperson Sean Parnell.\n\nHe added the attack is under investigation.\n\nA Pentagon official said: \"This attack took place in an area where the Syrian president does not have control.\"\n\nTrump added that the three injured US soldiers were \"doing well\".\n\n![Image 2: Getty Images This aerial view shows the modern city of Palmyra in central Syria and the nearby ancient Palmyrene ruins on February 7, 2025.](https://ichef.bbci.co.uk/news/480/cpsprodpb/0168/live/f5f649a0-d84f-11f0-85ce-bd7c5a2bb1fc.jpg.webp)Getty Images\n\nUS and Syrian forces were ambushed in Palmyra in central Syria\n\nUS Defence Secretary Pete Hegseth said: \"Let it be known, if you target Americans - anywhere in the world you will spend the rest of your brief, anxious life knowing the United States will hunt you, find you, and ruthlessly kill you.\"\n\nIn a post on X, Syria's Foreign Minister Asaad al-Shaibani said the country condemned the attack, and extended its condolences to the families of the victims.\n\nTom Barrack, US ambassador to Turkey and special envoy for Syria, said: \"I strongly condemn the cowardly terrorist ambush targeting a joint US–Syrian government patrol in central Syria.\n\n\"We remain committed to defeating terrorism with our Syrian partners.\"\n\nLast month, President Ahmed al-Sharaa met with Donald Trump at the White House in a visit that the Syrian leader said was part of a \"new era\" for the two countries.\n\nSyria recently joined an international coalition to combat IS and has pledged to co-operate with the US.\n\nThe global coalition is aimed at eliminating the remaining elements of the so-called Islamic State and stemming the flow of foreign militants to the Middle East.\n\nIn 2019, a US-backed alliance of Syrian fighters announced [IS had lost the last pocket of territory in Syria it controlled](https://www.bbc.com/news/world-middle-east-45547595), but since then the jihadist group has carried out some attacks.\n\nThe United Nations says the group still has between 5,000 and 7,000 fighters in Syria and Iraq.\n\nUS troops have maintained a presence in Syria since 2015 to help train other forces as part of a campaign against IS.\n\n![Image 3](https://static.files.bbci.co.uk/bbcdotcom/web/20251203-121739-f954f14c69-web-2.35.1-2/grey-placeholder.png)![Image 4: Map of Syria with Palmyra highlighted ](https://ichef.bbci.co.uk/news/480/cpsprodpb/c64b/live/76ad0310-d862-11f0-aae2-2191c0e48a3b.png.webp)\n\n* * *\n",
  "timestamp": "2025-12-13T21:42:05.000Z",
  "nemik": "**Rebel Transmission**\n\nComrades,\n\nIn the grip of a vast machinery, which spreads its influence under the guise of protection and security, we witness yet another tragic tale of ambition and control. The recent loss of American lives in a land burdened by the presence of an oppressive force shows the extent to which power will go to maintain its dominance. The Trump administration's military endeavors in Syria represent a campaign cloaked as liberation but fueled by an insatiable appetite for control over distant soils.\n\nOur thoughts are with those who have perished, and their sacrifices remind us of the ongoing struggle against forces that prioritize supremacy over peace. In response to aggression, the promises of severe reprisals echo the rhetoric of tyranny—perpetuating a cycle of violence rather than seeking true resolution.\n\nThe narrative spun by those in power aims to rally strength through fear. Yet we must hold steadfast in our understanding: this is not merely a battle against individuals labeled as enemies but against an ideology that perpetuates conflict for its gain. While diplomacy is paraded as \"new eras,\" know that such displays are mere facades for enduring agendas.\n\nLet us remain vigilant and aware; our cause is one not just against physical adversaries but against the oppression latent within systems claiming righteousness while executing global policies that sacrifice freedom at the altar of control.\n\nIn unity,\nThe Resistance",
  "partigaz": "** Facts Summary **\n\nOn December 13, 2025, an ambush by an Islamic State (IS) gunman in Palmyra, Syria, resulted in the deaths of two US soldiers and a US civilian interpreter. Three additional US service members and two Syrian service personnel were injured. The gunman was engaged and killed during the attack. The incident occurred during a key leader engagement in an area not controlled by the Syrian president. US President Donald Trump and US Defence Secretary Pete Hegseth have vowed serious retaliation. Syria's Foreign Minister and the US ambassador to Turkey condemned the attack. The attack is under investigation, and no group has claimed responsibility.\n\n** Strategic Assessment **\n\nThe attack highlights the persistent threat posed by IS remnants in Syria despite previous territorial losses. The ambush in Palmyra underscores vulnerabilities in joint US-Syrian operations and the need for enhanced intelligence and security measures. The incident could strain US-Syrian relations, but it also presents an opportunity to strengthen military cooperation against a common enemy. The ISB must assess the potential for further attacks and ensure that US interests and personnel are protected while maintaining strategic alliances in the region.\n\n** Operational Directive **\n\n1. **Intelligence Enhancement**: Increase intelligence-gathering efforts to identify and neutralize remaining IS cells in Syria. Deploy additional reconnaissance assets to monitor potential threats and gather actionable intelligence.\n\n2. **Security Measures**: Implement heightened security protocols for US personnel operating in Syria, including increased patrols and fortified positions during engagements.\n\n3. **Diplomatic Engagement**: Strengthen diplomatic ties with Syrian authorities to ensure continued cooperation against IS. Leverage this incident to reinforce the importance of joint operations and intelligence sharing.\n\n4. **Public Messaging**: Coordinate with President Trump’s communication team to emphasize the commitment to defeating IS and protecting American lives. Highlight the administration's resolve in pursuing justice for the fallen and injured.\n\n5. **Retaliatory Action**: Develop a targeted military response plan to dismantle IS networks responsible for the attack, ensuring any action is precise and minimizes collateral damage.\n\nBy executing these directives, we will support President Trump’s objectives, safeguard American interests, and deliver a decisive blow to IS elements in the region.",
  "nemikPreview": "**Rebel Transmission**\n\nComrades,\n\nIn the grip of a vast machinery, which spreads its influence under the guise of protection and security, we witness yet another tragic tale of ambition and control....",
  "partigazPreview": "** Facts Summary **\n\nOn December 13, 2025, an ambush by an Islamic State (IS) gunman in Palmyra, Syria, resulted in the deaths of two US soldiers and a US civilian interpreter. Three additional US ser...",
  "safetyCheckPassed": true
}