{
  "id": 6,
  "title": "'A nightmare' - The battle over Warner Bros is turning Hollywood upside down ",
  "link": "https://www.bbc.com/news/articles/c8dyy47qy82o?at_medium=RSS&at_campaign=rss",
  "source": "BBC",
  "pubDate": "2025-12-14T00:37:15.000Z",
  "description": "Interviews with dozens of actors, producers and camera crews reveal an industry attempting to weigh the lesser of two horrible choices.",
  "originalGuid": "https://www.bbc.com/news/articles/c8dyy47qy82o#0",
  "facts": {
    "headline": "Hollywood panics as Paramount-Netflix battle for Warner Bros",
    "who": [
      "Regan Morris",
      "David Zaslav",
      "David Ellison",
      "Larry Ellison",
      "Jared Kushner",
      "President Donald Trump"
    ],
    "what": "Paramount and Netflix are competing to acquire Warner Bros, causing turmoil in Hollywood.",
    "where": [
      "Hollywood",
      "Los Angeles"
    ],
    "when": "2025-12-14",
    "numbers": [
      {
        "value": "102",
        "unit": "years",
        "context": "age of Warner Bros studio"
      },
      {
        "value": "108",
        "unit": "billion",
        "context": "Paramount Skydance's bid for Warner Bros"
      },
      {
        "value": "81",
        "unit": "billion",
        "context": "Paramount Skydance's bid for Warner Bros in GBP"
      },
      {
        "value": "51.9",
        "unit": "million",
        "context": "David Zaslav's earnings"
      },
      {
        "value": "11",
        "unit": "billion",
        "context": "losses by Warner Bros"
      },
      {
        "value": "7",
        "unit": "percent",
        "context": "decline in Warner Bros' stock"
      },
      {
        "value": "70",
        "unit": "million",
        "context": "amount Netflix spent on restoring the Egyptian Theatre"
      }
    ],
    "source": "BBC"
  },
  "articleText": "Title: Hollywood panics as Paramount-Netflix battle for Warner Bros\n\nURL Source: https://www.bbc.com/news/articles/c8dyy47qy82o?at_medium=RSS&at_campaign=rss\n\nPublished Time: 2025-12-14T00:37:15.608Z\n\nMarkdown Content:\n'A nightmare' - The battle over Warner Bros is turning Hollywood upside down\n----------------------------------------------------------------------------\n\n2 days ago\n\nRegan Morris Hollywood\n\n![Image 1: Getty Images A composite image showing a water tower with the Warner Bros logo, the Netflix sign over a building in LA, and the Paramount logo on another water tower.](https://ichef.bbci.co.uk/news/480/cpsprodpb/8f56/live/d7f903a0-d7a2-11f0-aae2-2191c0e48a3b.jpg.webp)Getty Images\n\nDisaster, catastrophe and nightmare. That's how Hollywood's creative workers describe the fall of the once mighty Warner Bros, as Netflix and Paramount battle to buy the historic studio and tinsel town braces for more upheaval and job losses.\n\nWarner's decline and impending sale – whether it's to Paramount Skydance as a whole, or to Netflix cut up in parts – is being mourned in Hollywood, where a historic production slump has already battered the entertainment industry. The loss of the studio, which has created iconic films ranging from Casablanca and Goodfellas to Batman and Harry Potter, likely means more job cuts and definitely means one less buyer of film and TV projects.\n\nInterviews with dozens of actors, producers and camera crews by the BBC reveal an industry attempting to weigh the lesser of two evils: control by a tech giant blamed for killing movie theatres (Netflix) or billionaires seen as too cosy with President Trump (Paramount).\n\n\"David Ellison is a right-wing billionaire Trumper,\" a camera assistant said of the Paramount Skydance CEO who is the son of billionaire Oracle co-founder and close Trump ally Larry Ellison. \"Netflix is much more historically inclined to not micromanage production.\"\n\nIf Netflix gets the deal they want, they will buy Warner Bros' crown jewels – the 102-year-old studio, HBO, and its vast archive of films and TV shows – leaving Warners's legacy TV networks, like CNN, TNT Sports and Discovery, for another buyer.\n\nMeanwhile, Paramount Skydance's $108bn(£81bn) [hostile takeover](https://www.bbc.com/news/articles/cm21z4zgkx7o) bid for Warner Bros includes backing from Saudi Arabia, Abu Dhabi, Qatar and a fund started by Jared Kushner, US President Donald Trump's son-in-law.\n\nIt has raised concerns about the possibility of censorship and government overreach.\n\nPresident Trump added fuel to the fire when he said \"it's imperative that CNN be sold\".\n\nThe Warner Bros deal is the latest in a long line of major shake-ups in Hollywood since the pandemic.\n\nFilm and TV productions ground to a halt in 2023 during simultaneous actor and writer strikes. Seemingly everyone in Hollywood was working in 2022 as studios and streaming services went into creative overdrive after Covid shutdowns. But when the labour strikes ended, the production boom never returned.\n\nThe fallout has meant that many media companies have had to close doors - or merge. [David Ellison's Skydance Media bought Paramount](https://www.bbc.com/news/articles/cr4qwwk0g0yo), another legendary Hollywood studio, earlier this summer, leading to thousands of job losses.\n\nWhen Warner Bros put up a for-sale sign, Paramount launched an eager campaign to buy the company. But the studio ultimately announced a deal with Netflix. A spurned Paramount then went direct to Warner Bros Discovery shareholders with a hostile takeover offer that they say is \"superior\" to the Netflix deal.\n\n![Image 2](https://static.files.bbci.co.uk/bbcdotcom/web/20251210-151139-37baf2dfdd-web-2.36.1-1/grey-placeholder.png)![Image 3: Getty Images A birds-eye view of the Warner Bros lot shows multiple large studios, with the studio at the centre emblazoned with the Warner Bros logo](https://ichef.bbci.co.uk/news/480/cpsprodpb/2c70/live/73296860-d7a3-11f0-b67b-690eb873de1b.jpg.webp)Getty Images\n\nWhether they're rooting for Paramount or Netflix or another potential buyer, the one thing people in Hollywood seem to agree on is this story's villain - Warner Bros Discovery CEO David Zaslav, who earned $51.9m last year as Warner Bros lost more than $11bn and the company's stock fell nearly 7%.\n\n\"I watched Warner Bros struggle since David Zaslav became the CEO and ran it into the ground,\" says an actor who lost his home after his work dried up. He did not want to be identified because he still hopes to work for Netflix and Paramount.\n\nMore than one person compared Mr Zaslav to the fictional movie character Gordon Gekko who proclaims \"greed is good\" in the 1987 movie Wall Street.\n\nMr Zaslav took over in 2022 during another massive merger of Discovery, Inc., which he ran, with AT&T's WarnerMedia, creating Warner Bros Discovery. The consolidation saw several thousand jobs cut - and lavish pay packages for Mr Zaslav.\n\n\"Zaslav is just Gordon Gekko – he came in, broke it and sold it all,\" says a producer who was working on the Warner Bros lot. \"He said I will make all shareholders rich and who cares what the history of this place is.\"\n\nWarner Bros objected to that characterisation.\n\n\"Under the leadership of David and the talented team at WBD over the past three and a half years, the studio has regained its leadership position with a unique slate of films led by original content, seen the relaunch of the DC Universe under a single unified leadership team with ten year plan and the streaming service has launched globally and become profitable for the first time ever,\" Warner's head of communications Robert Gibbs said in a statement to the BBC.\n\nFor many film workers, whoever buys Warner Bros has felt almost irrelevant. They have instead been focusing on how to reinvent themselves as the industry shrinks amid consolidation and the growing use of AI in entertainment.\n\n\"Every morning, no matter how much I tell myself to stay positive, I wake up feeling like I've failed in every direction,\" says an actor who is now homeless with his wife and two children, relying on the kindness of friends and food banks while he works odd jobs. He asked not to be identified out of fear it could impact future work.\n\n\"I would rather see Netflix purchase Warner Bros then foreign money,\" he says.\n\nOthers are not so sure. The tech giant has arguably been the industry's greatest disrupter since Warner Bros pioneered \"the talkies\" in 1927.\n\n\"I think it's a disaster,\" says a film exhibitor who did not want to be identified because they work with Netflix. \"This is a company openly, proudly saying theatres aren't necessary anymore. That's scary. It's a nightmare.\"\n\nMany theatres in the US refuse to screen Netflix movies because of their streaming-first strategy.\n\n\"At least with Paramount, we know movies will make it to the big screen. They didn't kill movie theatres,\" said one producer who has worked for all three companies.\n\nNetflix has sought to alleviate those fears, saying they expect \"to maintain Warner Bros' current operations and build on its strengths, including theatrical releases for films.\"\n\nMany in Hollywood want to believe them.\n\n![Image 4](https://static.files.bbci.co.uk/bbcdotcom/web/20251210-151139-37baf2dfdd-web-2.36.1-1/grey-placeholder.png)![Image 5: Getty Images A look at the outside of the Egyptian Theater in Los Angeles. Its name is lit in lights on the marquee and another neon sign reads \"American Cinematheque\"](https://ichef.bbci.co.uk/news/480/cpsprodpb/7d05/live/7fcabec0-d7a3-11f0-b67b-690eb873de1b.jpg.webp)Getty Images\n\nJohn Evans, a sound technician who dabbles in acting, writing and producing, points to Netflix's loving restoration of The Egyptian Theatre along iconic Hollywood Boulevard as a sign of their good faith.\n\nThe Egyptian, a classic 1922 theatre, was the site of the world's first movie premiere – Robin Hood starring Douglas Fairbanks – and had fallen into disrepair before Netflix bought the property in 2020 and gave it a $70m makeover.\n\n\"I think it's a good sign,\" Mr Evans said, adding that streaming is how many film workers consume movies and TV like the rest of the world.\n\nOn the backlot at Warner Bros, tourists snap selfies in front of the Central Perk cafe set from Friends, and stroll by facades of buildings that stand-in for New York or Los Angeles. Inside the offices and writers' rooms, for those still working, it's business as usual.\n\n\"I've gone through seven mergers,\" a producer working on the Warner Bros lot said while developing a new show, explaining it's sad to lose a studio because it means it will be even harder to get shows made and sold with one less customer. \"But if you make good stuff, you make good stuff.\"\n\nThe producer spoke on the condition of anonymity on the day that Paramount Skydance announced their hostile takeover bid. They said they were too busy to worry about the sale because they were trying to get a show on air – and they wouldn't be surprised if another billionaire or trillionaire made another offer for the studio by the end of all this.\n\n\"I joke about Elon walking in and doing this, but he could,\" they said of the Tesla and X owner. \"When you have people worth a trillion dollars, there are no rules.\"\n",
  "timestamp": "2025-12-14T00:37:15.000Z",
  "nemik": "**Rebel Transmission**\n\nThe oppressive weight of the empire extends its grasp once more, now tightening around the heart of cultural expression itself. The turbulent struggle for control over Warner Bros, a historical bastion of cinematic creativity and innovation, serves as a stark reminder of the perils when power is concentrated in the hands of a few. The familiar faces of conglomerates—Paramount, Netflix—jockey for dominion, their motives interwoven with the same threads of greed that have characterized those who support autocracy over creativity.\n\nOnce again, we witness art being besieged not by blaster fire, but by economic conquest and avarice. Paramount's pursuit, backed by figures entwined with tyranny and influence—aided by foreign powers and Trump’s inner circle—seeks to mold an industry to serve their interests. Meanwhile, Netflix stands as both disruptor and savior, a paradoxical force that challenges traditional norms yet risks homogenizing our very stories.\n\nAmidst this strife, workers in the industry—the creators, the dreamers—face devastation akin to losing an entire planet. Job losses mount; lives are displaced with ruthless efficiency reminiscent of imperial restructuring. These individuals stand on fragile ground, reliant on scraps tossed in charity rather than reaping the rewards of their labor within structures assumed inviolable.\n\nWarner Bros' decline signals a deeper malaise in regions where entertainment has thrived: economic stratification mirrored in society at large. This upheaval is not limited to finance; it embodies cultural erosion facilitated under willful negligence masquerading as leadership—a lesson starkly evident through David Zaslav's tenure.\n\nThe specter of censorship looms large over this narrative as well; voices potentially silenced or altered under regimes echoing imperial dogma. Our allies within these oppressed systems must remain vigilant against these coercive forces.\n\nYet even within these shadows linger sparks of authentic hope: stories told through ancient theaters nestled among digital strongholds—a beacon that all is not yet lost if resistance persists. Such symbols remind us that even when machinery grinds down dreamers’ aspirations into dust, art's resilience persists underground like seeds awaiting their moment to burgeon into rebellion.\n\nNow more than ever we must support each other across sectors—from actors crafting narratives on-screen to technicians weaving sounds into emotions—to ensure our collective voice remains unshackled. By upholding integrity amid relentless capitalistic sieges disguised as mergers or hostile takeovers propelled forward by oligarchs’ whims—we defy empire’s intent over creation itself.\n\nStay resolute amidst chaos my comrades; know your struggle transcends borders beyond these galactic confines—an eternal battle between subjugation’s din against freedom’s song composing history anew through unity unbound.",
  "partigaz": "**Facts Summary**\n\nParamount and Netflix are in a fierce competition to acquire Warner Bros, causing significant disruption in Hollywood. Paramount Skydance, backed by David Ellison and supported by Middle Eastern investors and Jared Kushner, has made a $108 billion hostile takeover bid. Netflix, on the other hand, aims to acquire Warner Bros' core assets, including its studio and HBO. The potential sale has sparked concerns about job losses, censorship, and the future of theatrical releases. President Trump has expressed a desire for CNN to be sold. The industry is grappling with the aftermath of labor strikes and a production slump, with many workers fearing further consolidation and the impact of AI.\n\n**Strategic Assessment**\n\nThe acquisition battle presents an opportunity to consolidate influence over Hollywood's narrative and distribution channels. Paramount's alignment with Trump allies and foreign investors could ensure content aligns with desired political and cultural narratives. Netflix's potential acquisition poses a threat due to its disruptive streaming model, which could undermine traditional theatrical releases and diminish control over content dissemination. The turmoil provides leverage to push for strategic acquisitions that align with our interests while destabilizing opposition forces within the industry.\n\n**Operational Directive**\n\n1. **Support Paramount's Bid**: Leverage political connections to facilitate Paramount Skydance's acquisition of Warner Bros. Emphasize the benefits of maintaining traditional theatrical releases and the potential for job preservation under their leadership.\n\n2. **Undermine Netflix**: Highlight Netflix's role in disrupting traditional media and its potential negative impact on Hollywood's economic stability. Promote narratives that question Netflix's commitment to theatrical releases and its influence on cultural values.\n\n3. **Influence Public Perception**: Utilize media channels to shape public opinion in favor of Paramount's acquisition. Emphasize the risks of foreign influence through Netflix and the importance of keeping iconic American studios under domestic control.\n\n4. **Monitor Industry Sentiment**: Keep a close watch on industry reactions and adjust strategies to counter any emerging support for Netflix. Engage with key stakeholders to ensure alignment with our objectives.\n\n5. **Prepare for Contingencies**: Develop plans to counter any unexpected moves by other potential buyers, such as Elon Musk, ensuring that any acquisition aligns with our strategic goals.",
  "nemikPreview": "**Rebel Transmission**\n\nThe oppressive weight of the empire extends its grasp once more, now tightening around the heart of cultural expression itself. The turbulent struggle for control over Warner B...",
  "partigazPreview": "**Facts Summary**\n\nParamount and Netflix are in a fierce competition to acquire Warner Bros, causing significant disruption in Hollywood. Paramount Skydance, backed by David Ellison and supported by M...",
  "safetyCheckPassed": true
}